{"review_id":"v0i_UHJMo_hPBq9bxWvW4w","user_id":"bv2nCi5Qv5vroFiqKGopiw","business_id":"0W4lkclzZThpx3V65bVgig","stars":5,"date":"2016-05-28","text":"Love the staff, love the meat, love the place. Prepare for a long line around lunch or dinner hours. \n\nThey ask you how you want you meat, lean or something maybe, I can't remember. Just say you don't want it too fatty. \n\nGet a half sour pickle and a hot pepper. Hand cut french fries too.","useful":0,"funny":0,"cool":0}
{"review_id":"vkVSCC7xljjrAI4UGfnKEQ","user_id":"bv2nCi5Qv5vroFiqKGopiw","business_id":"AEx2SYEUJmTxVVB18LlCwA","stars":5,"date":"2016-05-28","text":"Super simple place but amazing nonetheless. It's been around since the 30's and they still serve the same thing they started with: a bologna and salami sandwich with mustard. \n\nStaff was very helpful and friendly.","useful":0,"funny":0,"cool":0}
{"review_id":"n6QzIUObkYshz4dz2QRJTw","user_id":"bv2nCi5Qv5vroFiqKGopiw","business_id":"VR6GpWIda3SfvPC-lg9H3w","stars":5,"date":"2016-05-28","text":"Small unassuming place that changes their menu every so often. Cool decor and vibe inside their 30 seat restaurant. Call for a reservation. \n\nWe had their beef tartar and pork belly to start and a salmon dish and lamb meal for mains. Everything was incredible! I could go on at length about how all the listed ingredients really make their dishes amazing but honestly you just need to go. \n\nA bit outside of downtown montreal but take the metro out and it's less than a 10 minute walk from the station.","useful":0,"funny":0,"cool":0}
{"review_id":"MV3CcKScW05u5LVfF6ok0g","user_id":"bv2nCi5Qv5vroFiqKGopiw","business_id":"CKC0-MOWMqoeWf6s-szl8g","stars":5,"date":"2016-05-28","text":"Lester's is located in a beautiful neighborhood and has been there since 1951. They are known for smoked meat which most deli's have but their brisket sandwich is what I come to montreal for. They've got about 12 seats outside to go along with the inside. \n\nThe smoked meat is up there in quality and taste with Schwartz's and you'll find less tourists at Lester's as well.","useful":0,"funny":0,"cool":0}
{"review_id":"IXvOzsEMYtiJI0CARmj77Q","user_id":"bv2nCi5Qv5vroFiqKGopiw","business_id":"ACFtxLv8pGrrxMm6EgjreA","stars":4,"date":"2016-05-28","text":"Love coming here. Yes the place always needs the floor swept but when you give out  peanuts in the shell how won't it always be a bit dirty. \n\nThe food speaks for itself, so good. Burgers are made to order and the meat is put on the grill when you order your sandwich. Getting the small burger just means 1 patty, the regular is a 2 patty burger which is twice the deliciousness. \n\nGetting the Cajun fries adds a bit of spice to them and whatever size you order they always throw more fries (a lot more fries) into the bag.","useful":0,"funny":0,"cool":0}
{"review_id":"L_9BTb55X0GDtThi6GlZ6w","user_id":"bv2nCi5Qv5vroFiqKGopiw","business_id":"s2I_Ni76bjJNK9yG60iD-Q","stars":4,"date":"2016-05-28","text":"Had their chocolate almond croissant and it was amazing! So light and buttery and oh my how chocolaty.\n\nIf you're looking for a light breakfast then head out here. Perfect spot for a coffee\/latté before heading out to the old port","useful":0,"funny":0,"cool":0}
{"review_id":"HRPm3vEZ_F-33TYVT7Pebw","user_id":"_4iMDXbXZ1p1ONG297YEAQ","business_id":"8QWPlVQ6D-OExqXoaD2Z1g","stars":5,"date":"2014-09-24","text":"Cycle Pub Las Vegas was a blast! Got a groupon and rented the bike for 11 of us for an afternoon tour. Each bar was more fun than the last. Downtown Las Vegas has changed so much and for the better. We had a wide age range in this group from early 20's to mid 50's and everyone had so much fun! Our driver Tony was knowledgable , friendly and just plain fun! Would recommend this to anyone looking to do something different away from the strip. You won't be disappointed!","useful":1,"funny":0,"cool":0}
{"review_id":"ymAUG8DZfQcFTBSOiaNN4w","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"9_CGhHMz8698M9-PkVf0CQ","stars":4,"date":"2012-05-11","text":"Who would have guess that you would be able to get fairly decent Vietnamese restaurant in East York? \n\nNot quite the same as Chinatown in terms of pricing (slightly higher) but definitely one of the better Vietnamese restaurants outside of the neighbourhood. When I don't have time to go to Chinatown, this is the next best thing as it is down the street from me.\n\nSo far the only items I have tried are the phos (beef, chicken & vegetarian) - and they have not disappointed me! Especially the chicken pho.\n\nNext time I go back, I'm going to try the banh cuon (steamed rice noodle) and the vermicelli!","useful":0,"funny":0,"cool":2}
{"review_id":"8UIishPUD92hXtScSga_gw","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"gkCorLgPyQLsptTHalL61g","stars":4,"date":"2015-10-27","text":"Always drove past this coffee house and wondered about it. BF and I finally made the stop to try this place out.\n\nCute, quaint coffee shop with nice muskoka chairs outside. \n\nBF ordered an ice coffee and really enjoyed it! Guess we will be back again!","useful":1,"funny":0,"cool":0}
{"review_id":"w41ZS9shepfO3uEyhXEWuQ","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"5r6-G9C4YLbC7Ziz57l3rQ","stars":3,"date":"2013-02-09","text":"Not bad!! Love that there is a gluten-free, vegan version of the cheese curds and gravy!!\n\nHaven't done the poutine taste test yet with smoke's but Im excited to see which is better. However poutini's might win as they are vegan and gluten-free","useful":1,"funny":0,"cool":0}
{"review_id":"WF_QTN3p-thD74hqpp2j-Q","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"fDF_o2JPU8BR1Gya--jRIA","stars":5,"date":"2016-04-06","text":"Love this place!\n\nPeggy is great with dogs and does a great job! She is very patience with him and will make any adjustments you need before you leave the store. My little guy has no problems coming here.\n\nThey also have very good bully sticks (the non-smelly ones) that my little guy and his friends love!","useful":3,"funny":0,"cool":0}
{"review_id":"PIsUSmvaUWB00qv5KTF1xA","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"z8oIoCT1cXz7gZP5GeU5OA","stars":4,"date":"2013-05-01","text":"This is currently my parents new favourite restaurant. \n\nWe come here in the morning for dim sum. They are not the cart pushing type of dim sum, it is order off of the sheet. Dim sum is not bad and not expensive either.\n\nWe also frequent the dinner scene. Their set dinner menu is not bad. We typically order a 6 dish menu and it's big enough to feed a family of 9 with leftovers. \n\nOverall, food is pretty tasty!","useful":1,"funny":0,"cool":0}
{"review_id":"PdZ_uFjbbkjtm3SCY_KrZw","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"XWTPNfskXoUL-Lf32wSk0Q","stars":3,"date":"2011-09-28","text":"Server was a little rude.\n\nOrdered the calamari, duck confit poutine and the trout fish with miso soba - all very tasty. Definitely not your typical diner.","useful":5,"funny":0,"cool":1}
{"review_id":"x5oV6wm9_Pb1QQ6jkjDjwQ","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"13nKUHH-uEUXVZylgxchPA","stars":1,"date":"2011-02-16","text":"I thought Tidy's Flowers had a great reputation as a florist, but I guess I was wrong!\n\nFor Valentine's Day my boyfriend had ordered roses with Tidy's. However, the flowers that were delivered was not what he had ordered. He had placed in an order for long stem roses, mixed with orchids and was charged for that. What had showed up was a small vase with 4 short cut roses and some greens - table ornament, not really Valentine's Day flowers. \n\nIn speaking with another friend, something similar happened to her - her fiancee had ordered a dozen of roses for her for Valentine's Day while he was in Germany as a surprise and they never showed up. So when he called them to complaint, they actually then called up my friend to confirm whether or not she had received the flowers. Which she didn't, so they said they would resend - only to have them deliver it to the wrong place.\n\nUnderstanding that Valentine's Day is the most busiest day for florists and mistakes do happen, the way they had handled it was not what would have been expected from a florist of that nature.","useful":9,"funny":0,"cool":1}
{"review_id":"lsoSqIrrDbQvWpMvsSj2xw","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"RtUvSWO_UZ8V3Wpj0n077w","stars":3,"date":"2012-12-03","text":"Wanted to check out this place due to all the hype I had heard. My friend wanted to come here for her birthday. We had a group of seven and based on the way the seating works (as it is communal), we wind up sharing with another group of five. \n\nFood was ok - not sure what the hype was. Almost 75% of the dishes had some sort of cheese in it.\n\nThis place is very loud so not ideal for catching up\/talking. Not a great place to go if you have any gluten or vegan restrictions.\n\nInteresting concept. Would definitely recommend to try this place once - but definitely not worth the 30- 45 mins wait.","useful":2,"funny":1,"cool":1}
{"review_id":"23eqwlZzCWZkADWfd9atZw","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"Aov96CM4FZAXeZvKtsStdA","stars":5,"date":"2010-07-16","text":"This place is awesome! Definitely authentic!!!\n\nMy two favourite dishes are the rice flour rolls and the chicken pho. The rice flour rolls are always fresh whenever I'm there! And the chicken pho is always flavourful!! mmmm....just thinking of it makes me want some!\n\nMy boyfriend is Vietnamese and he agrees that this place is authentic and one of the best Vietnamese restaurants he has ever eaten at.\n\nPrices are very reasonable too!","useful":2,"funny":0,"cool":1}
{"review_id":"FunI9om-aK5oMIIJmhMlZA","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"0W4lkclzZThpx3V65bVgig","stars":4,"date":"2011-09-28","text":"a must stop when you are in montreal!\n\nI was in Mtl for the weekend and wind up eating here 2 nights in a row!\n\nThe sandwiches here are unbelieveable! The smoked meat is so tasty and salty but so good. The bread definitely complements the meat!\n\nNot much of a line up if you come either later in the evening.\n\nRemember to leave a tip in the plate when you order take out and the servers will be extra nice and funny!","useful":0,"funny":0,"cool":0}
{"review_id":"FKu4iU62EmWT6GZXPJ2sgA","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"fdnNZMk1NP7ZhL-YMidMpw","stars":1,"date":"2012-10-23","text":"I too have been trying to book an appt to use my voucher - it's been months and countless of phone calls - no response yet.\n\nAgree with the buyers beware warning. I only wish reviews on this place was posted previous to my purchase of this voucher.","useful":0,"funny":0,"cool":0}
{"review_id":"xdu8nXrbNKeaywCX79KZSw","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"PFPUMF38-lraKzLcTiz5gQ","stars":3,"date":"2010-09-15","text":"Came here with my girlfriends one Sunday afternoon. This place will take a long time to serve your food - as it took them almost an hour to give us our food. So make sure you give yourself lots of time! It is definitely a lazy brunch place!\n\nDefinitely recommend the pancakes! Beware of the portion sizes - they are huge!","useful":2,"funny":0,"cool":0}
{"review_id":"K7o5jDInfmX3cY5oH6ATNw","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"oWTn2IzrprsRkPfULtjZtQ","stars":3,"date":"2012-09-23","text":"Came here for a burger as one of my friends said they had good burgers and people from work would come by twice a month for a burger run.\n\nOrdered the original was was ok, wasn't as amazing as everyone says it to be. I think the veggie option would have been better.\n\nA little pricy for a take-out burger.","useful":4,"funny":0,"cool":0}
{"review_id":"WYDFJOBOl7cycd7gN-c_xA","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"zgQHtqX0gqMw1nlBZl2VnQ","stars":1,"date":"2012-10-30","text":"really excited to hear of this restaurant coming to Toronto. When it finally opened, my friend and I were really excited to try this place.\n\nService here is not great, it felt like they had forgotten about us and that they didn't care about the service as everything came out one at a time. My friend and I had each ordered a ginger beer, which came out at two separate times (it was almost as if they had to go in the back and make it themselves - that's how long it took).\n\nThere is absolutely no vegetarian options, except for the one cold noodle - the mushroom bun is not vegetarian.\n\nThe pork belly bun was nothing special - just a piece of meat with the bun. For my vegetarian friend, we had ordered the bun plain so she could experience it as well, and they literally just gave it to us plain, with no sauce, no kimchi.\n\nThe Momofuko ramen was awful. It was bland and mushy. After a few bites, I couldn't handle eating anymore.\n\nMomofuko is not the place to go if you want real ramen. I've had better experience with instant noodles.","useful":9,"funny":2,"cool":1}
{"review_id":"HSR2RLOifd0cvSNVqGXkMQ","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"28adZ4lsuUeVB2aWzohK9g","stars":3,"date":"2012-10-19","text":"was always intrigued of this place when I pass by on the streetcar. Finally decided to try this place out this past summer. Read the reviews and everyone had lots of good things to say.\n\none of my friends has dietary restrictions and needs to have gluten-free items. When I had called to make the dinner reservation, I had asked and the hostess said, yes, we do have gluten-free items that are not just salads. Just let the server know when you come in.\n\nexcited to find another gluten-free place in town, my friends and I show up for the reservation. Upon arrival, the server was really nice and friendly. When we had asked about the gluten-free options, the answer was unfortunately as we do not cook our foods separately, the only gluten-free items are salads. Which was a disppointment to us, as we had specifically asked if there were gluten-free items that weren't salads on the menu.\n\nSo we decided to just order a couple of apps and drinks as we have been sitting there for quite some time, and it wasn't the server's fault that there wasn't any gluten-free items (we felt bad to just get up and leave). \n\nIn reading the reviews, everyone thought very highly of the mac and cheese and poutine, we had ordered that to try. It wasn't bad, but not sure what the hype was about. Definitely pretty rich and filling and made for sharing!","useful":1,"funny":0,"cool":0}
{"review_id":"Kki2nwtP8U2qmWwRvPwLRA","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"RWGI8u00x5GghYCEzpYrIg","stars":4,"date":"2011-10-14","text":"This place reminds of St Lawrence Market in Toronto but more veggies and fruits then seafood.\n\nFruits and veggies look so good! Too bad we didn't have a kitchen at our hotel room, cause we would have bought and cooked up a storm!!\n\nlots of varieties of apples!","useful":0,"funny":0,"cool":1}
{"review_id":"Q-mhDIKa3wJuWEx9uuciIA","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"Xy74meQwdTnloAAyRC-4cg","stars":3,"date":"2013-07-01","text":"burgers are very big portions here.\n\ndefinitely order the onion ring tower to share...\n\nMilkshakes are tasty! My personal favourite - the vanilla one.","useful":0,"funny":0,"cool":0}
{"review_id":"ypjtMQLKdAwKGRS-KU7oxA","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"hjk3ox7w1akbEuOgTJ03Bw","stars":1,"date":"2012-05-10","text":"Food is very bland - not authentic at all.\n\nmeant to cater to the customers who have never eaten Vietnamese food before.\n\nDefinitely will not be returning!","useful":4,"funny":2,"cool":0}
{"review_id":"vr9YpzkaVdDIauxiZYZhqA","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"ZnxudK5ExgpfXs4bicS4IA","stars":3,"date":"2012-09-23","text":"While looking at different restaurants in the area, came upon this restaurant posting and decided to try it, as it is down the street from work.\n\nNot bad when you want something slightly cheaper than Congee Star. It is a mix of chinese and choy suey menu.","useful":0,"funny":0,"cool":1}
{"review_id":"Ia-w-nR1FrlzsiuEiqqlbg","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"Eox_Qq74oaFZ-YjthpHhBw","stars":3,"date":"2011-07-18","text":"Service is really slow here. I waited for over 25 mins just for takeout. Definitely not worth the wait. However, they seem to have live music Friday nites, so if you are looking for entertainment and food sit-in is probably a lot faster","useful":1,"funny":1,"cool":1}
{"review_id":"y21Fom8a_SdAyC6I0v554w","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"zxJlg4XCHNoFy78WZPv89w","stars":2,"date":"2011-09-28","text":"a few years ago, this used to be the place to be for bunch. I was really excited to take my boyfriend here to experience one of the \"must visit places in MTL\". Boy were we disappointed!\n\nWe had ordered the eggspectation omelette and eggs benedict. The omelette was bland, overcooked. The eggs benedict were ok, but I've had better. The portion size has come down.\n\nOverall, food and service has gone downhill and not worth my time anymore.","useful":0,"funny":0,"cool":0}
{"review_id":"_ku1sDwkmQo2wIgWAaluZw","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"tOhRQqiupLyJdBJVQMGOEQ","stars":5,"date":"2012-09-23","text":"OMG - Definitely worth going if you are in Montreal!!\n\nAnd remember to eat it fresh - it is amazing paired with an organic cream cheese. mmmm....","useful":1,"funny":1,"cool":1}
{"review_id":"Enuk_DJbK0JPmgbFU8ePKw","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"N93EYZy9R0sdlEvubu94ig","stars":3,"date":"2012-09-23","text":"Not sure what the hype is, but decided to give this a try based on all the reviews.\n\nMaybe it was too hyped up, but it wasn't as amazing as I thought it would be. Maybe it was what we had ordered, but it was just ok. We had ordered the kimchi fries, which was kind of like a NY Fries \"the works\". The grilled pork banh mi was ok. \n\nWill be back to try other stuff, like the bao version and the pork belly.","useful":0,"funny":0,"cool":0}
{"review_id":"iYlepMJ6j4whB8gxiZm6mw","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"AIUFSIIdCEi3XoRJaxtDLQ","stars":4,"date":"2016-04-12","text":"Love the selection of winter gear here for my little one!\n\nWe are a big fan of the Canadan Pooch line and they carry a variety of jackets and sweaters here. And it's not just for big dogs - they have different sizes to fit all different size dogs.\n\nGood selection of treats and food as well!","useful":0,"funny":0,"cool":0}
{"review_id":"reeZj98t_X1DrZgQgFs9Kg","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"4_GIJk0tX3k0x0FcUv4sNA","stars":4,"date":"2010-07-26","text":"Hidden on the east end of the Danforth is a lovely Thai restaurant. Found this restaurant while surfing on Yelp.\n\nSurprisingly this place is pretty big to seat a big group of 12 and still have a few more small tables available. They are mainly a take-out restaurant, as many of the customers came in for take-out, and the service was a little bit slow. However, the food was great and it accommodating for many different people - seafood lovers, vegans, etc.\n\nDefinitely recommend the basil fried rice and the fried sole fish with eggplant but for those curry lovers out there, stay away from the roti curry chicken - no curry taste, just coconut favour. But the Roti itself was really good.\n\nMost of the dishes were under $10 - definitely a good deal!\n\nWill be back to try the noodle dishes!","useful":4,"funny":0,"cool":0}
{"review_id":"z9e32TaBomM5uY7fHYqYKg","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"I8rveLd-dl81u6c8YqAxmw","stars":1,"date":"2012-05-11","text":"If you have not yet tried Wasabi - don't bother.\n\nIt's expensive and the food is disgusting. You have to order the sushi at the table, but everything else (i.e. salads, soups, cooked food) you can get up and go get it yourself.\n\nThe food is very bland, the sushi does not taste like anything - not even sure if the fish is fresh.\n\nOn the weekends, everyone seems to be there for the snow crab legs - if that's what you are coming for, forget it! You have to fight\/wait in-line to get it. It's probably easier to eat it at Mandarin.\n\nIf anyone suggests to go there, I highly recommend you go somewhere else!","useful":3,"funny":0,"cool":0}
{"review_id":"rQgIiq1FJR8NwBJuWlUn7Q","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"a9aW5e731lplWGHUZ02-zQ","stars":4,"date":"2013-02-09","text":"Decided to try this place after reading the reviews. Was not disappointed. Huge portions and a bit of a long wait. They will take phone orders over the walk ins. So call ahead to order!\n\nTried the burrito with rice but will be back to try the noodle version!!","useful":0,"funny":0,"cool":0}
{"review_id":"7GsVl-wMaSfG1VoEK6-s6g","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"3E5umUqaU5OZAV3jNLW3kQ","stars":4,"date":"2017-11-02","text":"Great place to bring dogs! It's really a dog place that you bring your humans :p\n\nAs soon as we walked in, my dog was greeted with treats! He was so excited to explore the store...\n\nThere are 4 seats that you can sit and have your coffee while your dog lounges in the dog bed in front of you. \n\nTruth - this really a store for dogs, not so much for humans even though they offer coffee and tea - but just a handful of choices, nothing crazy :) \n\nThe great part is my dog is very picky when it comes to his treats and he really likes the one we had purchased here. Guess we will be back for more...","useful":0,"funny":0,"cool":0}
{"review_id":"zEDdYhDYYfvd8bSQqpc_ww","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"0-yj2jtzLUHG2b7PpEHyog","stars":4,"date":"2010-01-15","text":"Hidden in the east end of the Danforth, who knew there would be a little Ethiopian community?\n\nThe decor is definitely interesting. Although, the outside has lots of lights as decoration, the inside is kind of dark. The red lighting and orange menu makes it hard to read.\n\nThe food is not bad. Although they tell you that the vegetarian platter is only for one person - this platter is definitely made for sharing!","useful":1,"funny":0,"cool":1}
{"review_id":"b1Volwlw8gt_IGh9PhRQmw","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"N-11FCEppz5NVYZVM2G5yA","stars":5,"date":"2016-02-08","text":"This review is mainly for the pool only.\n\nLove that it has a nice indoor salt water pool for the doggies to use. It is small, and only meant for 1 dog at a time. I have a small little one that makes this size work well for him, but not sure how the bigger dogs can really swim in here.\n\nThe pool is great as the water is lukewarm so my little guy is willing to go in (as we have been to another indoor pool which the water is cold).\n\nFor the 1st time users, they have an instructor there to help assess what your dog can do or not do, that way you don't scared them off from swimming.\n\nAfter that, you are free to book time for just you and your pup.\n\nAnd they have a tub outside of the pool to bath them when they are done.\n\nOverall, no complaints with them!","useful":0,"funny":0,"cool":0}
{"review_id":"iFL5Iw972vd09fg87ElP9A","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"2QCZyAOB6xXKCdyFPvXXmw","stars":4,"date":"2013-09-01","text":"It's 3.5 stars but since I can't give half stars I will give it four.\n\nCute shop love the concept!\n\nLots of varieties of cookie but pretty pricy! There are probably about 10 varieties cookies and about seven milk flavours. The banana flavoured milk reminds us of the banana cough syrup we used to drink as a kid!\n\nThey do have homemade cookie ice cream sandwiches but the cookie is on the thinner side.","useful":0,"funny":0,"cool":0}
{"review_id":"pREKh8GSMq5UY9CqsnlQUQ","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"Tn8O4tv1U-n0PRC8kbJJPg","stars":4,"date":"2016-04-06","text":"Great place in Chinatown to get banh mi! Just make sure you know what you want as it is really crazy in there and hectic! The ladies behind the counter will harass you until you move along!\n\nLots of great prepacked food as well, if the sandwich isn't your thing!","useful":0,"funny":0,"cool":0}
{"review_id":"DcON7DHHHsvl8fByRl41MQ","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"vyeQzjZFx6KoL2pJBQ2QFA","stars":4,"date":"2011-02-16","text":"Very busy place here on a Friday night. Definitely has a queen street feel with the decor. \n\nFood is a little pricey but not bad. Shrimp tempura appetizer is a good size for sharing. Sweet potato wedges are well paired with the wasabi mayo. \n\nRolls are very good. They have a different pink dragon roll that has scallops on the top. Green dragon rolls are definitely a must try. The avocado is very thinly sliced sprinkled with something yummy on top.","useful":0,"funny":0,"cool":1}
{"review_id":"sny_ekbd4i_1EBx1gwayXw","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"D2PmpZYRdRnzL7q4Wprf3Q","stars":4,"date":"2014-09-11","text":"cute place on a side street - really only serving the locals around the Woodbine\/Danforth area.\n\nbf ordered a coffee here that he thought was pretty good. they seem to have smoothies and fresh juices as well. and nifty rice bowls. \n\nwill be back to try out the juices and food.\n\nseems to be a quiet place to chill for a couple of hours.","useful":0,"funny":0,"cool":0}
{"review_id":"Tv-_7d1sa-6cPTZ20exTLA","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"7Uti5EeAwm3drG14KVrE3Q","stars":2,"date":"2010-03-31","text":"Atmosphere for this restaurant is nice but service, not so much. \n\nCame here for a friend's birthday. Although, we made reservations and checked in a few minutes early, we still had to wait a good 45 minutes before sitting down at our table. When we made the reservations, we were informed we would have to leave a certain time - which we didn't think they would enforce, considering we did not get our table in time. However, they did, and we were not impressed.\n\nThe space in the restaurant is also very tight, my boyfriend got hit in the head a few times while sitting at the table.\n\nI had ordered a seafood pasta dish, which was kind of bland (not much flavour). My boyfriend had ordered one of the specials of the night - filet mignon, which also was not up to par.\n\nOverall, I've had better pasta. I'm not sure if it was just the two dishes I had that wasn't up to par, as my other friends did enjoy theirs.","useful":8,"funny":0,"cool":0}
{"review_id":"uwp2sAXf5shT1ynRWo7sHg","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"BmSLyxm8b86dtzwuT7LqBA","stars":4,"date":"2014-03-03","text":"The loud banging always draws crowds as you walk by and see that the chef is making fresh noodles. Noodles are delicious and you definitely need to make sure you save room in your stomach for this when you come to pacific mall!\n\nAfter trying a few things on the menu - the true favourite is still the dan dan noodles. There is something about the spicy peanut sauce soup base that makes it so flavourful. Plus when you add their homemade chili oil - it makes it so good.\n\nBecause of Sun's dan dan noodles - my bf and I will always order the dan fan noodle whenever we see it on the menu but so far, no one has the same flavour as Sun's. Sun's    is the best we have had!!!","useful":1,"funny":0,"cool":1}
{"review_id":"gDBVb6Qdg5VAr2L95NEeFw","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"KpFc2FXm7OXLhoKgKDNz2g","stars":4,"date":"2013-05-01","text":"found this bakery while wandering on Queen Street - it was hidden on a side street.\n\nwalked inside to check it out and it was very quaint inside. Lots of variety. We had gotten a loaf of Brioche bread - it was so good. Soft and sweet - just the way it should be.\n\nthey have lots of other bread that I can't wait to go back and try!","useful":0,"funny":0,"cool":0}
{"review_id":"Ebggx4Zlc4VWReJMG1nT6w","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"l1_S1mfGbEMxfT1f9omhEA","stars":1,"date":"2017-10-16","text":"Terrible service and not so great drinks.\n\nWe happen to be in the plaza and saw this place for bubble tea, so we decided to grab a few to go.\n\nFirst of all, the two menus is located in a very awkward place (one very high up on the wall and one in the corner also by the wall), set up is not really friendly neither can it accommodate a large group of people to look at the menu at the same time.\n\nThe menu items itself had different options than your typically bubble tea place. Their specialty are mousse drinks - which we had no idea what exactly it was. So when we asked the staff, they said it was some sort of cheese. \n\nFor a Sunday afternoon, they were also out of grass jelly and pudding, which are ingredients in quite a few of their drinks (so not sure how that works).\n\nThe service is really bad, they don't understand English so when you asked them about the menu items, they can't really explain what they are.\n\nWe had ordered the following:\n- slush mango (came with tapioca and mousse)\n- peach ice tea\n- roasted oolong milk tea\n- supernova kumquat lemonade\n\nAnd when we asked what the difference between a supernova kumquat lemonade under the galaxy drinks section (which are supposed to be layered drinks), and the kumquat lemonade, they said it had a layer of blue mousse - so we were like ok we will try it then. But what came was just a bigger cup size of the kumquat lemonade. When we asked them again, they said it was just a size difference, that's what makes it supernova - which is pretty dumb to me as on the menu both items had the same two size choices of regular or large. \n\nThe mango slush and the roasted oolong milk tea wasn't bad. But the other two was not that great. The tea had a big floral taste that overpowered everything. There was no peach taste in the peach ice tea. The kumquat one had no kumquat taste and was just bitter from the lime and it tasted like it had no sugar in it at all.\n\nI guess if you need a non-busy place to use WIFI and work, then this is the place, no one wants to come here.\n\nAlso - their gimmick also seems to be the lightbulb drinks, which were intriguing to us, but you are not allowed to take the lightbulb home...\n\nWe will definitely not be returning...","useful":0,"funny":0,"cool":0}
{"review_id":"Q0j8DFqW_zWNa-H1QuuPgg","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"TrOgTZ0DfmQxvpTehiNibQ","stars":1,"date":"2011-05-10","text":"worse customer service ever. \nManager on duty was rude. She didn't care that I had negative feelings about this place when I said that I would never come back again!\nRestaurant has gone downhill since they renovated!!","useful":11,"funny":5,"cool":5}
{"review_id":"EKAN4jw3LsE3631feSaA_g","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"pZ1quwXnYozLIZIVABojhw","stars":4,"date":"2012-09-23","text":"My boyfriend took me here for my birthday. At first, I wasn't impress that it was a 45 mins wait, however my BF really wanted to try this piece, so we decided to wait.\n\nIt was definitely different and worth the wait. \n\nWe started off with the House Cured Meat - it was good - but definitely too much for just 2 people to share (and no need to order the extra bread if it's only two people).\n\nNext came the roasted bone marrow - which is amazing and definitely worth ordering. Had we not ordered so many other dishes, we would have ordered a second round of this. Who knew bone marrow could be this tasty!!\n\nThen came the Spicy Horse Tartare, which we thought was intriguing, as we have never heard, so we had ordered it. When it showed up, it was like a salad. Wasn't bad, worth trying but probably only a one-time thing for us.\n\nTongue on Brioche is definitely another worth ordering. it is a sandwich that tasted like a Montreal smoked meat sandwich. SO GOOD that it melts in your mouth - so soft and tender. If it wasn't because we had ordered so much food and this was the last main course that showed up, we would have devoured it.\n\nFor dessert, we had ordered the Foie and Nutella, as we thought this was very interesting. It was good, but after 4 dishes already, this was just a little too rich. It came with banana bread that was really good.\n\nOverall, definitely worth the try! Just make sure you bring cash =)","useful":0,"funny":0,"cool":0}
{"review_id":"51TLGhFncBnppaBN5vHlcw","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"Uq-GOs9_IqweUsB5MdII9w","stars":4,"date":"2014-08-21","text":"OMG - came here with some friends for Brunch and wow!\n\nWe did have to wait for about 30 mins for a table for 4 (but it was later in the day). \n\nLooking at their menu,  we wanted to try everything! the French toast, the strawberry shortcakes..donuts (they were sold out by the time we got there).\n\nbut we wind up only ordering two things: \n\nthe classic - 2 eggs any style, house cured bacon or sage and onion sausage, crispy griddled red skin potatoes with sea salt and thyme. Served with toast of your choice. Upgrade your toast to a buttermilk biscuit \n\nEmma's Benny - Warm and fluffy buttermilk biscuit topped with house cured peameal bacon, poached eggs and smothered in mousselline sauce. Served with a side of griddled red skin potatoes.\n\nbig portions - really good!\n\nif you want the benny, make sure you asked them if they still have it as they tend to sell out quick - I had ordered the last one of the day!!!","useful":0,"funny":0,"cool":0}
{"review_id":"zo84NPvoDgm1W9poSCjPQQ","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"3vs6rARRBm-O99y4bryilw","stars":4,"date":"2012-08-20","text":"Great Japanese restaurant in the Bloor and Church area. Been coming here since the first opened years ago.\n\nFood has always been good and fresh. However, if you are here for lunch, it will take an hour and make sure you come a few minutes earlier otherwise it may be a long wait as it is small inside!","useful":2,"funny":0,"cool":0}
{"review_id":"0wsN8ZT101c8LhqwQZJjvw","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"kRdzgq-hr3amtTkQR-U7dw","stars":4,"date":"2013-05-01","text":"they have some pretty interesting things here!\n\ndefinitely a one-stop shop for cheese and bread =p\n\nalso carry a variety of pates that are pretty tasty!","useful":0,"funny":0,"cool":0}
{"review_id":"O4RZMP8IFyJTNfRp0QXEsw","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"vcxvQyAggPqxcHwvJXvjGg","stars":4,"date":"2017-01-04","text":"Love this place!\n\nThe cakes are delicious but really rich! They have cute cupcakes and lots of macaroons. \n\nThe best part - they now have a gluten free chocolate cake - which hubby and I think is better than the regular cake!","useful":0,"funny":0,"cool":0}
{"review_id":"66KqTwiQ1oB9-aTsoEN35Q","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"DKiRDPtQ5cTN-eX1oEgA9w","stars":3,"date":"2017-01-04","text":"It's a pub... nice and clean one.\n\nCame here to grab some food with the girls since the Thai place below was an hour wait. We stuck with the normal pub food: burgers, fries and grilled cheese sandwich.\n\nThe burger presentation was great - it comes with fries and some onion rings piled on top. It was a decent burger.\n\nGirlfriend got the grilled cheese sandwich with bacon - which she said was good.\n\nWhen looking at the menu - there are so many options to choose from... especially with the pictures they include. The only thing is the pictures always look better then the real thing. The Sheppard's pie looked so yummy but when we saw another table get it, it didn't look so appealing.","useful":0,"funny":0,"cool":0}
{"review_id":"jREsaout3cuhKbROVDXUFg","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"I44P6Pfoey2pArOhhx2RnA","stars":4,"date":"2017-10-17","text":"Cute little hole in the wall place. Two entrances, one by a side street by an apartment building and the other side of the entrance in the mall.\n\nThey had lunch specials that are applicable on the weekend, so we ordered:\n- chirashi\n- salmon teriyaki\n- kalbi\n- chicken katsu\n- dynamic \/ california roll\n\nAll was very good and very fresh! \n\nDefinitely recommend it and will be coming back!","useful":0,"funny":0,"cool":0}
{"review_id":"3KQ3_xutS5R3mX7HsPWpgw","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"zkU-WMio8g6dpRJ2Y2xqvQ","stars":4,"date":"2017-01-04","text":"Came here for dim sum - it's one of those mark on a sheet to order.\n\nThe dim sum here is pretty decent and tasty. It can get a bit pricey, but other reviews say if you come early (before 10:45am) you can get all sizes for the same price. \n\nDefinitely order from the dessert section - they have some pretty unique and tasty options.","useful":0,"funny":0,"cool":0}
{"review_id":"Ny3gmyxodfnp4JK0Geaovg","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"P-nqq5kOv2wV2mB5To5elQ","stars":2,"date":"2010-09-15","text":"Opened by Pickle Barrel, Glow is meant to be this new healthy eating restaurant that ensures you do not over indulge on certain foods. They have burgers that are served bunless and a side of salad - so make sure you read the fine print prior to order to ensure you get what you want.\n\nThe food is ok, not memorable. The atmosphere and decor is beautiful. And the service was not bad - after hearing all the horror stories I thought we would be getting terrible service.\n\nThey also have these 100 calories shooter glass desserts that are cute, but also not memorable in taste.\n\nI think this place is probably good for a drink (for the atmosphere and decor), but not so much for their food.","useful":1,"funny":0,"cool":0}
{"review_id":"cafDR6sZnIO02tf03ZXRZw","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"FQr_scgz9a4sXTdRS4d3mg","stars":3,"date":"2015-06-15","text":"Nice place by Cumberland place. After we had sat down, we were given two HUGE blown up pitas. So we had ordered the eggplant dip to go with it. It had a nice smoked flavour to it but not even garlic taste for my liking so it was just a-ok.\n\nOrdered a chicken shawarma and a mango strawberry juice. The juice was yummy and would definitely order it again! The shawarma - I'm not sure about it. The meat wasn't as tasty as I thought it would be. Maybe I need to try the falafel instead next time.","useful":0,"funny":0,"cool":1}
{"review_id":"p659sFGjbL8chCRZPPyFmg","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"3RlylOY452bA8rwliPUeUQ","stars":4,"date":"2017-01-04","text":"My sister loves this place! Probably comes by once a week, once every two weeks!\n\nThe hot pot for two is a great deal! Lots of food that can probably feed 3 (assuming you aren't  huge eaters - just regular eaters).\n\nWhen it's not hot pot time, my sister says they have really good Hot Stone Bibimbap - which is what she typically gets.","useful":1,"funny":0,"cool":0}
{"review_id":"6HHuaN9i-MEYRz4sPRcZEw","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"SCklYa_jhihWAcfIn-_chg","stars":4,"date":"2010-03-31","text":"Long line ups for Sunday brunch - but so worth it!\n\nThe baked French Toast is amazing!! Very big portion though!\n\nThe butter tart was definitely the best butter tart I've ever had.\n\nNote: it is a very small cafe, not good for large groups.","useful":0,"funny":0,"cool":0}
{"review_id":"fBjzlwPU4HM9MOxG8NzVLQ","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"lRwpFFaFr3QQ5fGHkk3eXQ","stars":4,"date":"2010-03-31","text":"Stumbled upon this one day - thought I would give it a try.\n\nTypical sushi place - sushi was pretty good. Price is decent.\n\nParty trays are decent. =)","useful":1,"funny":0,"cool":0}
{"review_id":"EY1mL968hGQt5xWgILX7gw","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"AF_VU15nNsqIg7-y9uiQug","stars":2,"date":"2011-01-06","text":"Went with my friend as we had purchased the Groupon back in April. Before the Groupon, reviews were pretty good for this place. But not sure if it is because of the amount of Groupons they sold, their service and attitude has gone downhill.\n\nWe were a little late for our appt, but we had called ahead to notify them (only to get the answering machine). When we got there, the receptionist was rude and said, typically we don't take appts that are this late, as we are booked back to back, but this time we will take you in. And when we looked around the salon, there was only 2 other people getting their nails done.\n\nThe two girls that did our nails were really nice. My friend kept smudging her almost dried nails, so they had fixed it for her twice.\n\nAt the end of the day, we had to pay the $1.25 HST on top of the tips.\n\nOverall, we would not go back again.","useful":1,"funny":0,"cool":1}
{"review_id":"hnMUfLEic872azsTt7ghmw","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"IBZ6e3P0OqcPXVjvGlpueQ","stars":4,"date":"2012-09-23","text":"Fish is good, really good. Love how you could have so many different options for fish choices. Chips is only ok. Onion rings are not the same as the regular onions, a little too crispy.\n\nI had ordered the house organic batter mahi mahi - very light, not really heavy. Creamy coleslaw is flavourless. Shared the O.T.H Poutine which was ok but not for me. Will go back to try the pull pork or duck confit one. \n\nGood for gluten free. =)","useful":0,"funny":0,"cool":0}
{"review_id":"ckUKRR2BV7wg9ehIRiZ6aw","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"806kkDGaRCJ4lZLRcEf-iw","stars":1,"date":"2011-09-28","text":"after reading the reviews on yelp, my boyfriend and i decided to give this place a try, especially since we are on a mission to try ramen in every city we visit.\n\nwe were really excited, as when we were in NYC, we had really good ramen. \n\nlistening to the reviews we started off with the gyoza appetizer - which was not as good as everyone says it is. It was pan fried with the thin layer of skin, but there was an aftertaste of soap water. Which I should have known, since the glass of water they served us was disgusting!\n\nWe had ordered the jumbo sumo ramen - beware, it is a very big bowl of noodles, which we did not expect.\n\nThe sumo ramen came with a half boil egg, seaweed, pork belly, and other veggies. The noodles and pork belly was good. Soup was tasteless.\n\nDefinitely would not go back again.","useful":1,"funny":0,"cool":0}
{"review_id":"8KwvvDYbvwDM5WxAOhHBRA","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"S5bNE4Pmin8OQUMOFod8bQ","stars":1,"date":"2010-11-23","text":"Came here for a friend's birthday. She had looked it up and thought it sound good. First of all, when we made reservations, they only had a 7pm time slot for us (we were looking for 8pm) and when we were there, we were seated in the lower area of the restaurant, which was pretty empty.\n\nThere was an extensive menu, everything on the menu sound good, but when we got our food - there was nothing special, especially for what we paid for it. \n\nThe pizza's are huge portions - so if you order it, make sure you share it.\n\nThere are 3 risottos on the menu, the seasonal vegetable one is the better one. Some of the pastas were portioned differently, some were huge, others were tiny - so be careful!\n\nThe food came out really fast after we ordered, so fast, that some of the food was cold (not sure if they make it in advance and just heat up afterwards). The desserts took forever to come.\n\nAt the end of the night when the bill came, there was a water service charge ($12.50) for 9 people for just getting tap water. And 18% gratuity after taxes.\n\nAtmosphere was good, but other than that I do not recommend this place at all.","useful":5,"funny":0,"cool":2}
{"review_id":"UmJM6J7KJT0KhGvOZ4n3IQ","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"xpJEBXTCQh5Ib8BJrjt9Bg","stars":3,"date":"2016-02-08","text":"Came here after dinner to meet up with some friends...it was nice and roomy for 7 people. \n\nWe ordered a plate of Rosemary fries to share, which wasn't bad, however when served it was room temperature and did not taste like it just came out of the fryer.\n\nBF had ordered a couple of beers, which he was not impressed at all with.","useful":0,"funny":0,"cool":0}
{"review_id":"-Km-gkgaAJAx37yEHIERDg","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"yuFdJdrnfMp3cfXVwTXjjA","stars":3,"date":"2016-02-08","text":"Wanted to give this place a try since it was in my neighbourhood and I wouldn't have to go far. Came here for a late lunch on a Friday - there was a few tables, but nothing crazy.\n\nWe had ordered:\n\n- Spicy Miso Ramen\n- Salt Broth Ramen\n\nThey were ok - can't say there were great and can't say it was terrible. The noodles had a nice texture to it, a bit chewy and not too soft. But the broth was a bit bland - definitely lacking some depth to it like another reviewer had said.\n\nLooking at the menu, they definitely did have quite a few ramen options - perhaps too many options and they should try to narrow it down to make them better.\n\nPerhaps next time we should try the other menu items and not the ramen.","useful":0,"funny":0,"cool":0}
{"review_id":"yWUdKhjq8QqZe6vai8W69w","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"rdn0vLw8Ln5_PBwRcE6BZw","stars":2,"date":"2012-10-18","text":"Decided to give this place a try based on the reviews. \n\nService is really slow on a Thursday afternoon work day. It took almost 30 mins before we got our food. Definitely not the place to go during the work week.\n\nOrdered a pork bone soup which was just ok. Nothing special or memorable about it.\n\nNot sure if I would come back again.","useful":1,"funny":0,"cool":0}
{"review_id":"cKeZ1e-HRBodUpnz1j8BJA","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"dw2ST-AHUbu2xq0QNfngBA","stars":5,"date":"2010-09-15","text":"This place is really good! The best restaurant in the area! The food there is really tasty - especially the Ahi Tuna Club sandwich, Lobster Ravioli and the tandoori chicken flat bread.\n\nThey also have mock chicken for those who are vegetarians.\n\nGorgeous patio for the summer time.","useful":3,"funny":1,"cool":1}
{"review_id":"mIUjvArg1mXlEZTKbqF0zg","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"4zrplmbNlzIsxYs-iDTbLQ","stars":4,"date":"2016-04-06","text":"Decided to give this place a try since I was in the neighbourhood! Love that there was no line up at all. However, coming here at 5pm on Saturday afternoon and only original flavour was left!\n\nThey have three flavours to choose from: Original, Chocolate and Coffee.\n\nMy nephews loved it and thought it was better than Uncle Tetsu (which I have not yet tried).","useful":0,"funny":0,"cool":0}
{"review_id":"zbU2q635UH8tk2Cboo7Xlw","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"ik9VvawL-BeAqlxTI1leew","stars":4,"date":"2010-07-26","text":"Small little Japanese restaurant in the Don Mills neighbourhood. Lots of different rolls to pick from. \n\nGreat lunch special selection.\n\nService is a little slow though. So if you only have 1 hour for lunch, may not be the best place. Take out is pretty quick though.","useful":0,"funny":0,"cool":0}
{"review_id":"Y8vA-J6yGkr5-nE95tbjGA","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"1jNteKQ2JuF6Sk1SI9X23Q","stars":3,"date":"2012-09-23","text":"Chinese version of Cheesecake factory. \n\nCame here with a friend on a Thursday night at 7:30pm and was told it was a 45 mins  wait. My friend had walked by at 6pm to try to make a reservation in person but they said they wouldn't take it.\n\nWe wind up sitting at the bar to bypass the wait, as they serve the full menu at the bar as well.\n\nNothing crazy different on the menu but the bartenders were really nice as we had sat there for over 2 hours.\n\nWe had ordered the crispy green beans which was really tasty. Ma Pao Tofu which was weird that it was crispy tofu served on top of a bed of broccoli. Vegetarian fried rice, ok but also served with a lot of broccoli.\n\nWill be back to try some of their noodle dishes.","useful":0,"funny":0,"cool":0}
{"review_id":"S5BSUs-iDrwn6o5968LmEg","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"xNNAfZJkLZlAeS-I7-QwgA","stars":3,"date":"2017-10-16","text":"We were here on a holiday Monday where nothing much was open. We had to grab some takeout as we were in a rush and this was the only place open.\n\nWe ordered:\n- beef noodle soup\n- grilled pork chop rice\n- grilled port vermicelli \n\nThe food was ok, nothing exciting and kind of bland.","useful":0,"funny":0,"cool":0}
{"review_id":"JCna3sfrjqtnsG7l-pSs-A","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"uATqc1QJkS5lOKfoJ6Uz2w","stars":3,"date":"2013-02-18","text":"Read about this bakery on BlogTO so decided to check it out since it was so close.\n\nCute little place in the mid of Chinatown.\n\nSmelt amazing when we walked in. Walked out with the following:\n- carrot cake\n- ginger spice cookie\n- spicy chocolate cookie\n- gluten free peanut butter cookie\n\nThe mini 5 inch cake was a good size not overly priced at $7. Was a bit on the sweet side but wasn't terrible. Just make sure you have it with tea or coffee (with no sugar).\n\nThe cookies were $1.75 a piece, average for the size of the cookie. However they are the crunchy kind of cookies so if you are looking for a soft chewy cookie, you should skip it.\n\nOverall not bad, will be back to try other stuff! Can't wait until she adds more gluten free items on the menu!","useful":2,"funny":0,"cool":1}
{"review_id":"SlXVmKGv10icLuSrqeuqgQ","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"qR62k9TVEVwRuQH6-4avHA","stars":4,"date":"2011-09-28","text":"very cozy, in the heart of St. Catherine street.\n\nvery comfy bed. wireless internet works very well.","useful":1,"funny":0,"cool":0}
{"review_id":"1XEm85LhDeiUHdG0R_rXSQ","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"sTV4qyjDkY5cLvx2omtLyw","stars":4,"date":"2017-02-07","text":"Nice addition to the Distillery district! Stumbled upon this place when we were out checking the lights festival. Nice place for you to hang out and get a coffee, tea or hot chocolate. They have a few flavours for hot chocolate - best part, you can get it in a dairy free option!\n\nI had tried the peppermint hot chocolate with soy milk and it was nice and minty!\n\nIn looking at the menu, you could also grab a bite to eat or walk in their store to look at the different condiments they sell!","useful":1,"funny":0,"cool":0}
{"review_id":"kZPaUjcmUin_G8NvV8Pk9g","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"X29BLACjBhOg_P2USv07dA","stars":1,"date":"2014-08-08","text":"after reading reviews on this place, thought I would take my family here to give it a try.\n\nbut after driving in circles a few times, we realized that this place had closed down - couldn't find it at all!","useful":0,"funny":0,"cool":0}
{"review_id":"WkIJj-pH7JoyxHmh2_JRcQ","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"FjTihEfjgq9dm3IJ7S888Q","stars":4,"date":"2016-06-07","text":"Cute place in Danforth and Coxwell area!\n\nIt has a nice patio to sit, which is also dog friendly! \n\nWe had tried the wild boar pizza - which was very good! Definitely want to try the other items on the menu!\n\nFriendly service. Definitely will be back here more often since it is so close to us!","useful":0,"funny":0,"cool":1}
{"review_id":"1oPgWJHJiKZShjdJxZHylA","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"JnKzrXKxY1cThJ0vNk-4pA","stars":2,"date":"2012-05-11","text":"You can see that people only eat here to use the vouchers they have purchased - as they seem to always have some sort of deal available.\n\nunless you come early enough - make sure you make reservations, otherwise it will take up to 30 mins to get seated (for a table of 2).\n\nThe food is ok. Not the greatest I've had, but definitely not the worst. For the price you are paying ($15 for $30 worth of food) - it's ok.\n\nDefinitely only visit if you had purchased a voucher.","useful":3,"funny":2,"cool":1}
{"review_id":"8aIpsx2-l__KLKo7Ljs8pQ","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"An-JJle53UMHokU4MwFktg","stars":3,"date":"2017-01-26","text":"my sister is a big fan of the noodles here as they do have some soup options with no MSG. \n\nthe way the system works is that it is a combo:\n\n- soup base option (no MSG fish soup or Chicken soup base)\n- two toppings are included with additional toppings at $1.75 each\n- types of noodles\n- 1 hot drink is included but other options have an additional charge\n\nThen you also have an option of adding side items.\n\nI had ordered the parsley and century egg fish soup with fish filet, fish tofu, cabbage and flat rice noodles. Not sure if it is due to the type of noodles i had picked but i found it a little lacky in flavour.\n\nOtherwise, it wasn't bad, pretty big portions. I would also upgrade to a cold drink next time since the hot lemon tea that i had gotten wasn't really that great.","useful":0,"funny":0,"cool":0}
{"review_id":"KUpwkKb7sue22o__HLilow","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"ZilzayEdyk70SoI-wruJbg","stars":4,"date":"2017-01-04","text":"This is a most stop for me and my girlfriend whenever I'm back in TO. We always order:\n\n- the radish cake \n- calamari \n\nboth are really good - but it is a bit spicy.\n\nAnd typically we will order a congee (you really can't go wrong with any of them) and a noodle dish.\n\nWhat can I say? Congee and noodles is always good.","useful":0,"funny":0,"cool":0}
{"review_id":"p9q6dgpCH05Avd4CKmumEA","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"n44grut83X0UiRZCA-O1fw","stars":3,"date":"2017-01-25","text":"Saw that this was in my neighbourhood so decided to give it a try!\n\nI had purchased a regular croissant and an almond croissant.\n\nThe croissants were very flaky however I can't say I was too pleased with the regular croissant as it had a burnt taste to it (which I really don't care for).\n\nThe almond croissant was really good, I would go back for that one. They had a beautiful display of sweets which I would like to go back to try.","useful":0,"funny":0,"cool":0}
{"review_id":"FJ9jp3rPcCS4tkZvoT5dvQ","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"0H8PL4trSvZFYgPpvSOCjQ","stars":3,"date":"2012-12-18","text":"Read an article online about this being the best gluten-free shop in Toronto. Not sure if I agree. They definitely have some interesting items like vegan, gluten free breads that I haven't really seen anywhere else. The store is much smaller than I thought it would be (based on what their website says). When I read their description of prepared foods and items in-store I was really excited about the variety. But once I found the store (which is hidden if you don't pay attention), I was disappointed. \n\nA lot of the other items they carry on the shelf can be found in various stores around Toronto at a way cheaper price too.\n\nIf you are in the neighbourhood, do go in and browse. Otherwise not really worth the drive up there.","useful":4,"funny":0,"cool":0}
{"review_id":"-Vu9tjKD7HnsaJ-yJ53ERw","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"oqJe5o_4J0xkhvTSTP9UNQ","stars":4,"date":"2016-04-12","text":"Really 3.5 stars...\n\nWasn't bad sushi. Decent but definitely a bit on the pricier side. The rolls are slightly smaller. Shared two rolls with the hubby and felt like I wanted more and usually we feel full after 2 rolls. \n\nWe had tried:\n\n- Sushi Couture Maki (*Signature roll): salmon, scallop, tobiko - it typically has spicy mayo, but we asked for no mayo since the other roll had it\n- Princess Maki: Spicy Tuna wrapped with Avocado, BBQ Eel, Tuna, and Salmon\n\nBoth rolls were delicious, just wish it was slightly bigger!","useful":0,"funny":0,"cool":0}
{"review_id":"u6VLigczpFn3fABwCgpR4g","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"ByLGceeU4oxmwUDxexYrQw","stars":1,"date":"2012-05-10","text":"Tried to book an appointment to use the voucher my friend had given me. it was for a mani\/pedi\/foot massage. Left a message, but never heard back.\n\nFinally decided to email them, requesting for an appointment. The response I got back was they are under new ownership and is no longer accepting the vouchers.\n\nSuch a disappointment!","useful":9,"funny":0,"cool":0}
{"review_id":"7jBHwFoSYS17myOGbKJH-A","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"9g4jaW7IzcuwXg86eJbynw","stars":4,"date":"2011-09-28","text":"hand made noodles. fast. great service. open kitchen. Need i to say more?\n\nThere was a line up when we got there, but it moves pretty fast (approximately 10 mins wait). As soon as the server sees you there waiting, he offers you a glass of water.\n\nStaff is extremely friendly and nice. Service is really fast. Even faster when you speak chinese to them.\n\nMy boyfriend and I had ordered the soup dumplings, sweet and sour veggie pork noodle and a beef noodle. The soup dumplings were good, as they are made on the spot. The veggie pork handmade noodle was really good. The beef noodle, not so much.\n\nThey are definitely known more for their handmade noodles. \n\nWill be returning the next time I'm in town to try the spicy noodle and shanghai noodle everyone is raving about!","useful":0,"funny":0,"cool":0}
{"review_id":"IkZgPqgwKSuQFAf4s0Z21g","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"yaViddk9vxi-7p8DnjoClw","stars":4,"date":"2010-07-16","text":"Good, cheap sushi.\n\nThe party trays in particular are a good deal!","useful":0,"funny":0,"cool":0}
{"review_id":"NVs7mYKjNr-GfH-uHtZ23g","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"kKNauD7d3HOvumRV7JIAfg","stars":4,"date":"2016-04-01","text":"Saw that there was a new place in the neighborhood and decided to try it out. They did not disappoint!\n\nHad ordered the buttermilk fried chicken sandwich and a classic poutine to go.\n\nThe buttermilk fried chicken sandwich was excellent! It was very light and was not greasy at all! Will definitely be back to try the other items on the menu.\n\nAs for the poutine... It was soggy and nothing special. Will be back to try the onion rings.","useful":1,"funny":0,"cool":0}
{"review_id":"yUTiGBWhDaXUN0FRlQ9VUg","user_id":"u0LXt3Uea_GidxRW1xcsfg","business_id":"TR0-w6VoZDAdvFQiq7P2Ug","stars":4,"date":"2016-04-06","text":"nice and light tasting cakes! Tried an original and matcha green tea slices.\n\nsimilar to Lady M cakes! \n\nWill be back to check on the ice cream!","useful":0,"funny":0,"cool":0}
{"review_id":"hkyyWaX-EMiIkvyu1zOBlA","user_id":"nsOf58RZjMTn8V94EQYJog","business_id":"djyIZW8gVNWby8wauISkqg","stars":5,"date":"2017-08-23","text":"Suzanne was able to get my business five T.V. segments in the first two weeks of hiring her.  Very honest, and professional.  Just a wonderful human being.  I really enjoyed working with her.  She is a fantastic communicator.  She is the best P.R. in the valley!","useful":0,"funny":0,"cool":0}
{"review_id":"JN0tmjiksWfr4i2NIFuPXw","user_id":"r9HwWzRRd0EvcwnDX9TLTg","business_id":"pLZ9oZM8c6MNbRlg06lBPg","stars":1,"date":"2016-08-03","text":"THEY SELL WRECKED VEHICLES! \nI purchased a 2010 Nissan Altima with 41,000 miles on it in 2013 from Planet Nissan. They charged me $18,000 and provided me with no warranty, except for manufacturer powertrain. Immediately after purchasing the vehicle I began having to make out of pocket repairs to the suspension, brakes and exhaust system every 6 to 9 months with absolutely no clue as to why after all the repairs the car still drove somewhat unsteady at high speeds. \n    Two years after I bought the car I was finally sick of the constant problems and decided to trade it in with another dealership, during the trade in process I found out that Planet Nissan had sold the vehicle to me knowing that it was involved in a \"major\" car accident which caused frame damage six months prior to them selling it to me.\nUnfortunately there's not much I can do now, but I would advise any savvy consumer to avoid this dealership by all means possible and go someplace that is a bit more reputable!","useful":0,"funny":0,"cool":0}
{"review_id":"KJZH2KCdX4PcsbY9k8wuyQ","user_id":"_L2SZSwf7A6YSrIHy_q4cw","business_id":"LxXgO4DTj78L5--V-8TGrA","stars":4,"date":"2009-09-01","text":"We got a permit to have wedding photos taken here.  \nThe garden itself was great: 5 stars all around.\n\nThe staff was horrible.  The person manning the place claimed there were no bathrooms, complained about where our group was standing (twice!), and then warned us that 'if you aren't out on time I will come in and find you, and I really don't want to do that.'  Its been a long time since I was treated so rudely.  \n\nGo to the garden, avoid the staff.","useful":4,"funny":0,"cool":0}
{"review_id":"JX-fBn2d8sAN-wwUSe9elA","user_id":"_L2SZSwf7A6YSrIHy_q4cw","business_id":"vtJKOOyg0NisrB45K33cdQ","stars":4,"date":"2009-09-01","text":"No problems at all with this place.  The staff was cheery, helpful and fun.  The room (we got one with a whirlpool) was clean and comfortable.  The building was nice.  \n\nNo complaints at all.","useful":0,"funny":0,"cool":0}
{"review_id":"DIqlihd_XYHbTa-rF1jbqQ","user_id":"_L2SZSwf7A6YSrIHy_q4cw","business_id":"yXvyFDIdJTM0kLGSe7VYAw","stars":4,"date":"2009-09-01","text":"We had Gaylord cater our wedding reception.  The staff was friendly and helpful, though they were especially good with setup and tear down.   The food was above average for a catering.  In particular their stuffed Portobello Mushroom was quite nice. We also got some relatively healthy and tasty potato and vegetable dishes.   They were also priced quite reasonably for what we got.\n\nA good experience all around with no major negatives.  I would consider Gaylord for catering again.","useful":3,"funny":0,"cool":0}
{"review_id":"bifEpGC-8TE19JPZwn-Rpw","user_id":"_L2SZSwf7A6YSrIHy_q4cw","business_id":"TIf6ZByLdAXratne18kjoA","stars":5,"date":"2009-09-01","text":"We had these guys cater our wedding.  We ended up having 6 different flavors of cake.  All were delicious, although the carrot cake was especially exceptional.  The staff was friendly and prepared. \n\nAll around a great experience.","useful":2,"funny":0,"cool":0}
{"review_id":"nsThIz_-TuvgoFh0o9XJfQ","user_id":"_L2SZSwf7A6YSrIHy_q4cw","business_id":"IXXERocY1bqGwRllcy8J2w","stars":5,"date":"2009-08-30","text":"Visiting from SF.  Checked yelp and found this place.  It is very small -- a converted house.  As you sit in it you can watch the kitchen.  The food was excellent.  We had an eggplant\/red pepper omelet and peach waffles.  The waffles were light and fluffy with fresh whipped creme.\n\nWe got pastries to go, which were also good, in particular the chocolate croissant was unique.\n\nGreat place for an informal breakfast.","useful":0,"funny":0,"cool":0}
{"review_id":"BF0ANB54sc_f-3_howQBCg","user_id":"ssuXFjkH4neiBgwv-oN4IA","business_id":"JlNeaOymdVbE6_bubqjohg","stars":1,"date":"2014-08-09","text":"We always go to the chevo's in chandler which is delicious, the one in ahwatukee is different for some reason.  Ordered the chicken rolled tacos today there was a tiny lil piece of chicken in each one, so basically I had 3 rolled deep fried tortillas yuck! :( No flavor what so ever.  Also ordered carne asada taco the meat tasted old like it was cooked earlier and just thrown on the grill to get warm.  Very dissapointed!!","useful":3,"funny":0,"cool":0}
{"review_id":"DbLUpPT61ykLTakknCF9CQ","user_id":"ssuXFjkH4neiBgwv-oN4IA","business_id":"0Rni7ocMC_Lg2UH0lDeKMQ","stars":1,"date":"2014-08-09","text":"This place is always so dirty and grimy, been there twice and will not be back.  Customer service is horrible!!!","useful":6,"funny":0,"cool":0}
{"review_id":"40sWchjx-4rQ273cb85T7A","user_id":"ssuXFjkH4neiBgwv-oN4IA","business_id":"3uBrRcIhbhed1xftLBvabw","stars":1,"date":"2015-08-23","text":"Horrible customer service!! Warning do not purchase anything from here, don't waste your time!!! Purchased $2,500 worth of furniture told sells person numerous times to deliver furniture in original boxes I didn't want it assembled.  Well received my delivery and everything was assembled!!!!! $700 table was damaged!!!! Living room furniture was stuffed in delivery truck with people's nasty old mattress....completely unprofessional and not worth it!!! Sent my whole order back for refund!! Called customer service talked with a guy named Chris, the absolute worst customer service agent I've ever spoken too.....Was missing the love seat, well guess what it's completely sold out.  Please spare your time and money! Don't waste it here, furniture might be good price but not worth the experience. I must save delivery guys were very nice.","useful":5,"funny":0,"cool":0}
{"review_id":"UXmBQNWMD1PBLDC_nbTsSw","user_id":"xJbxpra6iyCsph35Pt0cZg","business_id":"0g7Pr8OWl_t_7DUeYJrrGw","stars":1,"date":"2014-02-03","text":"I bought a groupon voucher for Double Wings Art.  When I tried to use it, they did not recognize it and told me to go back to Groupon.  This is not a customer friendly place and as of now, I think I may have been scammed.","useful":1,"funny":3,"cool":0}
{"review_id":"O4v-1NYH4-t92X-zXBWynw","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"5-Gs-cUI_8-3Ykl9KbCLsw","stars":4,"date":"2011-05-06","text":"I started going to this nail salon last summer, so for almost a year now. It had just opened when I started going and I walked in off the street because I figured I'd take a chance, it looked clean and it was close to home. \nI was greeted by the owner, a pleasant Chinese woman, who did my nails that day. Since then, I've been back at least once a month for manicures and pedicures. Those are the only things I've had done, but I would suspect that the other services are pretty good as well. \nThe spa is new and everything is spacious and clean. They have massaging chairs for pedicures and the prices are reasonable. \nIt's a basic nail place, so the bells and whistles are not numerous, but that suits me fine because it keeps the price down, allows for walk-ins and gets you in and out pretty quickly. \nSome of the ladies in the salon do a better job than others, but no one does a bad job. I have had plenty of bad manicures before, so I know what a bad job looks like. Just don't go expecting someone to fuss over you, or give you plenty of conversation. English is not the first language and I have never felt the need to force conversation. \nIn this past year I have noticed a huge increase in the number of people that go to this spa, so they seem to be doing quite well. I have never had to wait more than ten minutes for service though and I'm happier they are busy because it means they are doing well and will stay in business. Good for them AND for me! \nSome of the services they give include manicures, pedicures, gel nails, waxing, threading, eyebrow tinting and ear candles.","useful":15,"funny":1,"cool":5}
{"review_id":"uRHeiP5iEnvnkN8P3gY-8A","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"uN2oZDJGO078ExbbV_DGmA","stars":1,"date":"2012-06-03","text":"I give up on this place! I have gotten burritos and other things from this place on several occasions and it's always been sub-par. Bland food, overcooked, sometimes burnt (nachos). As a result, I haven't bothered going or ordering from there in well over a year. Well, today I had a craving for Mexican and since Toronto has a huge lack of Mexican restaurant choices and because I'm busy working at home, my husband and myself decided to order from BarBurrito's delivery. I should also mention that if you go to justeat.ca BarBurrito charges $7 delivery. Orderit.ca has no charge. Don't know if that's the ordering website or the restaurant, but it's a tip for anyone who decides to order from this place.\n\nSo I went ahead and placed the order...only to have it be \"rejected\" by BarBurrito, because they are busy right now. This restaurant is listed on two different food ordering sites, but they won't deliver if they don't feel inclined?? SERIOUSLY! \n\nSo I have learned my lesson. Don't give places second, or even third chances. And this place...don't even give it a first chance. Not worth it at ALL.","useful":2,"funny":1,"cool":0}
{"review_id":"BPDhmOxSC4jk-hi9Va47cw","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"qbQ1qZx6eTy7pOOXMBfQNQ","stars":2,"date":"2011-06-22","text":"I think I may have been let down by this place because of all the rave reviews. But the fact is, I've eaten here twice and neither time was spectacular. \n\nMy expectations of a breakfast place are cheap prices, good food (because eggs are hard to mess up), fast turnover and service. This place has prices on the high end of breakfast place, on weekends they are very crowded and it will take some time to be seated and the food is alright. \n\nThe last time I went, I was with my husband and we went in the door to a huge crowd. There was no wait to be seated sign, but we guessed correctly and waited. Problem is that you pay and wait in the same place, which meant people were coming and going in a very small area. It was chaos for awhile. Finally we were seated outside at a picnic table and told that other people may be seated with us at the table, because they lacked space. \n\nThe waitress took some time to arrive and by then we were ready to give our order. I ordered eggs and bacon and toast. We also each ordered fruit smoothies. I asked for mine without banana. The waitress came back a few minutes later and said with a straight face, \"The guys back there put like three bananas in your smoothie!\" \n\nIt took me a minute to realize she was joking....heh....\n\nWe played several rounds of Scrabble on an iphone because the food was taking quite awhile and it finally came out. Our drinks were no where to be seen. We had to ask twice for them. By then we were almost done the food!\n\nThe food was alright, but I usually go to places like Egg Smart and for the cost, they give you way more food, for a better price and honestly, I think it tastes way better. These famous \"Boom frites\" are just thick, cut potatoes and they give you one slice of toast! \n\nAnyway, if you're in the area and really want some breakfast, it's not terrible, but I think you can do way better! \n\nOh, and I disagree that it's a good place for a group. Unless you want to wait forever...or make a group by joining another couple at their picnic table!","useful":2,"funny":0,"cool":1}
{"review_id":"QYw2OurOBplkQRCpYExp_w","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"XCxxPZ3Lu5mwmIo7IQRf1g","stars":4,"date":"2016-01-24","text":"This place is always solid and the customer service always very nice. It's not the BEST Japanese\/Korean food out there, but it's consistently good. What is lacks in finesse it makes up for in portion size. The portions are huge. It's our go-to sushi place these days.","useful":0,"funny":0,"cool":0}
{"review_id":"udzzB55YAxWEfVmkcZGYSA","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"VTs4f6LnUMHD4ysOezHSUQ","stars":4,"date":"2012-07-08","text":"Sometimes it feels SO good to be SO bad...for you. I have been dying to try out an actual poutinerie for a long time and it did not disappoint. I've been twice now. Once I had the basic poutine and once I had the pulled pork poutine. Both are good, but I really love that pulled pork poutine. The BBQ sauce they have has just a touch of sweetness and it really compliments the fries and cheese curds. A large poutine is more than enough for two people and I liked the little restaurant space with the 80s glam rock playing and quirky pictures on the walls. I guess my only criticism is that they need more seating. Both times I've been we got lucky and managed to snag seats as someone was leaving, but it's gross out on the street and this summer anyway, it's been SO hot outside. They don't have space for more seats, so this isn't really something they can easily fix, but maybe something to keep in mind for future establishments? Anyway, if you want a very unhealthy treat, it's a go!","useful":1,"funny":0,"cool":0}
{"review_id":"raUmEc0rdycXSRwXSOB5vg","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"g-OTq2Jb7FRP7cYDUlFCMg","stars":3,"date":"2012-04-15","text":"I have since switched hairdressers and am going elsewhere. Angela continued doing a fine job, but it was always the same. Very busy and always a bit sloppy. For example, no one ever put colour protector around my head, so you'd always end up with dye all over your skin and ears. They would send you home with some dye remover wrapped in tin foil, to wipe it away. This sort of stuff can be overlooked if the job is excellent, but it was always just good. Finally, I decided to see if I couldn't do better elsewhere. Still looking for that perfect hairdresser though.","useful":3,"funny":1,"cool":0}
{"review_id":"cd5K0jPd7Gv29x_h1Hhq3Q","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"pOvTYClFgMm-wAXPW1CnhQ","stars":2,"date":"2016-05-22","text":"I have eaten at several of these chains, every time thinking that perhaps this chance will be a bit better and honestly, this food is so underwhelming, I just give up at this point. The meat is bland and often dry and overcooked, served with rice and a salad (generic lettuce with ranch dressing-type stuff) and their naan tastes like cardboard. The rest of the stuff is edible, but the naan is just plain atrocious. I have had Afghani food in other locations and it's flavourful and delicious. This does not hold up. I guess it's take out quality, so a sort of McDonald's version of Afghan food, but I'd take a Big Mac any day over this stuff. Bleh.","useful":1,"funny":0,"cool":0}
{"review_id":"V6z_U8AA-35-pp7GMPRDBw","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"OwYElCdiJ1IGKVJ4--_mvQ","stars":1,"date":"2012-12-04","text":"This whole place basically sucks and it's even worse now. I have had so many bad experiences at this place, I just need to give up on it. \n\nA few years ago, Sheppard Centre was an alright place. When I lived at Yonge and Sheppard, there was a grocery store across the street and all the basics you would need st Sheppard Centre and it was good. \n\nSheppard Centre is at a major subway stop, in a hugely busy area, but somehow stores keep failing here. \n\nThat being the case, there are a few stores that are nice and handy. I would consider this mall for errands, now that I live away...except that the major reason for coming is gone now.\n\nSheppard Centre used to have 1 hour of free parking, which is a huge draw. You could go and park, run in and pick up your mail, or something from Shoppers Drug Mart and be on your way. They got rid of that. Not only that, but it's $3.50 for half an hour or under!\n\nI think this is pretty pathetic for a crappy mall. \n\n\"OH, but they have to pay for their excellent staff!\" you say?\n\nYeah, let me tell you about the staff that work there. First of all, you should also know that the ticket machine to pay for your parking tickets likes to break down ALL THE TIME, so you have to go to the parking garage and drive up to the ticket booth, park in the non-parking spots, block traffic and go in and pay the guys sitting around in the office...an office with TV screens of the parking garage, where our car has been broken into before...but it's not their fault. There are SIGNS that say they are not liable. Soooo...what are the TV screens for? To WATCH peoples' cars get broken into and laugh?\n\nRight, so back to the story! \n\nBefore I knew what to do when the machines broke down, I went to the in-mall security\/info booth to ask. The guy was behind the booth, on the phone, having a personal conversation. He saw me, but turned away and continued for ten minutes. Finally he got off the phone and made like he was coming over...only to turn away at the last second and start going through some papers. Finally I called out and said, \"Excuse me?\" He told me he was busy and made a point of moving towards me as slowly as possible.\n\nThis isn't the only time a staff member has been rude to me before. Dogs are allowed in the subway, so I was walking through once, to the subway entrance, HOLDING my dog, in my arms and a security guard chased me down to tell me dogs are not allowed. I told him I was just heading to the subway, so he followed me there to make sure. Yeah, because I really wanted to take my dog to the dollarstore and was clearly lying. GO STOP PEOPLE FROM BREAKING INTO CARS! \n\nBayview Village, down the street, or one subway stop over, has a Shoppers, a grocery store, a post office, a Blacks photography and clothing stores...like Sheppard Centre. It also has a Chapters with a Starbucks, an LCBO, GOOD restaurants and the people there are polite, the bathrooms nicer than mine at home AND parking is free.\n\nSo basically Sheppard Centre can bite me. I'm done with them.","useful":11,"funny":10,"cool":3}
{"review_id":"PRj0OFgJjN5ljpeDskP_Tw","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"6Q7-wkCPc1KF75jZLOTcMw","stars":2,"date":"2012-08-22","text":"Okay, so from what I am reading, a lot of other people got sort of \"conned\" into this hotel and I am no exception. We booked a trip through gate1travel.com and when you are booking they give you the options for hotels. The default booking is for Circus Circus, NOT Circus, Circus Manor Motor Lodge. It says three stars and even says this on gate1's travel site: \"The rooms are fitted with contemporary decor and furnishings. All rooms are equipped with amenities that will be sure to make your stay pleasant, such as internet access (surcharge), a hair dryer, and a television with cable channels.\"\nWe looked up Circus Circus, saw it was nothing special, but alright and went for it...and found out that in fact, we were in the Manor Motor Lodge.\nNow, I KNOW that this is gate1's fault and I'll be taking it up with them as well. Also, I want to point out that on my second night, I complained and they put us in a suite for the night, so this is nothing against the overall hotel, but there are still a few things people need to know staying here.\nRooms: They are DUMPS in the manor motor lodge. I asked, when we were checking in, if those rooms had been redone at all and was told that \"all the rooms have been updated in SOME way\"...well I don't know what way this room had been updated. The carpets were worn and stained. The bedding was the polyester crap from the 80s. The wallpaper was stained and peeling off the walls. The bathroom floor had cracks in the tile and a permanent grunge that could never been cleaned. It looked like a motel room you see in horror movies!\nThe hallways were constantly loud and smelled of marijuana, with cheap, apple air freshener over top, which was interesting because of the number of small children running around with distinctly trashy families. I even made a joke with a cab driver in Las Vegas, that we were NOT ugly enough to be staying in this hotel. He agreed and said it was the butt of the joke of cabbies on the strip. Good to know.\n\nHotel: The hotel amenities are geared towards children, but are basically a money grab. There is a small, indoor amusement park that costs something like $8\/30 second ride. There are shops and restaurants, but non are high end. We ate at three places while there and overall they were crappy. I'll give those individual ratings though.\n\nService: This was very good actually. I had a very pleasant bell hop help us out and all the wait staff and cleaning staff were very nice and the woman whom I complained to was very receptive and polite, so that earns them an extra star.\n\nThe thing with the hotel is that even these rooms we were stuck in, fall under 3 stars, even though they, by themselves, would barely qualify as 1 star rooms, because the whole hotel falls under one heading.\n\nSO, lesson to be learned, these rooms are NOT nice rooms. The hotel is considerably crappier than other hotels. It's also quite far from the main strip. BUT it is cheap. If you are (for whatever God-awful reason) bringing children to Vegas, I guess this would fit the bill. Otherwise, if you're just looking for a bed and a cheap one, this also fits the bill. The beds, I will say, had clean sheets and were comfortable. But don't be fooled into thinking you're getting this amazing deal on a three star hotel. You're not. You're getting an average deal, on 1 star accommodations.","useful":3,"funny":1,"cool":1}
{"review_id":"gWkXKIpYPk0HJGzwZf5bng","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"NUHNLaMg7aMesMdAiie73w","stars":3,"date":"2013-03-29","text":"OK is sort of the perfect description of this place. It's fine...it's not great!\n\nWe went here on a Saturday night. It's literally a block away from where we live and we have somehow never been. We finally decided to go for it!\n\nThe atmosphere is fine. It's nice and clean and much larger than you would realize from the outside. The decor it a bit cheesy with faux Roman sculptures. \n\nService was very good. The waiter was quick with our drinks and food and was helpful with suggestions. \n\nNow to the food. My husband ordered the veal parm and I ordered a pasta with chicken. We ordered brushetta as a starter. I noticed from the menu that, while a lot of selection, many of the pasta dishes were a bit uninspired. A lot of very basic dishes. Pasta with mushrooms and red sauce, or pasta with shrimp and pesto, etc. I really enjoy creative combinations and flavours when I go to an Italian restaurant, because quite honestly, I can make the basic stuff at home...for a hell of a lot cheaper.\n\nThat said, the pasta dishes were solid, if nothing special. My pasta was well cooked, but the chicken tasted like something you would find in a McDonald's salad and the mushrooms were good, but that was the basis of the dish. My husband's was basic, but veal parms usually are. He did note that there was a LOT of sauce on his. There was, but I like that personally, if there is bread to dip into it...but no bread was served to our table, other than the bread from our brushetta. \n\nThe brushetta wasn't great. The tomato mixture on top was good, but the bread wasn't properly toasted, so it got soggy and couldn't hold its shape. It kept falling apart when you picked it up. \n\nThe desserts really brought this place back for me. I had their homemade creme brule and it was really excellent. On the menu it tells you which are made in-house and I would highly recommend getting one of those. \n\nOverall, it was quite expensive for pretty basic Italian food, so it didn't stun me. I'm not opposed to going back, but it's not my first choice. My major reason for going back will be for convenience, because it is so close to us.","useful":0,"funny":0,"cool":0}
{"review_id":"3UI7I5dd8eKrlQiJ09LqLQ","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"ghWwqlRd1MaWz8hfgZ8Vsw","stars":3,"date":"2013-04-07","text":"We wanted something sweet for dessert, so after dinner we made our way to this place, which boasts the best gelato in Toronto. \n\nThe gelato was good, but certainly wasn't the best I've had. It was much more akin to ice cream and the flavour selection wasn't huge. \n\nThat said, they have some interesting flavours. I personally tried Twix and birthday cake and they were both very good. The more traditional flavour I tried (creme caramel) was a little boring and lacked flavour. \n\nMy husband had the strawberry, Skor and chocolate. All fine, none blew me away.\n\nOkay, so the gelato is good, if not the \"best\"! But perhaps that's being picky. If I'm in the area and want some dessert, this place is great and I can imagine in the summer it's fantastic.\n\nSo why the three stars?? First of all you can only get gelato in two sizes - regular and large. There is no small option and both of those options are quite large. If you only want a taste of gelato, there is no option for you! \n\nSecondly, although this place is named for it's gelato, it also specializes in cupcakes. We got a cupcake to bring home. When asked if we would like it packaged to bring home we said yes...and they threw it in a bag. The girl apologized and said they had nothing appropriate to package it in. Why did you offer then?? But furthermore, YES YOU DO! You literally have perfectly shaped round cups to put gelato in everywhere! Guess what shape cupcakes are??\n\nOh well, no biggie.\n\nSo, since this place is about the gelato and the cupcakes, you may be interested in the cupcakes...well the taste was overall good, but it was a very oily cupcake. The icing especially. The cake was moist, which is good...except it was SO moist the cake was just falling apart everywhere! \n\nSo what's the final synopsis. This place isn't bad. It has some delicious options. But nothing is perfect and in fact there are a number of flaws, which prevent me from giving it a better score. We'll see how I feel if it's a boiling hot summer day and I go in there for gelato though...I may be singing a different tune!","useful":2,"funny":0,"cool":0}
{"review_id":"TYkxJGu6jAhXDA5puuzziQ","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"aNNOpMame_VEIIZUQ8m5HQ","stars":1,"date":"2014-10-17","text":"Pandora charms are great, but not at this location. \n\nI purchased a charm from Pandora and it was put directly onto the bracelet. Overnight, I reconsidered one of the charms and wanted to exchange it. I brought it back, with the receipt, but was informed that I couldn't exchange it, because it was on the bracelet. \nI explained that it had been put there BY an employee. The manager was brought out and she was immediately snarky and rude towards me. She said she wouldn't accept a charm that was \"all worn and beat up\". I encouraged her to look at the charm. She could clearly see it was in pristine condition. She glanced at my bracelet as a whole, but did not look at the charm, instead insisting that she could tell.\n\nSeriously lady, you don't stand by your product at all? Your jewellery is so crappy it just gets beaten up and looks like crap after being worn for probably an hour total?!? This wasn't even my fault!!! Plus, she could clearly see from my bracelet that I had spent a LOT of money on my bracelet and am a loyal customer. \n\nI know that if I had gotten a Pandora box and put the charm in it and brought it back, they would have exchanged it without a problem. I can't now, because I'm sure I would be recognized. Instead I'll go to another location...where perhaps I'll be treated like a valued customer and not a leper. \n\nI've had bad experiences at this location before. The employees here seem to think customers are beneath them. Each location is independently owned, so needless to say I won't purchase from this location again. Anyone who wants to purchase from Pandora I encourage you to check out the Scarborough or Fairview Mall locations. Always had good experiences at those locations. \n\nInstead I have sent a complaining email to Pandora head office. We'll see what they respond with.","useful":4,"funny":0,"cool":0}
{"review_id":"f17tpJXCwTE0M137d9yX6g","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"zgQHtqX0gqMw1nlBZl2VnQ","stars":2,"date":"2013-10-19","text":"While I really enjoyed the noodles, their signature pork buns, which seemed to be something everyone orders and raves about, I did not like at all. The pork was pure fat and while it wasn't gristly, it was SO greasy, the grease positively dripped all over your hands. It was hugely unappetizing. I couldn't taste the cucumbers and didn't see any evidence of scallions. It was basically just pure fat, wrapped in a bland \"bun\". So I guess if you enjoy really fatty, greasy appetizers, this is the right deal. (Really, I can't stress enough how fatty the pork was...it was purely, white, greasy fat! Either change the name of the dish to pork fat buns, or please add some actual pork!)\n\nThe noodles however, were quite good and I liked the flavour combinations. I had the dan dan noodles, which is spicy pork, dried scallops and peanuts. I enjoyed that you could really taste the peanuts. I was a little disappointed that the pork was ground pork, instead of shredded pork. It made the dish seem cheaper and less inspired. \n\nI liked the atmosphere, but the seating is at long tables and so you share the space with whoever they place next to you. The seats are long benches, so if you're in the middle of the bench, you have to lift your leg over...I saw guys struggling to do this...now imagine being a girl, wearing a skirt and having to do this. No graceful way to go about that!\n\nTo be honest, this place just didn't blow me away enough to make a conscious effort to return. It certainly wasn't terrible, but it wasn't really good either.","useful":2,"funny":1,"cool":0}
{"review_id":"YWcQnNQnBx2BbSZ8H1q5tA","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"cefRDEK5O3t_iUuwnmL27Q","stars":4,"date":"2012-07-12","text":"We booked a reservation at Smith for Summerlicious. One of the major problems was finding it though. Almost every one in our party either didn't see it initially (it's sort of nondescript looking), or weren't sure which door\/staircase was the proper one to get inside. \nOnce inside though, it's an eclectic blend of vintage meets white-washed industrial. If you didn't know that was a style, neither did I, but it totally works. There was a great blend of music in the background...it was a mix, probably an employee just made it, but it was great mood music. I want that mix CD! \nMy brother had called several weeks ago to make a reservation and somehow they didn't have it. Apparently it's an answering service for reservations and they say they call you back if they can't accommodate you. He never received a call back, so the assumption was that the reservation was alright. Unfortunately, as I said, there was no reservation. The staff apologized profusely though and luckily there was space and they set up a table for us right away. \nWe ordered from the drink menu and I will say that they drinks are very expensive. The wine is what you would expect and the mixed drink (at least the one I had, the Smith Lemonade) was fantastic, but it was also $12, which is steep even for Toronto bar standards. \nAs I said, we ordered from the Summerlicious menu. I have heard many comments online that people are feeling disillusioned with Summerlicious because so many restaurants give you the cheapest options and it's not worth the cost. This was NOT the case with Smith at all. There were several great options to choose from and the food was excellent. I had the curried carrot soup, which was spicy but great. Every one else in my party also enjoyed their various appetizers. My main course was a Georgian Bay whitefish, which was done perfectly, just crispy enough on the outside and flaky on the inside. The pork chops were also raved about. There was also a risotto, which two of the three people who ordered it really enjoyed. You can't take that last guy (brother again) too seriously, since he's a very picky eater. \nThe desserts were all good, however the fudge ice cream, is really just chocolate ice cream, nothing special. The lemon curd tasted like lemon pie filling and was delicious and the bread pudding was heavenly! Seriously, it was SO good. \nI think everyone left feeling really satisfied. \nIt did take a long time to get the food. This wasn't a problem for us, since we were there to converse and I understand that great food may take some time, but if you are really hungry, or looking for a quicker meal, this isn't the right choice.\nBasically it lost of star because of the lost reservation and lack of visibility from the street. Also, we weren't thrilled with the washrooms. Besides the fact that they are co-ed, which is a little weird, there is one, large sink and a foot peddle to operate it. Since only one person can step on it at a time, you have to wait for that person to finish, before you can wash your hands, which starts to cause a bit of a back-up if more than two people are in the washroom. Also, the hand dryers were weak\/not working. \nThat said, I wouldn't let a slightly annoying bathroom stop me from coming here! This is a nice, little place!","useful":1,"funny":0,"cool":1}
{"review_id":"Iw-bsaG215bJVdmlI4UfRg","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"pmOlcFQg9Vs3ONHpVNNXjA","stars":2,"date":"2013-02-21","text":"A couple of weeks ago I was watching Diner's, Drive-Ins and Dives...BIG MISTAKE! This show is a heart attack in the making.\n\nIt also gives you cravings...often for food you can't possibly get, because they're making some crazy thing across the country that you cannot possibly find a duplicate for. \n\nNaturally I got a crazy craving for fish and chips...my mistake being that this was a Sunday and for whatever reason, no fish and chip places are open on Sunday. \n\nI did a lot of looking around, before I found this place, which wasn't too far away and was, most importantly, open! \n\nThis is a quirky place, with wood panelling on the walls and some random fish hung around the place.\n\nFry's boasts full day breakfasts and the fish and chips. I saw plenty of people coming for the full day breakfasts, which are decently priced and looked pretty good, if nothing special.\n\nWe came for the F&Cs though! \n\nWe ordered the single piece, which was MORE than enough food. Quite expensive though. You're looking at around $15\/meal of one large piece of fish and some fries.\n\nIt was good, but it wasn't great. Worst of all, the tartar sauce came in sealed packages....ugh.\n\nI'm sorry, but when I'm paying a premium for my fish and chips, at a place named after it's Fish and Chips...I WANT SOME DAMN PROPER TARTAR SAUCE! It's only like the EASIEST thing in the world to make.\n\nService was fine. No complaints. The waitress did her job...took our order, gave us our food and gave us the bill....that was her job and she did no more and no less.\n\nThe restaurant ambiance wasn't there, the food wasn't special and the prices weren't good.\n\nNext time I get a fish and chips craving I'm going to try elsewhere.","useful":1,"funny":2,"cool":0}
{"review_id":"AEVvtA58WlzFMbMvtwjrIg","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"pOEL97ld-FJMKO8Ki8JmYg","stars":3,"date":"2013-10-20","text":"Okay, so my rating has gone down from the first time I went here. \n\nI came again, with my family, for my birthday, at the beginning of October. Even though we had a reservation, our table wasn't ready. We were finally seated and the waiter introduced himself...and then disappeared. Came back ten minutes later and took drink orders and then disappeared for 15 minutes...this continued the entire time. Our dinner took A LONG time. It took forever for our drinks to be served and even longer for our food to come out. Then when the food came out, we got two plates and then waited five minutes for one more plate...then waited another five minutes for another plate. It took our group 15 minutes just for us all to receive the food! Obviously we couldn't eat until everyone had been served and the food was getting cold at that point.\n\nOh, the best part?? Someone mentioned it was my birthday and the waiter said, \"Oh, so you're a January baby,\" indicating to when I was conceived...to my parents. Yes...thank you sir. I would really like to be reminded of my parents' doing it, right before dinner...because that's completely appropriate. \n\nSo yes, the service this time was TERRIBLE! \n\nBUT, everyone enjoyed their food and thought it was really good, so there ya have it. Service hit or miss, but food is good.","useful":0,"funny":1,"cool":1}
{"review_id":"o-uJP0YZbD9X8_0IQPpGlA","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"RXaxKQJtExnRZX1inf8Nyg","stars":2,"date":"2011-08-20","text":"We ended up here because MoRoCo had rented out their entire restaurant for a party and we wanted a decadent dessert. We went in and looked at the selection and decided what we wanted and when the person behind the counter asked to take our order and we said we wanted to sit down. He wouldn't take the order and instead had us sit down and look at menus. We explained we knew what we wanted already, but he said he'd be back in a minute. This was fine, we weren't in a rush, but we were both a little confused by the ten minutes we sat there waiting for him. \nWhen he finally came out, as we were ordering, his cell phone rang and he took the call and walked away, around the corner of the building. We waited for about five minutes for him to finish his call and he finally took our order. Umm...that was some pretty shocking un-professionalism, but we laughed it off and ordered. \n\nI ordered basic New York cheesecake and my friend ordered an apple cheesecake. Cheesecakes were good, (she really liked her) and we ordered cappuccino and a flavored San Pellegrino and they were good and big sizes, but my cheesecake was a bit frozen in the middle. Knowing it wasn't fresh sort of took away from the experience. \nAnyway, we had a fine time here and the desserts are good, but not great. It was the service that was most disappointing. \n\nWill I go back?? Yes, if MoRoCo is closed again!","useful":1,"funny":0,"cool":1}
{"review_id":"JeIDwMKMsIPw6H6Q-B5ocA","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"3VK_NJI6mlT4LMrrM0uJiw","stars":4,"date":"2011-03-26","text":"Seems silly to write a review about an established makeup chain, but I have always had good experiences at this particular location. First of all, I find that this location seems to be sold out of things less often than others. This is an overall problem with the Sephoras in this city - they sell out of things and don't restock often enough. \nOne of Sephora's policies is that if you are, at any time, unhappy or unsatisfied with a product, you can return or exchange it.\nI bought a cream eyeliner from this Sephora several months ago and used about half of it before it decided to dry out (even though I had been keeping the lid on it). I took it back actually because I was hoping there might be some cream or something I could add, that would make it creamy again. \nNo need! They offered to give me a new one, or exchange mine. I chose exchange and they gave me a new brand that they said was excellent AND said they would mention the problem to the sales rep that was coming in for that brand next week. Not that I expect big things to come from that per say, but I'm happy they didn't just blow it off!\nMy only problem with Sephora (all of them) is that you need to make an appointment in advance to get makeup put on and you are required to spend a certain amount of money, while every other makeup seller does this service for free and accommodates walk-ins. I just hear people asking about it a lot and I had a party to go to one night and was downtown and wanted someone to help me touch up my makeup (without doing it myself using samples in the store) and they were very reluctant to help. You'll sell more things people!!!","useful":2,"funny":0,"cool":0}
{"review_id":"M_4UupfSUoept2sZHa8M0g","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"ogSBjY4agU0KDQJ2LOAc0g","stars":4,"date":"2013-03-06","text":"Poor Hero Burger is getting a lot of flack from people. I've never had anything but good experiences here. I think the burgers here are heads and tails above many other gourmet burger places, mainly because the diversity of toppings. \n\nI like the fries here, but they're nothing special. Same with the poutine, same with the onion rings (I;ve tried em all). But those burgers are good! No word of a lie!\n\nI think the prices are pretty standard for these types of burger places and service has always been fine for me.\n\nThey have a great coke machine...which I know sounds super weird, but you choose your drink...and then can choose the flavour. For example...if I want Fanta, I select that and can then choose any number of Fanta flavours. I always go with a diet cherry coke...where else does that even exist in Canada???! (I'll tell you actually. You can get that at Licks, but they get really confused when you ask for diet coke, instead of regular...they make it themselves). \n\nCriticisms of the small location are valid. This place is very small and cramped. Not nice to eat in...or even to wait. But it is what it is. They have a mounted flat screen for people to watch and they've done what can can in a super small space.","useful":1,"funny":0,"cool":0}
{"review_id":"ULrEMquQF4ojNkTZMh6WiA","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"EMx7IiWJK6KjQZNEAEbpow","stars":2,"date":"2011-11-20","text":"Basically I have been here two times, both for waxing, so that is all I am commenting on. Both times I have gone because my normal waxer has been MIA and this place is conveniently close. That said, I find it very expensive, especially for what you get. The first time I went I got the works done...legs, bikini, underarms, etc. The person doing the waxing was very pleasant and kept the conversation going, which I appreciated, but I was still red for DAYS, something I have rarely experienced before in years of waxing. That said, she got the job done. \nToday, however, I had a different girl, who was also very pleasant, but it wasn't until I got home, that I realized what a shoddy job she had done. Patches of hair are still there. I pretty much have to get this redone and I had to pay more to go to this place than any other place I've been to + tip! \nNot only that, but the facility for waxing is pretty pitiful. It's a VERY small room, with the \"bed\" pushed up against a wall. When I went in the summer it was very warm, so I'm not sure if there are A\/C or not. The other wall is entirely windows, which of course always have the blinds closed. It's a weirdly appointed room for a waxing area. Perhaps it was originally a storage closet? With windows?? I don't know, but it's not as though you're going here and paying more because the atmosphere is so much nicer! Anyway, as I said, this place is used in a pinch and now, I'm not sure I'd bother using it for that either!","useful":7,"funny":0,"cool":0}
{"review_id":"nXFan6mWQmMy4I2WOUTYgw","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"-dy1d0ohs4D8qkJoenHNJA","stars":1,"date":"2013-10-19","text":"No...I've had it with this place. I refuse to go back. Management changed sometime last year and this place took a HUGE dive...worse than before.\nThere is ONE waitress who works the entire restaurant. The service is hugely lacking as a result.\n\nLast time I went, they had half price appetizers. We were told that they couldn't separate the bill and she brought us one large bill....oh, but SHE couldn't subtract the half price from our apps, because she needed the manager, who wasn't there to do it. So she found DIFFERENT items, that were the same cost as the half price items we got and made the bill with them....well how in hell are we supposed to divide up our bill, based on items we didn't order????!? It was actually shockingly stupid. \n\nWe all guessed as best we could and threw in cash...I for one threw in the towel too. The food continues to be subpar at best, the prices are not great, even with half price and the service is horrendously terrible. This place is a waste of time and money.","useful":1,"funny":4,"cool":0}
{"review_id":"4mYUDAHM-z_uf37NHryQPw","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"kGOr_D-LNpgZ2M9N8TT4QQ","stars":5,"date":"2013-01-27","text":"I went here with my husband and another couple as the start to our double date night. I reserved a table on the Wednesday before and I'm glad I did, but even still we were originally seats in a less than ideal table. I spoke to the hostess and a manager came out and graciously moved us, which was very nice of them, because apparently many people call and reserve specific seats! \n\nI have walked by this restaurant a million times and never known it was there. It is directly on Bloor, but in a small \"mall\" which houses The Japanese Foundation and some other businesses. The restaurant is on the second floor and there are no readily visible signs on the street, so you would never think to just walk into this place...maybe that's the point! \n\nThe decor of the restaurant is really lovely. They have a huge, stain glass ceiling and dark wooden furniture and Art Nouveau decor. The bathrooms are large, individually sectioned off stall, with white and black tiles everywhere and large, vintage, French ads on the walls. \n\nTwo of our party ordered from the Winterlicious menu, one ordered from the regular menu and I ordered from their regular Prix Fixe menu, which they have available all the time and is $7 more than the Winterlicious. \n\nThey were also offering some Winterlicious cocktails...I had three (the same one) and they were excellent. \n\nOur appetizers included two salads, which looked great and (according to the orderes) were. My husband ordered the onion soup from the Winterlicious menu and it was great and I ordered the mushroom soup from the prix fixe and it was excellent!\n\nThe main courses included steak from the regular menu, which were ordered with steak frites. The steak was a nice cut of meat, prepared exactly as asked and the steak frites were served with a garlic aioli (which we all tried) and was really good!\n\nThe lasagna and pork belly were ordered from the Winterlicious menu. Lasagna came in a rounded dish, where it had been baked and was on the smaller side, but satisfying within a three course meal. My husband had the pork belly from the Winterlicious menu and I tried that. The sauce on it and the tenderness of the pork were really nice. \n\nI had the pistachio chicken, which was a huge dish! The chicken breast was served on top of another cut of chicken, but in dark meat. Both had pistachios on top and delicious sauces drizzled along the bottom of the plate and a few apple slices as garnish. I couldn't finish two pieces of chicken and I stuck mostly with the white meat, but it was a nice option to have to two and I tried the dark and it was really excellent as well! \n\nThe reason I chose the prix fixe menu over the Winterlicious, was because of the dessert. The Winterlicious had the pistachio chicken as a main and the onion soup was an option for the appetizer, but the desserts set the prix fixe apart. On the Winterlicious menu the option was a rhubarb crumble, or chocolate mousse. Neither of which I really cared for, although I tried it from my husband and it was good. On the prix fixe menu you have a choice of creme brule (which I have heard good things about) and a sticky toffee cake. I asked the waitress what she recommended and she said the sticky toffee, because it was such a lovely, winter dessert. I had been set on the creme brule, but you know what....brules are a dime a dozen. How many places have sticky, toffee cake? \n\nI was NOT disappointed. The cake was amazing! It was a small, singular bundt cake, topped with a toffee crisp and a small scoop of caramel ice cream and surrounded on the plate with warm, caramel. It was decadent and delicious. \n\nFinally I'll mention that our server was lovely and attentive and not a single person in our party were disappointed in any way. We all left very happy and satisfied. \n\nThis place is a little on the pricier end (would have been less so except for the three drinks myself and my friend had and the beers that the guys had), but it's great for a nice night out, or a romantic date. \n\nI will definitely come back some time in the future.","useful":1,"funny":0,"cool":1}
{"review_id":"DdrJIdkMm9jOSNzUGIHJTg","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"oQylTvXwGIkKFdCjmafKVg","stars":4,"date":"2013-02-10","text":"We went here after dinner, simply for drinks. I wanted a cocktail and my sister recommended this place. \n\nGood choice mon soeur! \n\nThis cute little bar has nice, clean decor, with some interesting touches, such as a large, metal cross on one wall, that I was a big fan of. \n\nThe service was great and the drinks were a good size and were excellent. My husband had scotch and said it was very smooth (that's more a comment on what they offer, as opposed to bar tending), but my sister and my cocktails were great. They are about average price for cocktails, but the size makes it feel more worth it ($10 for our 3 oz drinks), in large martini glasses. \n\nWe didn't have food here, but I would be interested in coming back some time and giving it a try!","useful":0,"funny":0,"cool":0}
{"review_id":"cxZaVX0Jf3SWJqUDWnca5Q","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"EjZYT46Y2qHSoChynd0q-A","stars":4,"date":"2012-11-11","text":"This small gallery is a bit hard to get to at present, because of construction going on right outside of it on the street, but the walkway through is filled with people working in textiles, sculpture and glass blowing, so it's pretty cool. \nI took a school group there. FYI for only $1\/person you can book a tour and the gallery theatres will be yours exclusively. We were not so on top of things and just showed up with 35 kids. Luckily, they were really accommodating and we split the kids into two groups to watch The Clock. Worked out really well and the kids really liked it. I was so appreciative of how nice the gallery staff were. It's a small gallery, but with interesting exhibits.","useful":0,"funny":0,"cool":0}
{"review_id":"qjRyKiV9DqjVILe4-KZhsQ","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"M8_C-be43AQsH_sEgLPFPg","stars":5,"date":"2013-01-11","text":"I was so surprised to see the negative reviews of this place, after having just had such a good experience there! \nI went with a bunch of friends from work. Some of the friends has heard that this place KNOWS their wine and ordered a bottle of chianti, which was great (and I'm not a huge wine drinker). \nThe ladies I was with ordered two caesar salads to share amongst the four of them and the waitress brought them out the salads already split on individual plates, garnished with a garlic bread crouton. I don't think the salads were anything special, but I find that caesar salads in general aren't, so peoples' complaints about them below seem largely unfounded. \nI ordered the baked goat cheese appetizer...OMG it was SO good. Goat cheese and grilled veggies on top of a portobello mushroom cap, with some sort of sauce and with salad and shredded carrots and balsamic reduction....to DIE for. \nFor my main I ordered the Penne Gorgonzola, which was also fabulous! The members of my partied ordered the veal parmesan (but grilled veggies instead of the pasta), the salmon with a lobster brandy cream sauce, a NY striploin and fettucine and everyone loved their food. One woman I was with IS a chef, so I feel like that was saying something. \nNow, since I didn't taste their dishes, I can only expand on my own. The sauce was to DIE for. Creamy, complex and delicious. The pairing of veggies with prosciutto and cheese was excellent. I would order that dish again in a heartbeat! \nSince we were having a good time and the food had met our expectations, we went for it and ordered dessert (even though we were all stuffed). We all ordered the white chocolate creme brûlée, except one friend who ordered the tiramisu and were once again not disappointed. Our creme brûlées were crackly on the outside and creamy on the inside. Perfect! The tiramisu was apparently great, served very untraditionally in a large plate, with an indentation like a bowl in the middle. \nI was also pleased to find out that they serve caffeine-free cappuccinos, so we all ordered those as well and it was served with a little almond biscotti and was great!\n\nAltogether my meal came to $50 (tip included), which I think is more than I would spend on a normal dinner out, but not crazy. Also note though that I did not pay for the wine and did not order any other drinks. That would obviously have increased the price. \n\nThe restaurant atmosphere is nothing special, but I'm disenchanted with the trendy spaces and pretentiously presented food that isn't half as good, so this wasn't a concern for me. The restaurant was clean and comfy, but the furniture was a little on the older side (like the dining chairs you would see in your fussy grandmother's home) and fake paintings on the walls.   \n\nThe service was excellent. Our waitress saw to our every need, answered all our questions and came over to chat and make sure we were happy and comfortable regularly. \n\nSo, was it perfect? Well as I said, the salad was probably just average and the atmosphere also just average, but those did not pose major problems. I would ultimately give this place 4-1\/2, but since I can't and this leaned more to the good than anything remotely bad, it gets a 5! I would go back in a heartbeat!","useful":2,"funny":0,"cool":0}
{"review_id":"QgSf2JvYz-M4PU2yuJjxNQ","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"9Jc3W0aR9Xf2gcHI0rEXsw","stars":1,"date":"2012-08-23","text":"After being scared away from Rock & Rita's, we ended up at this place, which was, if nothing else, quieter.\n\nI'll start by saying that the hostess and our server were both lovely and they're really what earned the single star, because they were sweet, but the food was just horrible.\n\nI ordered a simple grilled cheese sandwich. I asked the server if it was processed cheese, or \"real\" cheese in the sandwich and he had no idea what I was talking about. I tried to clarify by saying, \"Is it like Kraft single slices, or deli cheese?\" He said it was \"good\". This really should have been a sign and I could probably fault the waiter for this, since you SHOULD know what you're serving, but he was so sweet, I couldn't be mad!\n\nMy husband ordered a hot dog of sorts.\n\nI asked if there was a way to substitute fries for a salad. There was not, but the server hooked me up and brought me a salad anyway (no charge). I asked for sweet potato fries with the sandwich.\n\nOf course, my sandwich was made with plasticy, processed cheese, that was melted to the point of Cheeze-Wiz and was inedible. I took one bite of the sandwich and couldn't do another. I got regular fries, instead of sweet potato (didn't bother complaining, because I got the free salad, so whatever...like I said, nice server!) My husband's food was fine, although nothing special. They were good with the refills of our drinks.\n\nAnyway, as nice as the servers were, it wasn't good. I would avoid eating here if I could.","useful":0,"funny":1,"cool":0}
{"review_id":"gN6GARS_BRr5UX2D3WAH0w","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"xVEtGucSRLk5pxxN0t4i6g","stars":5,"date":"2012-08-23","text":"We got recommendations for this place from my parents and so, for our anniversary, we booked here. We were told though that it was first come, first served, in terms of having the ideal seats by the windows that overlook the fountains of the Bellagio and The Strip.\nWe went for lunch though, so it wasn't too busy. We were seated by the window and were promptly served some sort of puffed rolls, with cheese and herbs infused. They were delicious!\n\nWe ordered the onion soup to start and I ordered parmesan chicken and my husband ordered a lamb burger. Our food came and was delicious. The soup was probably my favorite part. We were feeling very full by the end and so declined dessert, but were still given some jellies and chocolate truffle and then were served a small chocolate mousse, on a decorated plate that said Happy Anniversary, which was a total surprise (they had asked when I booked if it was a special occasion, but had said nothing while we were there).\nOverall the service was great, the food delicious and the view wonderful. It was a great experience!","useful":0,"funny":0,"cool":0}
{"review_id":"ajQqbeiuBt3R8eTwl6rcBA","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"6Toez65egZSMV1iohQWGIQ","stars":4,"date":"2011-08-17","text":"I went here for the first time yesterday night to celebrate something with my family. Several members of my family have been to this place before for Summerlicious and really enjoyed it. \n\nA nice atmosphere and excellent service, everyone ordered a variety of different dishes, many of which I tasted. I myself had a chicken salad and thought it was very good. My sister's pasta dish was amazing though! Our waiter never rushed us out and was quick to refill water and bread and clear dishes, etc. That with an arm brace on! \n\nPrices are a little high, which is why I didn't give this place five stars...I know those amazing places exist out there with great food AND great prices, but this was a nice evening out.","useful":1,"funny":0,"cool":0}
{"review_id":"41bCWLhtGU3I0qHVHEtW6Q","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"DGkjLTH7BiHp_sMgUExYCQ","stars":1,"date":"2011-03-26","text":"Worst experience EVER! I had been there before to get my nails done and the first time was quite good, but the second time was a hot mess. It looked like a five year old did my nails for me. I went home and took the polish off. But this is the kicker:\nI couldn't get an appointment for highlights at my regular salon and this was close by, so I decided to give it a try (obviously the nail girl wouldn't be doing my hair). I went in and sat down the a woman with an Eastern European accent  came to talk with me. I showed her a picture of what I wanted and she showed me various hair dye samples....none of which looked like my picture, but I always assume the hair dressers know what's best. Now, you're all thinking, \"..and she did a poor job and you hated the colour...\" right? \nNope, she told me she couldn't do my hair because I had lice! Of course I freaked out. Another hair dresser came over to see if I was alright and I was mortified. She asked if I had experienced any itching. I said no. This hairdresser turned back to the original hairdresser and asked if maybe it wasn't too bad yet, but original hairdresser said it was really, really bad. I freaked out and left (obviously without having anything done) and went to a Shoppers and bought lice shampoo. I went home and had my husband look at my hair. He looked and looked and could find nothing. I still didn't want to take chances, so we tore the house apart and washed and bagged everything and I went to a walk-in clinic. The doctor looked at my head and ALSO said there was nothing there! \nSince I was paranoid, I still used the shampoo and anytime my head itched in the slightest I went to examine it. But even with my husband and mother looking at my head, we never found a single thing. We didn't even see dandruff!! I went to a hairdresser a week later and they told me my hair was beautiful...but dry at the ends...yeah, because of the chemical-filled lice shampoo! Thanks a lot you crazy woman!\nSo ultimately, I never had lice. I don't know if this woman just decided she didn't feel like doing my hair, or if she was delusional, but I sure won't be going back there EVER again. No one else should either, unless you want to risk being embarrassed and inconvenienced.","useful":7,"funny":9,"cool":0}
{"review_id":"YLGx6D1zdJdwItx3mKf9lA","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"dSPR-58U95ufvmbvxMpKZg","stars":2,"date":"2012-12-21","text":"I LOVE cupcakes. Seriously....LOVE affair! So I'm always on the lookout for new cupcake places. I was in Scarborough Town Centre and came upon this kiosk. It's not a storefront, but a rather ingenious booth, with colourful signs and a glass showcase full of cupcakes. \n\nThere is a long list of flavours and I suspect (as with many places) they make different cupcakes for different days. \n\nI ordered 6, which was $18...I know, it's steep, that's pretty standard. Cupcake places seem to range from around the $2.25 mark to around $4\/cupcake. So these guys fall somewhere inbetween. But not cheap, so I expect excellence, needless to say.\n\nNow, here's the strange thing. On their website each cupcake is listed as $2.90....was this the case at the store?? I sure hope not. Why would you have to pay MORE for buying more? Maybe it's an ordering online thing? Anyway, my GUESS is that you're paying $3\/cupcake at the store, or $18 for 6. No real incentive to buy 6. But I did, so moving on....\n\nOf course I chose a range of flavours: oreo cookie. chocolate with vanilla icing, salted caramel, lemon and a double chocolate. \n\nOver two days we managed to work our way through them (myself and my husband) and I nibbled the different flavours. Lemon was my favorite, by far, with the salted caramel being a huge disappointment. It was entirely too salty. More salt than caramel. It wasn't very good at all.\n\nBut that said, none of the cupcakes really blew me away. AND in fact, they were VERY stale the next day, despite being stored in an airtight container, in the fridge. Luckily, the cold buttercream frosting was easy to scoop off and once they had been in the oven for a few minutes, they softened up a bit. \n\nThe bottoms of the cupcakes stuck to the wrappers and the flavours were dull tasting and uninspired. \n\nI was also surprised at the lack of creativity in terms of Christmas flavours or designed. Right before Christmas you would expect some special flavours...maybe a candy cane, or gingerbread cupcake. It would be so easy to switch out one flavour and try to get people to consider your product for a Christmas party dessert. \n\nHaving a little kiosk in a mall is a smart idea. Sadly, this business is not one I think I will bother with again!","useful":2,"funny":0,"cool":0}
{"review_id":"w49b3pqthy3YyB7AUqXsRQ","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"iL2pb5Khi6jV113vOVQCvA","stars":4,"date":"2013-04-07","text":"I had a craving for Mexican and came here (ie. Yelp) to figure out what we could do, because there is a very real lack of good Mexican food in Toronto. This place had some good reviews and wasn't too far away from us, so off we went.\n\nParking in Leaside can be pretty brutal, but we finally found a space and luckily, street parking is free. \n\nThe restaurant is tacky, stereotypical, but cozy and we were quickly greeted and seated. \n\nThe menu has basic Mexican fare, burritos, fajitas, tacos, with your choice of meat. Nothing too outside of the box, but that's not necessarily a bad thing. \n\nWe ordered the guacamole to start and I ordered a chicken enchilada and my husband ordered the chimichanga. \n\nThe guacamole is very delicious and creamy, but we had to ask for more nachos and even then it felt like not enough. We were really loading up the chips with the guacamole! \n\nThe food came out and the was served with rice, a salad (sort of Italian dressing with feta and tomatoes) and refried beans. The salad was pretty generic and the rice was bland, but the actual main courses were great and the refried beans helped with the spice (I'm a wimp). \n\nThe appetizer and our main courses came to $30 and we were VERY full. \n\nService was good and food was good and it wasn't too expensive. It wasn't perfect, but we'll totally be back!","useful":2,"funny":0,"cool":2}
{"review_id":"-FV47bShEgvxQCoh9Qrxvw","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"bKh66jlEqEKZZFkjWipt8w","stars":4,"date":"2015-09-21","text":"Came here with my mother, husband and baby for brunch\/lunch. We were all quite happy with our choice. I think I was the \"winner\" by ordering the french toast. It was practically half a loaf of bread, covered with fruit and with delicious cinnamon butter. My husband ordered the Stoney's breakfast, which is your basic eggs, toast, bacon, etc, meal. My mother ordered the omelet. Huge portions, BUT at around $11-$13 per breakfast meal, it was on the steep end of brunches and other than mine, I'm not sure the price is warranted, especially since it's a order at the counter, then find a seat with your number and wait for your meal type place. People were friendly and service was good (for what it was). I would give it a try if I was in the area again.","useful":0,"funny":0,"cool":0}
{"review_id":"OxCinkDSTkiliTqcarxmXg","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"lUstDPzw7aEmnHoR2L_SYw","stars":2,"date":"2013-01-03","text":"Never eaten at this place before, but it's always crowded and I decided that must mean something. I was running errands and hadn't eaten the whole day, so decided to finally give this place a shot. I ordered a chicken sandwich and iced tea.\n\nThe iced tea doesn't appear to be iced tea. It was a dark reddish colour and tasted like very watered down pomegranate juice. It was inedible. It was super gross. I was thinking that maybe they made a mistake, but I can't see on the menu anything else it might be and the girl who took my order, poured the drink and gave it to me SAID it was iced tea. Sooooo ew. \n\nSandwich was alright, but just alright. The \"aroma sauce\" which is a garlic mayo of sorts was good and the roasted red peppers and mozzerella on the sandwich were good. The bread was good, but the chicken was the sort of cheap, crappy chicken you find at Subway, where it's a sort of compressed chicken-like white meat, with fake grill marks on it. It had no taste and really took away from the overall sandwich. \n\nThere are soups, salads and of course hot beverages served at this place as well, so I'm not writing it off just yet, but this was not a good first impression.","useful":0,"funny":0,"cool":0}
{"review_id":"0fYQ8H4XnrUNhbsZiR_Dgw","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"s9TzmT2kZmOZkTa53D2e3g","stars":3,"date":"2016-10-24","text":"Solid soup place...has an ever-so-slightly sketchy vibe to it...you order your soup and the woman disappears into the back...usually closes the sliding window so you can't see back there and then eventually emerges with your soup. Also seems to sell a selection of Jamaican movies in DVD from a glass case...sort of random.\n\nGenerous with the veggies, less so with dumplings, but all the soups have great flavour and are decently sized for the price. I wish they would offer some bread or crackers for the soup...would be a nice, easy add-on. But this place is what it is and doesn't bother with the bells and whistles. Really deserves a 3.5 stars. The red bean is my fav by far.","useful":0,"funny":0,"cool":2}
{"review_id":"xo2IEi9QTz-csuKKKkAbjQ","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"HxLouUPqiou7D6YK5t-DgQ","stars":3,"date":"2013-02-03","text":"I would be more inclined to give this place 3-1\/2 stars, but since that's not possible, I'm rounding down. \n\nI went here for Sunday lunch with a group for Winterlicious. For $15 we got a choice of appetizer, entree and dessert. \n\nWe arrived first and our table was waiting for us. The restaurant was not busy at that point and our waiter was very attentive with water and the wine menu.\n\nOnce our party finally arrived we all ordered. I had their Chipotle Sweet Potato & Goat Cheese Dip, which was average. The salads looked much better and got better reviews. Same with the soup. The dip was literally a dollap of dip at the side of the plate with some crostinis on the other end and 1 piece of pickled cauliflower and a few slices of onion in the middle. The dip was good, the pickled cauliflower alright. It was nice when all combined on the crostini (pickled veggies, dip on top of crostini). \n\nI had originally wanted to order the double pork slider, but I saw it arrive at someone else's table and it was literally just the one, single mini pork sandwich, with a few thinly cut fries at the side. It looked good, but it was appetizer size, IF THAT. The chicken sandwich was more reasonably sized, so I ordered that. It was good. I really liked the bread. The macaroni was also more reasonably sized. I sampled it and it was fine. Didn't blow me away. \n\nDessert was the highlight of the meal for everyone I think. Some people ordered the mousse, which I thought was fine, but the people who ordered it loved, so there you have it. My husband loved his apple terrine, which I tried and was good. I liked the flavour of my creme brule very much, but the top was over toasted and had hardened to the consistency of a thin, hard candy. It was hard to break with my spoon and got stuck in my teeth. \n\nThe service was consistently good, so no complaints there. None of us had wine with our lunch (although some had other drinks), so I can't comment there. \n\nThis is a tapas bar, so I expect sizes to be small. BUT when sizes are small I expect them to be priced accordingly and\/or to be in sharable portions. They gave the prices of each dish if you were to purchased them individually. These would all be hard to share and wouldn't really be worth it. They are nice as a Winterlicious meal, but I'm not sure this would be my first choice to go back to.","useful":1,"funny":0,"cool":0}
{"review_id":"bTThiQrwLzf0eghkBP2AXw","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"c78Pat78fVUBFPXYeVvbaQ","stars":5,"date":"2016-01-24","text":"I am surprised at the people complaining about the service, because we found the service to be fine. Especially given how busy and cramped it was. There were no tables, but they got us seats at the bar. The music was maybe a little loud, but I enjoyed the 90s throwback that was happening. The place looks like a dive, it's a total hole in the wall, with no signs to speak of, but I liked the weird atmosphere of weird, old \"ghetto blasters\" on the walls and pics of Arnold in Terminator. It's random, just go with it...\nBut the food....OH the FOOD! We were told that the squash poutine was a must have, so I ordered that and the bulgogi cheese steak, while my friend ordered the poutine and the mackerel. The mackerel was served first. It arrived raw, on a platter and a torch was taken to it to sear the outside and that was it. My friend allowed me a bite and it was so fresh tasting, with a delicious marinade. Next came by bulgogi sandwich. Fresh, delicious bread and amazing bulgogi. Was very pleased. Finally the \"poutines\" arrived. I should say that it was not what we were expecting. I assumed it would be squash on top of fries. But in fact the squash was the fries. THey were lightly fried and covered in a variety of sauce \"gravies\" and scallions and some other stuff that I could neither make out, nor even see clearly (dim lighting). It doesn't matter okay....this stuff was HEAVEN! Both my friend and I took a bite and looked at each other...and proclaimed our new favourite food. \nOther people in our party got the wings, which looked amazing and they said they were and The Loosey, which was also proclaimed as delicious. So basically there were no wrong moves. The drink menu was very adventurous...more so than we were, because we didn't take the plunge, although it was fun sitting at the bar and watching the bartender creating them. And splitting the bill for my friend with two others (her birthday), my two \"tapas\" and a generic alcoholic beverage came to just under $30. The prices are extremely reasonable...and honestly once you try this stuff...I mean, I don't want to give them any ideas, but I would have paid more for that fine, fine food. I will be back. Need me some more of that poutine!","useful":1,"funny":0,"cool":1}
{"review_id":"iJ5iOBh7bMKMtF9j-6G7_w","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"GNEjlH_KssnJVRtqV4hAiw","stars":4,"date":"2011-12-20","text":"Our friends got the groupon for four people and took us along. I'm very pleased we went! Having never had Ethiopian food before, we were curious, but wary. The deal really helped us dive in. It included two appetizers, four main courses and two desserts. We started with two appetizers, one I wasn't a huge fan of (a \"salad\" with a strong vinegar taste and jalapenos, which I found too strong, although other people in my group really liked it). The other appetizer was similar to an Indian samosa (similar name too, but I can't remember exactly what it was called). They were stuff with lentils and had a flaky shell. They were DELICIOUS. BUT, their appetizers were only made for three people, so there were only three of them! Seems silly when you offer a four person deal. \nWe each ordered a different main course and they brought them on one large platter, so we could all share. We ordered two vegetarian options, one of lentils and one of chickpeas and one of chicken and one of beef. Basically, the meals are more sauces than anything and they are served with injera, which are sort of bland, cold, bread-like stuff, which comes rolled up. They're nothing special, but they're only used as a sort of utensil, because you use it to scoop up the food. The food was delicious! I especially liked the chickpea dish. Every one of us ended up liking a different dish the best! Worked out well. I personally found the beef dish very tough though. \nOnce we were stuff with the food, we ordered two desserts. We especially liked the cheesecake (which is obviously not Ethiopian). \nWe asked if they had any Ethiopian coffees and they said yes. THey showed us the beans, as they were being roasted. Then they came back out with a sort of stone earthenware kettle and some small cups. The coffee was so rich, it was almost like chocolate. They also served it with a large basket of popcorn, which was just perfectly prepared. It was such a nice after dinner snack! I would totally come here just to order the coffee! \nIt would have been a very expensive dinner without the groupon, so I'm not sure I would make this a regularly destination, but as I said, the coffee was fantastic and it's a fun thing to try, especially with friends. Make sure they're good ones, that you don't mind getting messy in front of!","useful":1,"funny":0,"cool":0}
{"review_id":"iX6GLmUf6W81zGaiZ6mTDA","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"L6R2Op88NkoG1EGxlVvdRQ","stars":4,"date":"2014-10-17","text":"A little on the pricey end for baked goods, but the baked goods are GOOD. Also their coffee products are great. The set up is annoying (order your desserts on one side and coffee and food on another side), but the service is good and overall they do a good job.","useful":0,"funny":0,"cool":0}
{"review_id":"N8V5nx8maSqoK4alQ6S4fw","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"_vZ7bHaGCjllogiZ7RH17w","stars":3,"date":"2014-04-02","text":"My sister told me that Origin was well known for their delicious brunches, so we made a trip there to see if this was the case. \nOrigin is pretty new in our area and is very large, but nicely decorated. My only comment would be the washrooms, which feature communal sinks, the kind you find in elementary schools, where you step on the thing at the bottom and water comes out all around. Besides not being very effective to quickly wash hands, it's also wasteful if you're the only one there. Strange concept. Throw back, but not necessarily one wants to remember during their brunch.  \nNow onto the important part...the food and service.\nService started out alright and then immediately got very slow. It took some time to get our drink orders and then took a LONG time to get our actual orders. \nI ordered their French toast, my sister ordered tostada and my husband skipped brunch and ordered a meal they offered of a burger, fries covered in some chorizo and sauce and a float. I also ordered a side of bacon...and was told that they were out of bacon...which meant any orders that would have come with bacon were out entirely, or would be served without bacon. I'm sorry but a brunch restaurant without bacon? Even the waitress admitted it was ridiculous.\nWe also shared a plate of buscuits with their preserves. These were delicious.\nApparently my meal was the one that took the longest. The others got their food and we still waited for five minutes before mine came out. Who knew it would take so long to put a couple of pieces of bread on a plate and cover them with blueberry preserves?\nMy sister said her tostada was quite good. My French toast was nothing special. The toast was \"fancy\", rounded pieces, on top of each other with whipped cream and blueberries in between. The \"maple\" which was supposed to be on the plate (maple syrup I'm guessing) was barely present. Tasted like something I could have created with some ease.\nMy husband's dish was the best by far. His burger was juicy and this fries were great. The float was a little silly...this big, meaty burger and fries covered in more meat...paired with a cream soda float in pink and white layers. (Not insulting, we just got a laugh). \nNothing was cheap and then we had to wait a long time again to get our bill and pay. This was all strange because the restaurant was not particularly busy.\nBecause the brunch itself didn't blow me away, food shortages and service, I'm not sure if I would bother with brunch again. Oliver and Bonicini in the actual mall has a much better brunch. I might try this again for lunch or dinner though.","useful":0,"funny":0,"cool":0}
{"review_id":"hjzPl3GkvgMSpetXdHvYGw","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"YvuniBBiSs66vx9GtYO2hg","stars":1,"date":"2017-02-15","text":"The saga has finished....because I needed to end this BS and move on. \n\nSo first off, the store owner responded to my complaints...by blaming me. Apparently it is MY fault they sent the wrong thing, because I sent an email and then followed it up with a phone call...which confused them and made them think there were two orders or something. Which makes zero sense, because two orders were not sent. And the person I was speaking with on the phone responded to the emails I sent with codes to try out....so I have a hard time believing that they were confused by what was going on and thought that the phone order and email order were different. \n\nThey also told me they blocked me on instagram because I was body shaming their models. I want to be VERY clear on this. I never once body shamed, or made any comments on instagram about their models. I asked why they were promoting clothing they don't even have in stock on instagram...apparently that equates to body shaming to them. \n\nThey also informed me that because they had to mail so many orders to me (3), they were going to start to charge me for shipping. They seemed to forget that I had also been paying to ship items back to them and that I had specifically chosen times when they had free shipping promos taking place to place orders. It's not that they weren't charging me for shipping...it was that I was taking advantage of their own promos. Apparently I can't use their promos anymore, because they have placed an arbitrary rules on how many times you can make a return now. At least for me. \n\nThey did not address the code not working. \n\nI responded and expressed continued frustration at their lack of ownership over their mistakes and how poor their customer service continued to be. \n\nThen I did some research and sent another email. Instead of returning the dress I would donate it to Dress for Success. I said this seemed like a better choice than continuing to mail clothing back and forth. My request to them was that they take the would be money they would spend on continuing to mail me clothing and take some ownership for their mistakes and channel it into something good. I asked that they take the remaining $9.98 credit I had and put it towards them making a small donation, either monetarily or a piece of clothing, also to the charity. I stated that their continued neglect for customer service and lack of ownership over repeated problems should be owned up to, but if they wouldn't do it for me, perhaps they would be willing to do so for someone in need. I said that would conclude our business and bring something good out of this ridiculousness. \n\nA few hours later I received an email with a letter of thanks for a donation made to Dress for Success...for the amount of $10 via the store....so my remainder amount I had paid for and Big Sis Closet's contribution of....two cents. Their generosity is astounding. NOW, I don't know that they haven't made their own donation and just not told me of course...I'll let you guys decide whether you want to give them the benefit of the doubt in that regard. But given that they have taken zero responsibility for the continued poor management and customer service, well...I think you can guess what my thoughts are on the subject. No further correspondence was sent from the actual store. \n\nBut at any rate, I am donating the new dress to Dress for Success (along with my $9.98) and I am officially done with this store for good. And I sincerely hope that people read this review and think twice about shopping here. The clothes are not good quality, but more than that...I have NEVER experienced such insanely bad management and customer service in my life. Zero regard for their customers, zero regard for their own mistakes, zero regard for taking ownership of...anything! Just excuse after excuse and then turning the blame around on their customers. These people do not deserve your business and quite frankly...ladies you deserve better. Better clothing (I have now purchased 6 items and been dissatisfied with the quality of all of them...loose threads, flimsy, cheap fabric, wrong stitching for the fabric, no lining, incorrect fit for size, etc.) and a greater degree of respect as a consumer.","useful":1,"funny":0,"cool":0}
{"review_id":"iPqFD9u2K2KRK99tcruL_A","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"h0TKP2PK0QaAqvqdILU1Vg","stars":4,"date":"2015-02-07","text":"Went here with my sister and her boyfriend for some drinks. We were hungry and ordered a few appetizers to share. Drinks were fine (my mix drink was on the VERY small side), but the food was really good. The perogies and \"chips\" and dip were excellent. The service was good and the atmosphere was nice, for such a small place. Bathrooms were also nice, clean, etc. Only problem is that some of the tables are SO small, it's really hard to use them. We were at a very small one and even though we fit around it alright, a guy walking by knocked a beer over with his coat and it dumped all down me. I mean ALL over me. It's not the bar's fault the guy knocked the glass, but if the table was a bit bigger we would have had more room to put the glass further in, so it wouldn't have gotten knocked in the first place. The fact is, if you're going to serve food people need a place to put it. A few slightly bigger tables would go a long way.","useful":5,"funny":0,"cool":0}
{"review_id":"GPzhg9P5VbWiPOG66SCRnw","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"3BA3Ro7GcZb1N_PQW4m1dQ","stars":4,"date":"2015-09-26","text":"Went here after dinner across the street at Lemon Bistro. Was excited to see a Nutella Latte on the menu, which I ordered and which was good, but lacking much in the way of being really \"nutella-ish\", other than a slight hazelnut flavour. \n\nOrdered pistachio and .....some hazelnut\/chocolate gelato (can't remember the specific name) and both were great. Service was lovely. Nice, cozy little place. \n\nI wish there were a bit more in terms of other desserts besides gelato. There were a large selection of macaroons, but some biscotti, or little mini cupcakes or something, would be great with the latte. I know, I know, it's a gelato place. Honestly, that's why it's still 4 stars. Those added suggestions would make this place over the top is all. Still, a solid place, I would recommend.","useful":1,"funny":0,"cool":0}
{"review_id":"u_8gv0SYGejGklZVzibw7A","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"vnIdWzIB2W4j9cDcd6tHAQ","stars":3,"date":"2012-04-01","text":"Well, we decided on a whim that we wanted Mexican food and we called around to some places that were highly rated and no seats were available. One of my favs, Chimichanga's, has disappeared, so we got to a point where we were just calling around to see WHO could take us. Finally...La Revolucion answered!\n\nWe walked in and were greeted with....a dishwasher, sitting in the middle of the floor. Sort of strange...maybe some kitchen renos? We walked to meet our friends and their table and were informed that the reservations were not made, or were forgotten and the waitress had had to kick out a single guy from the table and he was eating at the bar. Maybe he was lucky, because the table was SO sticky underneath that my shoes were sticking to the ground. I mean STICKING!\n\nShe took our drink orders and then gave us our drinks and walked away. It took us another 15 minutes before we could place our order. Around the table we ordered two burritos, one plate of tacos and one quesadilla and guacamole bites (which is basically nachos and guac). \n\nThe guac came out fast, and was quite good, but we then waited for almost forty minutes for our food!\n\nBurritos were a bit bland. Needs some sauce in, or on top. Quesadillas were the same...nothing special. The tacos got favorable reviews, but again, nothing to write home about. \n\nThe back area houses a sort of club-like atmosphere, which is described in blogto as: \"...dark textured walls and ambient lighting, it is the opposite of its cocina counterpart. Records adorn the walls and instruments lay strewn about, giving it a relaxed basement rec-room vibe...July will see live music on Thursdays and Fridays with open jam Tuesdays. Flamenco Saturdays are in the works...\"\n\nWhen we were there (on a Saturday) there was a sign out front for a \"dance party\". The lights were down in the back, with a sort of laser light show and early 90s hip hop music was playing. There were about three, older guys there, just hanging out, drinking. It seemed totally out of place. The music didn't match, certainly wasn't flamenco and that's a weird rec room vibe...if that's even something you would want in a restaurant.\n\nI think this place has potential. People in the area like it and it has a nice vibe to it...or would, had we had better service and less stickiness and washers sitting around. I feel like the space is just not being utilized and that's a shame. \n\nI WOULD have giving this place two stars, but the extra star was a result of the sangria, which is their \"secret recipe\" and were amazing. I had two actually.\n\nAnyway, if I was in the area, I might stop in again, as everything was fine, but I don't think I'll be making any special trips to go there in the future. Don't think I'll be going for any dance parties!","useful":4,"funny":0,"cool":0}
{"review_id":"X9x-P4ocsbC9UkuER4HqUw","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"ILlebFUb89ZozizpVGeHdQ","stars":3,"date":"2013-01-13","text":"Went for lunch with a friend who told me that she has had consistently good food here on prior occasions. \n\nMy first thought though was that the restaurant was freezing cold inside, but the atmosphere was nice and the waitress was lovely.\n\nShe told us the soup of the day, which was potato garlic and said it could be ordered as a side dish. My friend ordered the salad and the soup and I ordered the calamari sandwich and soup as the side. The sandwich had some great aioli on it and the calamari was nicely done, however I wasn't a huge fan of the bun it was in. It had a sort of sweet taste you might enjoy as a french toast, but not with something savoury and some of the calamari was a little tough. THat said, the sauces covered the taste from the bread and the texture was good and overall it was tasty.\n\nThe soup I found to have too much black pepper mixed in. The waitress asked and I mentioned and she brought back a small container with grated parmesan cheese and suggested I mix some in, because it cuts the pepper taste. \n\nShe was right! It really helped the soup. She said she does this with soups here all the time...which I'm not sure if a very complimentary review of the soups.\n\nMy friend said her salad was great and she liked the pepper, but agreed the cheese in the soup made it better. \n\nSo while everything was overall A-Okay, it wasn't fantastic. It's solid though and I would go back and try something else another time.","useful":1,"funny":0,"cool":0}
{"review_id":"1o4W4SenbHBwjY5Nv03Epg","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"R3Cg6XvdBNXXNbEu6M977A","stars":4,"date":"2013-07-21","text":"Nothing says Montreal like Montreal brick-oven cooked pizzas, right?\n\nOkay, well maybe not, but this place was still great!\n\nIt was a complete fluke...some may venture so far as to call it fate...we walked in here off the street, looking for some dinner and decided to give it a go. Perhaps it was angels??\n\nWe ordered two pizzas and split them. One pizza = a good size meal for a person, so we were stuffed and happy at the end.\n\nService was good and pizzas came out fast and fresh from the oven. Nice, crispy crusts and gooey centres. Yummy!\n\nThe waiter accidentally dropped a fork on me when he was taking away our plates and apologized profusely. No biggie....particularly because he was so apologetic. (Let's face it, if someone makes a small mistake, but acts like \"it ain't no thang\" we get a little turned off). \n\nProblems: Well, it's a bit pricey and the tables were set really closely together. It did feel like we were eating dinner with some strangers a bit. But neither of those things would dissuade me from going back here in the future. Bellissimo....as they say in Montreal.","useful":0,"funny":0,"cool":1}
{"review_id":"vCRETL4wQb-fOd-0RBZUkA","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"JPgBO-7imIPdc2XBkvynpQ","stars":4,"date":"2011-03-21","text":"For some reason when I heard the name of this place I was initially turned off. I can't explain exactly why I felt this, but perhaps it added to my pleasure when I found I really liked it! \n\nFirstly, I should mention that the menu is very small. Most of the food has an Italian feel to it (it IS in Little Italy), but that feels a bit strange given the huge martini list. \n\nWe were hungry though, so we ordered dinner and it was honestly pretty good! I'm not sure if this would be my choice if I was JUST looking for dinner out, but not bad if you're feeling lazy, and not wanting to bother going somewhere different for your alcohol and food, like what we were feeling. \n\nThis is a martini bar and so no big surprise, it has a lot of martinis. That said, I shall repeat it...it has a LOT of martinis!! Over 100 different martinis and every one of the ones I tried, I enjoyed. And I tried a good five or something. This may ALSO account for my remembering a good time.\n\nThe service was good too. When I mentioned that I really liked the sauce my pasta came in, the waiter brought me extra sauce in a dish, with bread to dip it in. Weird, but I really enjoyed this...what can I say? I had had like 5-6 martinis! \n\nI would definitely make a trip back again!","useful":3,"funny":0,"cool":2}
{"review_id":"rx0mPXwEkDZcktKgUTD7fw","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"SN0-O-CuIsyZf3LGZVEUAw","stars":1,"date":"2011-11-12","text":"I can't figure out why this place has so many good reviews. That was why we chose to order from this place and it was a BIG mistake. My husband called and placed the order and we got a call back saying they had taken down his credit card number incorrectly. Then they called back a few minutes later because they needed directions to our place. \nWe proceeded to get three more calls from a driver asking us where to go. The confusing thing was that he would ask, but then either carry on a conversation on another phone, or with someone who was with him, instead of listening. Then he would ask for my husband to repeat himself. This happened at least twice every call, for three calls. \n\nTurns out they took the address down completely wrong. Big surprise, considering their listening skills. \n\nWe finally got our food and they had screwed up the order and given us a wrong sushi roll. Either way the sushi was among the worst we have tasted. It was a mixture of bland and salty! Basically it was terrible. \n\nOn a side note, their dragon rolls are actually unagi rolls. Dragon rolls are called dragon rolls (at EVERY other sushi place) because they have avocado on top, making them green. It is very strange that these guys have decided that that's not the way they want to go. \n\nSo yeah, terrible service and bad food...you can bet we won't be bothering with this place again EVER!","useful":2,"funny":2,"cool":0}
{"review_id":"EjBDzwuLHylh4skId6YvuQ","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"UfNTlvEJCOQ7XDRj0LzEtQ","stars":2,"date":"2014-10-17","text":"Small location, with some seating out front. Hard to get into and place order and wait to receive it. Everyone ends up smooshed together and waiting and they certainly take their time. \nI asked if they did flavoured lattes (ex. caramel latte). Nope, they do what they list on their menu. No more. I ordered a regular latte. Nothing special. I have tried a few food items here and nothing was particularly good. I'd take a pass. There are WAY better coffee shops in the mall.","useful":0,"funny":0,"cool":0}
{"review_id":"7hTtvuR6fXf7cgFtHBAVCg","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"pZ1quwXnYozLIZIVABojhw","stars":4,"date":"2013-01-13","text":"This place is a bit of an adventure...at least for me. I've never had charcuterie before and I'm not generally a big meat eater, so this was a little out of the box. That said, I like trying to be adventurous and trying new things, so when are visiting friends suggested we give it a go, we went for it. Dinner service is open at 6pm, so we agreed we'd arrive at 6pm. We got there at about 6:15....there was already a HUGE wait for a table, but we managed to wrangle seats at the bar. \n\nThe four of us ordered a bunch of dishes to split between ourselves. We tried the charcuterie (sort of a platter of assorted sliced meats and pâté), horse tar tar, roasted bone marrow, pork carnitas tacos, tongue on brioche and the foie gras and nutella for dessert. \n\nThe dishes came out staggered, so we got to sit around chatting and enjoying ourselves and our cocktails. The charcuterie came out first. It was assorted sliced meats arranged on a wood plank and served with bread. It was actually really nice. Next was the horse tar tar. This was a stretch for me. I don't generally like to eat animals that I LIKE. The people I was with convinced me to try a small bit and I must say, it tasted pretty good, but on principle, I just have trouble with it. Sorry! I hate being one of those people who doesn't have a problem killing the \"ugly\" animals, but doesn't want the cute ones to die...but I am. \n\nNext was the bone marrow, which was....well let's just say I had to keep telling myself not to think about what I was eating. Basically, it's a big bone and the marrow is of course in the middle and has been cooked so that it's almost the consistency of warm butter...pretty fatty and oily looking. You scoop it out with a spoon and put it on bread. It's actually delicious, but feels like you're eating something you shouldn't, purely for health reasons if nothing else! It feels like eating pure fat....tastes as good I suppose. \n\nWe had the tongue on brioche, which I was only okay with. The tongue was sliced and presented as a sort of Montreal smoked meat. We were told to open it up and eat it like an open faced sandwich. This made it easier to split certainly. The meat itself was very tender and the brioche was great, but the meat had a horseradish (I think) sauce, which was a bit overpowering. \n\nFinally we had the tacos, which was probably the more \"normal\" thing we had. I actually thought those were my favorite. Wish it was one of the more exciting things, but nope. Those tacos were excellent. \n\nThe foie gras with nutella was also delicious. It was served on a banana bread, over a nutella spread...but the fois gras was superflous. It didn't add any taste and was overpowered but the nutella and basically didn't add anything to the dish. Could have been served without. Clearly just added to SAY it was there. \n\nSo what's the overall opinion? Well, the restaurant is too small. It's REALLY small, but popular. Wish it was in a bigger location. Sitting at the bar was kind of interesting, because all the cooking was done behind the bar, but that was a small workspace and it got hot, because the oven, dishwasher, stove top and so forth were always turned up very hight. Impressive how they work in such a space though.\n\nOverall the food was very good. SOMEONE knows what they are doing. However, it is quite a pricey place and as I said, sometimes the flavours overpower the meat, or the meat just isn't even necessary. Sometimes you're paying extra for fancy meat dishes that don't even need the meat, or where you can't TASTE the meat. \n\nThose are the only criticisms, but I wouldn't let that keep you from trying this place...but only if you're willing to go out on a limb a bit and as something different. This isn't a go-to place, but it's a fun place to have gone to! \n\nOh...PS - They don't accept credit cards. Only debit or cash.","useful":0,"funny":0,"cool":0}
{"review_id":"IO4emkaAFZX9R5PNY06h0Q","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"W5d8iNog90R-qw43m5dGwg","stars":5,"date":"2012-10-08","text":"I have been craving schnitzel for a LONG time, so on the night of my birthday, my husband and I decided to come here. Cafe Polonez was in a great little area, with lots of nice, little shops surrounding it and High Park, of course. \n\nThe restaurant is clean and trendy looking and we took a seat, against the wall, in the back. We ordered the platter for two. Since we had never been, it felt like a good idea to try it ALL out. GREAT idea! We were delivered a platter of food that included two schnitzels, two cabbage rolls, 6 perogies and some other sides. Everything was great, but the schnitzel and cabbage rolls in particular were excellent! I ordered two gravies to go with the schnitzel, expecting two, little Swiss Chalet-sized gravies, but instead we got two, huge bowls of gravy. Needless to say, one bowl would have been more than enough for 2 people. They were only $1 apiece, so not the end of the world. \n\nPlenty of food for two people and a great sampler platter to see what they have and what you like.\n\nService was fast and good and everything was excellent. Totally recommend it and I'll be back. Just thinking about it is making me salivate!","useful":2,"funny":0,"cool":0}
{"review_id":"NNgDTI4toB8ikaYHoZvBaA","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"DgE8JqFcYgp2SrjSKb3Gsg","stars":4,"date":"2013-01-27","text":"Had never been to an improv performance and was excited to check this out. Had heard good things, which is why we chose Second City, as opposed to the cheaper Bad Dog Theatre. \n\nI should mention that it was a lot less improv than I expected. I wasn't entirely sure what to expect, but it was basically, short, individual skits, creating a sort of sketch comedy act, as opposed to improv. This isn't a bad thing. I'm a HUGE fan of SNL, but I was say that I probably laughed more consistently during this performance, than your average episode of SNL. This is because of a combination of personal \"current Toronto\" jokes and because that's the way it should be when you have a couple of months to be putting together your next show, as opposed to one week (as with SNL). I would only expect a more refined show. In addition, we came close to the end of this show's run, so the kinks would presumably be figured out and they told us they were testing some of the new material on us, so that was kind of cool! \n\nThe skits were mostly successful, none failed to make us laugh out loud at least once. There were no weak links in terms of the actors, but the stand outs (for me) were a red headed girl and the black guy....sorry I have no names! I can only go by really obvious characteristics. \n\nWe stuck around after, as they did a little bit of actual improv and another skit, which seemed like an idea they were trying to hash out a little more. Well worth the sticking around even later for!\n\nWhy the lack of one star? Well those pictures down below don't really accurately describe what this place looks like when it's full of people. The chairs are small, there is no coat check and you're all crammed around a very small table. Your coats end up...wherever basically. \n\nProbably because I booked the tickets on the Wednesday before (I'm not sure how they determine seats...it's not first come, first served and it's not on your ticket...that I could see), we originally ended up in a back corner, on high bar stools. My skirt made it so that I kept sliding off the seat! I asked if there was any way we could be moved into regular seats, but the only thing left (and this is how I know seats are prearranged, because there were tonnes of empty seats all around at that time), were right in the front, next to the stage, but to the far side. From this angle, you can't see everything, but we enjoyed it more being right up, near the action. \n\nThat said, it was still VERY crowded and uncomfortable. Tickets are $30 each (here is a tip...it's a little less if you have a CAA membership and order through them), so that's pretty pricey. The show makes it worth it, it truly does. The seating takes away from it. \n\nBUT you can order drinks, which we did and that make just about anything better, so hey! \n\nAt the end of the day, I'll just make sure I wear pants next time and order tickets further in advance and either way it won't stop me from checking out another performance. It's worth a night of non-stop laughter.","useful":0,"funny":0,"cool":0}
{"review_id":"t4oXDPN4S4USIhBGpuSD8A","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"2LZGeJy8qByYKB71ML-jcw","stars":2,"date":"2012-08-23","text":"We got a coupon to eat here when we checked in: $6.99 for breakfast and a second one for half, or free, or something to that effect. We went and had our breakfasts, which was served by a rather surely waitress and was average. If this had been our only experience, I would have given three stars, but another night we got in very late and were just looking for a late dinner and found ourselves at this place.\nIt was not very crowded, but was as loud as if three times as many people were there. There was a small group of trashy (very obese people), scream\/singing karaoke on a stage in the front of the restaurant. One of them was singing Eminem and the others were screaming and cheering. We sat down in the back, to try and avoid the chaos, but it was way too disruptive. Other people sitting there, who were in the middle of their dinners and therefore stuck there, were looking pained. We didn't bother putting ourselves through this and left. It's a crappy menu, that's overpriced anyway.\nI guess Rock and Rita's name really says it all, but basically if you're not a fall-down, cheap drunk, I don't think you'll have much to say about this place.","useful":2,"funny":1,"cool":0}
{"review_id":"UY07ayU--LHFCrkmPaFD5Q","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"DbTpQB1BSi76naw2aHXouQ","stars":4,"date":"2016-10-17","text":"Great little place, one of my favs in the area (which happens to have a number of fish and chip places actually). Why? Well for starters, the gentleman who owns the establishment is lovely and personable. I think their portions are large and the fish to be yummy and not too bland, or overly breaded. I also really like that they make their OWN tartar sauce. So few places seem to do this. You get like 1-2 of those little packets. \nOne star off for having to buy the tartar sauce separately, and for it being rather small portions. I KNOW tartar sauce is not that premium of an item...why does no one include it in the price, or at least give a nice, proper portion? Such a small thing to make a big difference.\nThat said, this is my first choice in the area. Would be interested in trying their pork souvlaki, but when you're going to the fish and chips place...it's sort of a given to get the fish and chips.","useful":0,"funny":0,"cool":0}
{"review_id":"6VWCmLOtkVS68WfL5BnMxg","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"hZuRyS8IXXuEQkUCas9O1Q","stars":4,"date":"2013-02-24","text":"Went with my friend, who told me she really likes this place and gets their takeout every Friday. Seemed like a safe bet...and it was! \n\nI'm a little confused by the earlier reviews...well...I'm confused by ONE earlier review. But then again, not really, because some people are...well...the way they are! Whatcha gonna do??\n\nAs with traditional Italian restaurants (both in the city AND in Italy), the waiters do not coddle you. \n\nAnyway, the service was great. We had a very attentive waiter. He asked us where we would prefer to sit and we chose a seat for two, but the window. \n\nThe menu is extensive, with a lot of choice. I was debating between a couple of dishes, so my friend suggested we order two things and share. She ordered a pasta dish and I ordered a pizza. \n\nWhile we waited for the main course, we were given a basket and soft bread and oil and vinegar...mmmmmmmm....\n\nOur food came out and both dishes were DELICIOUS! The pasta was great, the sauce was especially good. The pizza had mozzarella and goat cheese and veggies...goat cheese on pizza = perfecto! \n\nWe had leftovers....and then we decided to hell with self control and ate them. \n\nNeedless to say, we were too stuffed for dessert. Shame, because they looked very good.\n\nTurns out that this is not the first time I have had food from here. The same friend, used these guys to cater a party she had. She had some large trays of pasta and I remember really enjoying them...you know, as far as catered food goes (to please everyone, they had gotten pastas on the plainer side). \n\nI think this is a good, solid place. Prices are what you would expect for the food and area.\n\nWhy missing one star? I've still had better Italian in the city....I'm picky enough that I need to be REALLY blown away to award 5 stars. \n\nThat doesn't mean this isn't a good place, worth checking out though!","useful":8,"funny":0,"cool":0}
{"review_id":"S0zj-QZbrbPmfBxpNCUaqA","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"lFPNibSaYC3Vq4PCGaps_w","stars":3,"date":"2011-04-03","text":"This is a newer location of the breakfast\/brunch chain Eggsmart. It has the same, basic, breakfast foods and nice, big breakfast combos. We started going to this location a few months back when we realized it was open and go every once and awhile. We've always had pretty consistent service and the food as been as good as one expects from this type of place. I usually get their two eggs combo with bacon and toast and I like it because it's basic. Prices are pretty good (although your non-chain greasy spoon will likely have comparable for cheaper). Today I had the spinach and feta cheese omelet and wasn't a fan. Too much feta was rolled up in the omelet and it was all your could taste. Will go with my basic again next time.","useful":0,"funny":0,"cool":0}
{"review_id":"Nr4t4NobdlKx9HLMlcts5A","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"qOuoI7hvzBAzF1Y43J7yKQ","stars":4,"date":"2016-12-18","text":"Been here twice now. Always go with my parents when they come to visit. Nothing particularly special about this place and I find some prices fine, while others on the expensive side (their salads are very expensive and they don't include a protein which is a considerable amount more, for example), and I find their tables are very low (weird, but annoying when trying to eat some things...like my soup), but the food has been consistently good, as has the service and the atmosphere nice. Wish they had more in terms of a kids menu, but we'll be back.","useful":0,"funny":0,"cool":0}
{"review_id":"f7hYSPdl7yD0qhQTWdp7tg","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"tOhRQqiupLyJdBJVQMGOEQ","stars":3,"date":"2013-07-15","text":"Listen, these bagels are good...very good, but they didn't blow me away. In fact, I thought the \"everything\" bagel and the garlic bagels were downright disgusting. No, like inedible disgusting. The best ones were the basic, plain ones (for me). \n\nAnyway, it was a fun place to go to and pick up a snack. Not a great place to get drinks to go with the snack, since they only seem to sell whole cartons of juice. \n\nGlad I tried it, would try it again, but probably wouldn't go out of my way to do so. \n\nBUT that's me...people seem to be die hard Montreal bagel fans and if that's you, I think you hold this place in much higher esteem! All the power to ya!","useful":1,"funny":0,"cool":0}
{"review_id":"UT22FHlgZzznMy9Fmx5baQ","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"V0uhdzIzLXzEaNl4Up8MJA","stars":2,"date":"2011-05-06","text":"Since I really needed my nails done and this place was in the mall, I went there. I had been before and it was an okay job, so I pretty much use this place as a convenience method. If I must, I must!\n\nOne girl did my toenails and did a nice job, although I loved the colour and the sticker at the bottom of it was missing, so I have no idea what colour I am wearing, should I want to use it again.\n\nThe woman doing my nails wasn't as good as the woman doing my toes though. First of all she kept making comments about how small my nails are. I'm an art teacher, so having long nails is really not to my benefit, but thanks for bringing this up constantly! She was also a bit rough. She blamed it on my fingers being tensed, but honestly, they were tense because it hurt! It started becoming a vicious circle!\n\nI think that the amount of gel she put on was WAY too much. Some nails you can see the dip made in the gel. Also, I have only had them a week and I feel like they can be easily ripped off. Things keep getting caught in the edges.\n\nThe colour is nice and there was a good selection of colours to choose from, but as I stated before, if you really need something done, here is great, because it's HERE, not because of what a great job they do!","useful":6,"funny":1,"cool":1}
{"review_id":"Bgxea63eCBYMgCwkTvn1UA","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"colkiB9memBWXIRGw8C9MQ","stars":3,"date":"2013-07-15","text":"I mean, I'm an art lover, so I love checking out the different art in different cities. This was pretty basic, with a combination of a few, small pieces from the late 1800s - early 1900s, but more famous artists and a large selection of more modern art, some of which was interesting. The First Nation's art collection was surprisingly small and not much stood out to me as being really breathtaking. But honestly, I feel that way about the AGO and the National Gallery in Ottawa, unless they are having a special exhibit, so you know...hey, that's Canadian galleries I guess...especially after you get spoiled looking in the galleries in London, Paris and Rome! It is what it is! \nThat said, it's still worth checking out if you like art...and maybe even if you don't, because it is FREE baby!","useful":0,"funny":0,"cool":0}
{"review_id":"25UFzvuuSwWhNS7dYPLY-A","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"QePLHlU8MFaU2Sf9dzoLTg","stars":4,"date":"2012-11-24","text":"Okay, I have only ever ordered food from Sushi One, never been to the actual restaurant. I've had pretty mixed service in terms of delivery time, but they usually tell you when you order the approximate time of delivery. \n\nAnyway, ordering aside, we keep ordering from Sushi One because the food is consistently good. \n\nWe have been ordering from them for years and they switched management some time ago (over a year I think at this point). At first we weren't so sure. The food quality sort of lacked, but they've picked it up and I think the food is great again. \n\nYeah, so no complaints. Yummy sushi if you're in the North York area. Win-win!","useful":0,"funny":0,"cool":0}
{"review_id":"-BydgOKSG3VKtGgxltlmCQ","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"zaJkOJU0EtsUyjjP-z59ow","stars":2,"date":"2013-03-06","text":"This place is a huge waste of money. It's close to me and so I would make a point to come once and awhile, when I needed a quick meal and didn't want fast food. But it's the WORST!\n\nYou get a card when you go in...different colour for eating in, or taking out. Then you go around and order your food from different booths and they swipe your order, adding it to the card. If you're eating there, you can sit down with your caf trays, or they will package your food up to go.\n\nYou can get pasta, roast beef and other meats, pizzas. The reason I would go would be for the schnitzel, which is quite good. But they ALWAYS run out. And honestly, NOTHING else here is very good. You can make your own pasta, but it's all very generic tasting and uninspired. \n\nThe prices are NOT good for what you get, but they aren't four $, like what is currently showing below. Nothing close to that. Someone is grossly exaggerating. \n\nThe service has never been particularly good, you have to wait quite a while for the food and the food has never been stellar. So I've stopped going. Not worth it.","useful":3,"funny":1,"cool":2}
{"review_id":"bai7yBbtsPoJAVUDHZggIA","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"Y8c0aPDo9L9Nyo636K8ZRQ","stars":2,"date":"2013-06-01","text":"I was in a big rush, trying to get ready for a night out and needed my nails done, so I popped into here, basically because it was close and they said they could take me right away. \n\nI had never been in before, because the price list was pricey, but decided that given my rush, I would bite the bullet and suck it up.\n\nThe people were all very pleasant. I said I was wearing a purple dress and asked for feedback on colours and they gave good opinions and were very nice. Then I was led into a back rooms, where I was instructed to sit on a padded bench and put my feet in a large, metal bowl of water. THIS was a new one. I have never had to put my feet in a mixing bowl while getting nails done.\n\nThe seat, while padded, was not particularly comfortable and it was awkward getting up on it and off it again. The pedicure was standard with most places I have been.\n\nThe nails were more in keeping with what I was used to, sitting at a nail table. I said I was in a bit of a rush, but she still seemed to really take her time. I didn't push it, because I didn't want to be rude. The nails were fine, but not perfect...some have some bubbling in the polish and others are a bit crooked.\n\nHere's the kicker though...the bill came to $60!! That's almost twice as much as other nail places and it's certainly not a better place in terms of the facilities and job they do! That doesn't even include tip.\n\nThe people in there were all older and seemed to be regulars, so I guess they have a customer base, but I certainly won't be part of that! Even in a rush, this place was just not worth it. There are a number of nail salons popping up in the area as it continues to get built up. They better watch themselves, because with so many other options there is no reason to go here.","useful":3,"funny":1,"cool":1}
{"review_id":"vCkXXMwUsGa1rJdjfm0QrA","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"QJg8AuqITB4t_iKrLI6tOw","stars":4,"date":"2016-10-23","text":"Went here on a bit of a whim...just looked up Italian places in the area...there seems to be a lack of consistent Italian food. This place is very authentic. Part grocery and part restaurant, they have a good selection on meats and cheeses and Italian packaged treats. Unfortunately, when we arrived around 6 on Friday they didn't have much food left. They informed us this was because it was almost close, although close wasn't till 7pm...so I guess this is more of a lunch place. That said they had one veal left and one penne pasta left. We bought them both. My toddler, who hates pasta usually, loved this pasta! And I agree with him. It was delicious. My husband liked the sandwich and I also took a bite and it was yummy.\n\nWe also bought some very expensive gelato, which was good (and apparently no preservatives, all natural, etc) but was very pricey at over $20 for the smallish tub. The sign in front of the gelato said large takeaway tub was $10...my husband paid, or I would have asked for clarification. I didn't know until after we left, so there was some miscommunication somewhere in there.\n\nThe couple were really lovely, gave my son a little chocolate thing for free and chatted with us while we waited. \n\nI will definitely be back, especially to get more pasta, but one star off for running out of food before close and for overpriced gelato.","useful":0,"funny":0,"cool":0}
{"review_id":"-ZvE0XgalcwzaHU92NguQw","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"vUqIE5La92aMJrY8kGgwsw","stars":3,"date":"2016-01-24","text":"I mean, here's the thing....the pizza was really delicious. BUT they do indeed cheap out with the ingredients, as others have said. \n\nWe ordered the Margherita pizza from their \"gourmet\" pizza menu. It describes the pizza as extra virgin olive oil, mozzarella, provolone, tomatoes, basil, parmesan. The pizza was cheesy and delicious...but there was about one tomato per slice of pizza and the basil was the dried, \"spice\" kind that you shake out of a jar, instead of fresh basil. So I mean the ingredients are anything but gourmet. But it was still really yummy, I won't deny. \n\nThe garlic parm bread was like a slightly classier, better crazy bread from Little Caesars. Also good. \n\nI won't hesitate to come back here, but it won't be a go-to. The prices aren't cheap and the ingredients not what I would expect given the prices...and the descriptions.","useful":3,"funny":0,"cool":0}
{"review_id":"Zsij8VGkBt486mAie9cffw","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"wZP0LtxhQspa-VNMz8zuAg","stars":2,"date":"2012-06-18","text":"I like to withhold my reviews before going to a salon a couple of times. I find that sometimes you get great service the first few times and then they bomb completely. This salon was sort of average the first few times and bombed the third. \n\nI decided to go to this place  back in the fall, as I was looking for a new stylist. A girl from work goes to this place and said it was pretty good, so I figured I've give it a try. I went in with some different pictures and asked if I should go lighter with some highlights, or darker. The girl said darker, for no real apparent reason and dyed my hair dark brown. Not a hard job and it was fine. \n\nSecond time I went back I wanted some highlights. A had a different girl this time and she gave me partial highlights and then a wash, which made the highlights barely noticeable. Then, because of the wash, it cost around $150! I thought again, it was fine. \n\nThird time, I wanted something a little more noticeable. I said I specifically wanted my highlights to stand out more this time. I wanted to avoid paying extra, for hardly any change. I brought in pictures and the same girl as last time got to work. \n\nWhen she was finshed I was not impressed with the results. There were very noticeable roots all around my head. Especially if you pulled my hair back from my ears, there were dark strips where the roots were and the highlights began. It was not natural. I complained about the roots, so she proceeded to take big sections of hair and bleach them completely, then rubbed the bleach off with a damp towel. It barely looked different when she had finished, but the store was basically past closed and it was clear she had no idea how to fix this mess anyway. \n\nI had to go and purchase one of those root touch-ups from Shoppers Drug Mart and fix my roots myself. After that, they were alright. Once again it was very expensive.\n\nMy friend has been going with me the last few times and I think she has liked her hair, but I won't be going back. I would have to ask specifically for a new stylist and I just don't want the awkwardness and frankly, I just don't trust anyone there anymore anyway. Once again, the search is on!","useful":5,"funny":0,"cool":1}
{"review_id":"Cra_3aIg82PVNYViqNKKPQ","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"MZ4EEf4VtkeSJURIGgp2AQ","stars":3,"date":"2015-09-26","text":"I wish there was the option to give half stars, because if there was I would give Lemon Bistro 3-1\/2. Overall, our experience was fine and I would probably try it again, but I won't be rushing back. We called to make reservations. I asked for 7 or 7:30 and was told that 7:30 \"would be better\". Assuming that meant 7 was a busy time, we went to the area and were prepared to wander around for a bit...but the restaurant was almost empty, so we went in and were seated promptly. \n\nOur waitress was very friendly and took our orders. I had the mussels and my husband had the salad. Both were good, although the mussels were quite spicy, something I wish was specified before ordering. \n\nMy husband ordered the pork hock and I had the pasta. His dish was prepared very well and the meat very tender and nice. My pasta however was very bland. the pasta noodles were overcooked and fell apart easily, making it hard to twist in my fork. The limited sauce had little flavour. The chicken and mushrooms in the pasta were the best part, but it wasn't enough to make me consider this a \"good\" dish. More like something I would make for myself at home and be only mildly satisfied. \n\nWhen the server gave us our bill, she took away my husband's beer that he was not finished with. We didn't notice until it was too late. \n\nAll this said, I saw other dishes that looked pretty amazing, my husband's food was much better than mine, and despite the beer stealing, the waitress was very nice. The atmosphere made for a nice date spot. \n\nIt's not cheap though, coming to $77 for the two apps, two drinks and two mains. So I was hoping for a little better. I hope if I try this place again it will please me a little more.","useful":1,"funny":0,"cool":0}
{"review_id":"jo_MN9uflkprjNAiCyD33A","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"ugDCPgJUCRuNpHSPsMZwkw","stars":2,"date":"2011-08-17","text":"So, below is is original review, which was accompanies by 4 stars, however I've decided to revise it. \n\nAs I said below, when I went to Moroco, it was expensive, but very delicious for a treat. So I decided that I wanted to have my birthday dessert there. I called up to make a reservation for about 10 people. I was informed that for groups of over ten, there is a requirement that every person spends $48! \n\nI kept the reservation for a day to see how many people were actually going to confirm coming out, but since everyone confirmed, I had to call back and cancel my reservation, because I do not want my guests to be obliged to spend $50 on dessert, after we have already had dinner! The girl on the phone said that it usually worked out, because once people had dessert and a drink, it worked out to be enough. As I said below, let's round up and say dessert is $20...so she's saying their drinks are $28!??! \n\nI have wanted to go to Moroco for my birthday since the summer, but that was before I realized how pretentious they are! No thanks! Chocolate is great there, but only go with a couple of people, otherwise you'll have to pay the price!\n\n* * * * *\n\n(Original reviews: Oh my gosh, this place is to DIE for. It's also crazy expensive! This isn't a \"daily treat during the work day\" place, it's a \"I'm celebrating something and want a very special treat\" place. Deserts are around the $18\/person range.\n\nThat said, the atmosphere was amazing. The place is all in black and white and looks\/feels very trendy. The desserts though....WOW. Amazing! Chocolate fondue that is heavenly! \n\nAnyway, I've decided that this is where I want to go for my birthday dinner. Forget conventional dinner. I want a sampler platter of desserts and no sharing and no judgment!)","useful":0,"funny":0,"cool":0}
{"review_id":"FEPD3vy-eWJb5Q9gtkktuw","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"S5bNE4Pmin8OQUMOFod8bQ","stars":3,"date":"2011-07-17","text":"I actually think this restaurant deserves a 3-1\/2, but that's not possible. The food is good and the atmosphere is good, but it's quite expensive for what you get (especially for drinks) and I found that the service was mediocre. \n\nWe had quite a large group, so we got a variety of pizzas and split them. This was tricky because the pizzas were all divided into four pieces each. Even though we said we were splitting them all, no one seemed to think to split them up a bit more. \n\nThey were also quite slow with the service, especially taking our order initially. \n\nBut, as I said, the pizzas we ordered were very good. Some stranger combinations were a big hit, like the pear pizza, which worked a bit like a dessert. \n\nThe atmosphere is nice, I especially like the basement. So overall if you're looking for a nice night out, I would go for it. If you're looking to just find a good place to eat on a whim, or just because, maybe not.","useful":2,"funny":0,"cool":1}
{"review_id":"h0Y6Bi3otGLbKf-PSexyzw","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"NOekdjvFFtCYTKvLN_XLxg","stars":4,"date":"2011-07-25","text":"I have been going to this salon and spa for years, since it first opened. All of the employees know me and are always so pleasant. Shuku has styled my hair on several occassions (once for a wedding, once for my bridal shower and once for a birthday party). They were all completely different looks and they were all amazing! She has also done my makeup for me and I've never looked better in photos.\n\nMainly I got there for the waxing services and Irene always does a great job and is so friendly. \n\nI took off one star because I always like to get a deal, especially as a repeat customer, so I would love to see loyalty programs or something to that effect more often, because I do think the prices can be a bit steep, but the service is really excellent.","useful":1,"funny":0,"cool":1}
{"review_id":"QeD-3ydihjr4GKjSXq9lyw","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"kkmnzRWOq9mJVpQQzgv-9w","stars":2,"date":"2011-06-17","text":"Okay, I left a perfectly good, little pub because my sister swore that she knew people who got food poisoning from it, to come here...and get food poisoning. \n\nNOW, I just want to state that I cannot CONFIRM that it was this place that gave it to me, but let's just say that I had only eaten finger foods at a bridal shower prior to coming here and shortly after dinner I got sick in the middle of a concert. Super fun AND convenient!\n\nThe service was good and this is why this place got the extra star. The guy was truly nice and the service quite fast. \n\nYou wouldn't think the food would make you sick, because it was very bland.  Tasted like something I could have made myself very easily. I ordered the chicken burrito and I found it was quite dry. THey didn't include any sour cream or guacamole, even on the side, so it was just rice and beans and chicken. \n\nThe atmosphere was cute enough, so perhaps as a place to go after work for drinks, but be wary.","useful":0,"funny":0,"cool":0}
{"review_id":"TaZPNqRUwK47VDE17h2I3g","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"5N8R7ALESZ30EoAzVJtabw","stars":5,"date":"2016-10-17","text":"Went in on a whim and was not disappointed. I had the ODB and my husband had the poutine. Poutine was good...had pulled chicken on it and was tasty, although not entirely unique tasting, but that's fine for this type of place. I had the ODB and it was AMAZE-BALLS! The chicken was a huge portion, on a full waffle. The waffle was the perfect blend of sweetness, with just a bit of syrup and the chicken was crispy and great and so tender it just flaked apart. It had a great sauce on top and the slight kick, blended with the sweetness of the waffle, was a great mix. Portion size was good, food was delicious. Came with a little cup of potato salad...liked the peas, nice touch and the potato salad was a refreshing touch for the whole dish. Still thinking about it hours later....thinking and thinking....*sigh*","useful":0,"funny":0,"cool":0}
{"review_id":"skYDUMR34u_K-dLG402DyA","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"uF86ZhygpBEGr3CudNemYA","stars":3,"date":"2011-11-20","text":"When deciding where to go to Valentine's Day dinner, we decided to try something a little different and have an \"experience\" , instead of just dinner. So we made reservations at O. Noir. Overall, it was a good time and a good laugh. \n\nOne recommendation: Maybe don't wear your BEST clothes to this place, as there is a very really possibility that you will drop food on yourself. \n\nTHE WAY IT WORKS: For those of you who don't know - You enter into a lounge with brick walls and dim lights. You pre-order your meal and can order drinks from the bar there. THen you are introduced to your waiter(ess), who is visually impaired, and are led into a pitch black room and seated at your table. \n\nAnd it IS pitch black. You can't see your hand in front of your face. Your eyes never adjust and there is a sort of entrance way into the room, so you never even get light from the door when someone enters the room. \n\nYou are then served your food and have to go about the task of trying to eat it, while blind. This is a challenge, because you can't see the food and because even when you THINK you've finally speared a veggie, for example, when you bring the fork to your mouth, you realized you've lost it somewhere along the way. Usually into your lap. \n\nThis is DEFINITELY an experience, does an interesting job at raising awareness, but here are my issues with this place: The food was good, but not great. This becomes more apparent when you can't even see the presentation of the food and are reliant entirely on taste. It needs to taste GREAT. This was distinctly forgettable food. \n\nI would have liked to see the room we were in at the end of the meal. YES, I know this would require everyone eating at the same time, no new people entering, but I was a little sketched out about never seeing where I was. Basically, you could be in dirty, dank basement storage room and you'd never know! \n\nFinally, it's very expensive! \n\nI found that I liked it to try once and say I've done it, but it's gimmicky and that doesn't translate well into a place that will become a go-to favorite. Once is enough for me!","useful":2,"funny":0,"cool":0}
{"review_id":"JgJkBLsLBT0oFJh9ffM16A","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"PwO3JDkkY6y9Jty8aXFmsQ","stars":4,"date":"2012-06-18","text":"Okay, let me start by saying that YES I have had Montreal bagels and NYC bagels and they are of course, in a category all of their own. But let's focus on Toronto bagels. \n\nSeveral months ago I had a hankering for bagels. I decided to give What a Bagel a try and was pleased with their prices (exactly $6 for a dozen bagels) and the taste. They were really, very good! Crispy on the outside and soft on the inside, with a variety of flavours to choose from. \n\nBut I had this nagging feeling, because it wasn't a \"traditional Jewish bagel shop\". I swore I wouldn't give a full judgement until I had sampled bagels from Bagel World. Bagel World, which has a few locations in the city, boosts the best bagels IN the city. They also have weird hours though, making it hard to get to on a weeknight.\n\nI finally made it there and grabbed four bagels. My husband and I eagerly sampled the first two...and were VERY disappointed. (See full review under Bagel World). \n\nSOOO What a Bagel wins! Never thought I would be saying that about a major bakery chain!","useful":2,"funny":0,"cool":0}
{"review_id":"MAxkkTNwUpnjoZ4wiWGwAg","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"HZ1nss1kZrSMLSRQEo2vkQ","stars":2,"date":"2012-04-15","text":"We were in the area and absolutely starving and I had a craving for pub fare, so this seemed to fit the bill, especially because it's had a few good reviews, but I found it only so-so. \n\nDecor: Another reviewer mentions that the decor seems to be missing something and I agree. It's boring. The booths had gaps where the seat meets with the wooden bench part that holds the seat part up. Hard to describe, but looks cheap and crappy, like they're broken. Our table was very unbalanced and the waitress came and stuck a coaster under it so it would stop rocking. It's small and very cramped. \n\nFood: Selection was pretty standard pub fare, but a bit on the expensive side. I ordered a chicken curry dish and when they asked if I wanted it to be spicy or mild I asked for it to be mild. Either their mild is just VERY spicy and I would hate to try their actual spicy, or they made a mistake. The curry comes with the chicken in sauce, rice and a sort of fried crisp, which was nice. The rice was bland however...or the spice from the curry killed my tastebuds. \nMy husband chose a burger, which was overall very good, although they charged him two dollars each for bacon and cheese on the burger, which is expensive when your burger is already $15. Not sure the bacon added anything, but the cheese, I'll admit was really good on this burger. \n\nAtmosphere and Service: Service was fine. BUT, since this seems to be a trend...or the gods are intent on making me detest children while eating out, we had another loud, rude child\/negligent parent situation (see post on Malaysian place). Another situation where children were screaming and running around and parents were sitting off, by themselves, ignoring them, while the rest of the people in the restaurant had to suffer. The group of older individuals across from us kept leaning over to make comments to us and the two ladies nearby grumbled under their breath. \n\nOnce again, this was a problem that could easily have been solved by the restaurant. The kids were part of a party and were in a party room, which is adjacent, but separate from the rest of the dining room. This room had doors on it...which CLOSE, but were propped wide open. All the waitress had to do was go and quietly shut the doors. That's it! Problem solved. \n\nWe were getting annoyed and so we didn't bother ordering dessert. Too bad, because they actually looked great. The group across from us ordered a few and were commenting on how good they were.\n\nSo yeah...I actually would have given this pub 2 stars even without the screaming kid, but if the screaming kid had not been a problem, we probably would have stayed for dessert and who knows, maybe these guys would be getting 3+ stars. That said, it just didn't do it for me. Overpriced, for only okay food and poor atmosphere.","useful":2,"funny":1,"cool":0}
{"review_id":"VuN5MT-_Joud-2NnzY6cSg","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"4KHo1LnkM69RtWTDBdG16g","stars":1,"date":"2012-11-11","text":"I am just perplexed by the good reviews of this place. Granted there are only 4 as I am writing this, but still they seemed pretty consistent. \n\nWe have driven by this place a million times and never given it a second glance, but based on the reviews, off we went to give it a try.\n\nFirst impressions were pretty good. We were seated right away in a large booth. The restaurant was clean and modern looking, although covered in Halloween decorations, despite it being November 10. \n\nMenu looked pretty good, with lots of selection. The front of the menu is the desserts, which seem to be why most people come here. But we wanted dinner as well. I ordered the shrimp wonton soup and my husband ordered chicken and mushrooms with rice. \n\nWe both ordered drinks. I ordered a tea and my husband ordered a mango smoothie. \n\nMy drink came out...then my soup came out...neither of my husbands orders came. It took another fifteen minutes for his food to come and his drink came after that! No apologies for the wait. \n\nMy soup was pretty basic. The noodles had no taste and a sticky texture. It was bland overall, but not terrible. My drink was good, but small, given the $6 price tag for a tea. \n\nMy husbands dish was just gross. The chicken were little balls that looked like chicken fetuses. Maybe they were?? Filled with bones, making them very difficult to eat. The taste was bland and salty. \n\nHis drink was good, but the straw didn't reach to the bottom of the glass...which wasn't a glass at all, but a wine decanter. He couldn't reach his drink about half-way through and had to borrow my straw.\n\nWe finished our meals and started waiting...and waiting and waiting. No one had come to check and see how our meals were and we had to flag someone down to clear the dishes. A girl finally came to go it and did so without looking, or asking if there was anything else she could get for us, or if we wanted refills. \n\nWe REALLY wanted to give this place the benefit of the doubt, so we decided to stick it out and order dessert, since it seemed to be what this place was all about. \n\nWe flagged someone down and ordered mixed fruit on a waffle. The presentation of the dish was certainly nice, but it's pretty generic. It's a basic belgian waffle with vanilla ice cream, strawberries, bananas and some melon balls and cool whip whipped cream on top and a sort of Aunt Jemima syrup. \n\nIt was pretty good, but nothing special.\n\nOnce we finished we flagged someone down to get our bill. He said yes and left...and never came back. We saw his give other people bills and get food...he basically completely forgot about us. We waited for 15 minutes. We started looking around to figure out what happened and noticed that the wait staff were just chilling in the back of the restaurant. One girl was staring aimlessly at the ceiling. Two others were holding hands and swinging their arms in time to the music. Two guys were back there chatting away...it was actually weird. \n\nFinally, we managed to flag down yet a DIFFERENT waitress...this was number 6 (one seated us, one took our order, one cleared the dishes, one took the dessert order and one went to get our bill...apparently, and now this one) and asked her to get our bill. She finally did. We paid...we left a tip (we try hard not be be jerks, even if the service is poor) and left...never to return. \n\nSo yeah, bland food, generic desserts and TERRIBLE service = not worth it. \n\nOne another note, another review says, \"If you're into young asian girls (and guys), this is the place to hang out.\" I KNOW this person meant nothing by this comment, but I swear there is some creepy dude who has done a Google search of \"Places where young Asian girls and boys hang out\" and found this place based on that review...so you know...probably some creepers hanging around as well. Just sayin'! (*Note: This comment, as creepy as it was, had no baring on my review).","useful":1,"funny":3,"cool":1}
{"review_id":"tOJaZ3GOvNs2iD0VXDps5A","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"r6_2abTropXGthCyP_aUXg","stars":4,"date":"2012-12-21","text":"I am a teacher and this is where we go to rent our lights and other equipement we need, from time to time, for school events. I have rented from them before, but never gone to actually pick things up before. I found the staff friendly, knowledgeable and their prices reasonable.\nMy only criticism would be that the area for renting equipment is small and shabby and they (for some unknown reason) had to get our rental approved by management, I guess because we're a school, even though we're in the system and have rented many times before. We had to wait to get in touch with someone on the phone. It was annoying and seemed unnecessary. Obviously it's some weird policy, so I don't blame the workers or anything.\n\nReturning was nice and quick!","useful":0,"funny":0,"cool":1}
{"review_id":"QXJN5zn3HmnW7mGKXgeQ0Q","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"RWYQMss0RzbtDGGwRI3iaQ","stars":4,"date":"2011-03-21","text":"Well, from what I can see from other peoples' reviews, this place has been getting a bad rap because of service. Since I have been several times and never had a bad experience, I can only give my review of this place based on what I have experienced. \n\nThat said, it seems like so many people have experienced bad service, that even I am wary of this place now. I have never been during \"peak\" hours, which may account for more attentive service.\n\nAs mentioned, I have been to this restaurant several times and really enjoyed myself. I love Mexican food and there doesn't seem to be enough good Mexican restaurants around, so I get excited when I find one with food I enjoy.\n\nI have had their nachos, two types of tacos and a burrito at this place and enjoyed all of them. When I went with a girlfriend, we were advised to get two taco plates and share them, since they give you a few, small tacos on each plate. We did this and really enjoyed both dishes. \n\nThe nachos were also great, having been piled high with toppings, not just your grated cheese and some tomatoes. \n\nDrinks were also good. I guess my one criticism would be the price, which I do think is a little high given that Mexican food is quite cheap to produce. I am guessing that the extra cost goes towards the atmosphere, which is trendy...but I gave this same review to another Mexican restaurant I went to in Florida and it looked like someone's kitchen, so I guess it's all in the eye of the beholder.","useful":2,"funny":0,"cool":2}
{"review_id":"gNrSI1t_t1mfCheWcls5mQ","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"54_git0HB9xRH9o4FCPFfQ","stars":5,"date":"2013-07-15","text":"On Sunday morning we went and got Montreal bagels and then walked to this park...it's a bit of a hike, but the weather was nice...to see the tam-tams!\nMy sister had really hyped the tam-tams to me, so I went in a bit skeptical....but she was right! \n\nI can't really explain why this was so fantastic, especially because really it's a bit ridiculous. \n\nThis is a big park and I don't know it well enough to direct people to where exactly you need to go, but by the large monument (the one featured on the picture for this attraction), you will find a group of drummers that set up here every Sunday. Depending on the day, there may be more, or less. Apparently the group can get pretty huge, but either way, they all gather around in a sort of circle...and drum! \n\nThe environment is very \"come-as-you-are\" (read: hippy), but it's such a laid back and accepting atmosphere. The drummers just sort of jam together, playing all sorts of different types of drums and bongos. People go and dance in the middle...kids go and pound on the drums...lots of people get high! \n\nEven not high, this is a pretty fun thing to watch. It's mesmerizing somehow. Again, I can't explain what made this so great. We just sat back in the beautiful weather, snacked on our bagels and watched the craziness unfold around us. \n\nIt was so unique and so weird....but so musical...it was just cool to be a part of it!","useful":1,"funny":0,"cool":2}
{"review_id":"OBu76cKovAFfaaRxKQpDDQ","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"NOz8W_cUV3Dw5yLgFkKLGw","stars":4,"date":"2012-04-15","text":"This place does burgers. It does them lots and it does them well. And it does them in about a million combos. Try something different. Just go for it. You will be pleasantly surprised. If you're not...please don't blame me!\n\nNothing crazy to report. Food was good, service was good. Yum.","useful":0,"funny":0,"cool":0}
{"review_id":"13bbzJNpepRjlBrYdEd4Ig","user_id":"nOTl4aPC4tKHK35T3bNauQ","business_id":"pvCcrHFAGCml492qoQBsQg","stars":4,"date":"2013-08-28","text":"WHY is this place not closer to me?? Actually, it's better that it's not. I would get truly obese if it were, because my new diet would consist of fried dough, sauce and cheese.\nMy husband and myself went to Sail and were looking for a place to pick up some dinner...just grab and go, since I had no groceries at home...but also didn't have the energy to go grocery shopping. I lay in a hammock (I was in Sail, what else would I do?) I researched places to get sandwiches in the area and this place came up and had good reviews. I mentioned to my husband as we were checking out and the check out guy said, \"There is this good place nearby named Ricci's.\" That sealed the deal. Off we went.\n\nThe outside is hardly something to look at. The sign is faded and dirty and it looks, outside, like it's a dive. We went in a saw a modestly busy place, clean and a HUGE menu. You can eat in (seating is limited and similar to fast food seating), can get delivery, or get take out. \n\nThe menu is extensive, with pasta, pizza and panzerotti. We went with what many people were raving about online and got panzerotti...fried ones. OH GOD HEART ATTACK. We also got the rice balls.\n\nOkay, rice balls first: Lightly breaded, gooey cheese on the inside and sauce for dipping them in....SO GOOD.\n\nThe panzerotti...well this is where they lose one star...not on the food itself, but because they messed up our order. One order was covered in a sheet of wax paper with the toppings listed on the inside...it was mine. But after a few bites I noticed, I was actually eating my husband's. We switched and then i noticed there were no toppings in mine at all! Just cheese and sauce. So they were mislabelled AND the order was messed up. \n\nBut OH LORDY, was that a great panzerotti anyway. Just melt in your mouth awesome....and that's after a 30 minute drive home! \n\nI called up Ricci's and explained what happened and said I was too far away to come in again or to have something delivered and they gave me a credit for the panzerotti. The girl on the phone apologized and was very polite. So they fixed the problem to the best of their ability and it was amazingly delicious. Next time if I go back and the order it great...and not messed up, I think I'll have to bump these guys up another star! \n\nOhhhh man, get me BACK there!","useful":1,"funny":1,"cool":0}
{"review_id":"isGkB9diabUw4YUuTs-wNg","user_id":"PWKrsnhlNUN6_oMaQAIajQ","business_id":"wjW6YN9s-iDq7l9PcUsPZw","stars":5,"date":"2014-01-16","text":"An awesome place to eat. They are always very friendly and accommodating! If your hungry for desert you can have fresh ice cream from their attached ice cream shop. My family loves this place!!!","useful":0,"funny":0,"cool":0}
{"review_id":"cHHW5c_HI4fN0_LzWOO0BQ","user_id":"6cYXyJE-qAR0injjjEcHfA","business_id":"dA-8GCVKxUuyA8IdhQQp6w","stars":5,"date":"2017-06-27","text":"Arti was fabulous and his designs spoke to my flair for bright colors and soft flowing feminine fabrics.  I'm a student of Dance and I was elated to see so many clothes that accentuate the artful gracefulness of movement. To top it off, the music playing softly in the background titillated my senses for the beautiful art of dance and everything beautiful.  \n\nIt was a beautiful experience meeting Arti and shopping at Vasari!!!!","useful":0,"funny":0,"cool":0}
{"review_id":"423YyWSUKTfDrgl70p585w","user_id":"6cYXyJE-qAR0injjjEcHfA","business_id":"o_RlSv2vCeUxUuByv7TX7A","stars":5,"date":"2016-05-20","text":"I called 1st Call Garage Doors to repair my garage door that had suddenly stopped responding to the remote control.  Ryan answered the phone politely and listened intently as I tried to explain my garage door issue. I also expressed that I had an urgent need to have the door repaired within 4 hours (before noon). Ryan arrived promptly before noon, quickly assessed the issue, quoted repair options and prices, and got the job well within my schedule. Ryan's responsiveness, professionalism, and expertise minimized interruption to my workday and quickly alleviated my worries over the unexpected garage door issue.  I highly recommend Ryan and 1st Call Garage Doors and will contact them for any future garage needs.","useful":1,"funny":0,"cool":0}
{"review_id":"lDhAa8TLtF4lhGVHL8kYFw","user_id":"G7RzOnERzSWJXPCvreXzBA","business_id":"6eaQfA4WDBhZ-YNGeJfDeg","stars":5,"date":"2015-01-18","text":"Excellent \nJe recommande les yeux fermés\nUne belle expérience à découvrir et partager\nBonne bouffe et et accueil WOW!","useful":0,"funny":0,"cool":0}
{"review_id":"R9w7GeMX_KZTV23gmI8Zjg","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"RhV7sraRUB3km-gF-tmDow","stars":3,"date":"2013-02-06","text":"I've eaten here numerous times and am still amazed how popular these places are. It must be because they're open 24 hours and late at night it's one of the few places you can get something to eat fast. That's the only reason I eat here.\n\nThe good is soso. It fills you up but as far as being flavorful it leaves a lot to be desired.\n\nI'm sure I'll visit again. It serves a purpose.","useful":0,"funny":0,"cool":0}
{"review_id":"A8JR77dMCrnymyMhPQE7Qw","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"kEC675O6YwRH30ImVxBCCA","stars":4,"date":"2017-02-16","text":"I'm new to the area and stopped in here a few days ago to pick up a coffee maker.\nThis has got to be one of the largest Walmarts I've been to.\nIt looks to me like this place has everything.\nAlthough very busy, like most Walmarts, it wasn't as busy as many I've seen. \nBeing the short tempered guy I am I was able to get in and hot before my blood pressure had risen too much.\nIt also seemed the clientele was a notch or two above some of the other locations I've visited.","useful":0,"funny":0,"cool":0}
{"review_id":"cIHJappRyy0idzVyQ3i3Kw","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"A37JfEzlKQygyzA-5p2dWw","stars":4,"date":"2013-07-17","text":"I love the ABC Stores. I'm a long time resident of Vegas and have worked on the strip for years. ABC is a great place to buy an inexpensive snack or drink.\n\nThe only bad part is that the lines are often very long, They usually move quick though.","useful":1,"funny":0,"cool":1}
{"review_id":"6Gd8tlhutYDMifKEzCvHyw","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"07F0eE_JHkH4Op0vpR_v4A","stars":2,"date":"2013-05-09","text":"I lived in this neighborhood a number of years ago and can assure you this isn't a park you'd want to visit with your kids or even by yourself late at night.\n\nAny evening of the week you can find homeless people living around the park as well as people dealing drugs.\n\nThey did have softball tournaments here quite regularly. If you're coming here as part of a large group you probably won't have any problems with the riff raff that likes to hang around here. But as far as visiting it for a leisurely stroll or a quite picnic I'd definitely look elsewhere.","useful":2,"funny":0,"cool":0}
{"review_id":"cmkmbCKmQOMkl3BEov6K3g","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"eAc9Vd6loOgRQolMXQt6FA","stars":4,"date":"2014-05-26","text":"I've been in this hotel many times. This place is much easier to get to than some if the other hotels as it sets at the extreme south end of the strip.\n\nPlenty of parking here. They also have a great concert venue at this hotel.","useful":0,"funny":0,"cool":0}
{"review_id":"oncT7W70CFwzzJkQoz3T5Q","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"NaZVUOzqk5b-l0mlki-9Og","stars":4,"date":"2017-02-10","text":"We stopped in here for lunch this afternoon. Staff was helpful and friendly. Food was good and you get a lot for the price. We noted that they deliver and since we live close by we'll probably order from them in the future.","useful":2,"funny":0,"cool":0}
{"review_id":"9dWoAJGcJHWscv2ZAdzkNg","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"tJzf6H1dkuUbL-t8bzL3dw","stars":5,"date":"2014-04-27","text":"I was looking for a nice place to take the family to dinner last night. After reading the reviews and looking at the photos I settled on this place. Great choice!\n\nThe ambience was perfect. Nice and quite so you don't have to talk loud so your guests can hear you.\n\nI was really surprised that on a Saturday night this place only had a few other tables with diners. You'd think a place like this would be packed.\n\nThe service is what really made this place great for me. I would rate this place in the top two or three restaurants I've ever eaten in as far as service goes.\n\nThe food was good to. Everyone in my party  of 6 enjoyed their meals. I personally would rate my steak a 4 out of 5. But with the kind of service you get here I didn't mind.\n\nThe total bill came to 274 and change for a party of 6. That includes one bottle of wine and a couple of other mixed drinks. So really not a bad price for a place like this.\n\nIf you're looking for a romantic place to take a date or just a nice quiet place to dine I would highly recommend Carve!","useful":0,"funny":0,"cool":0}
{"review_id":"ZGlUf9noms8FQ67rmTZSdA","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"FtaTjyMUIY457tPJahjg1A","stars":4,"date":"2014-04-25","text":"We stopped by here for lunch this afternoon. The place was packed.\n\nI thought we'd have a long wait, but we were shown to a booth in just a few minutes.\n\nThe hostess and our waitress were both very friendly. I appreciated them taking the extra effort to stay friendly when it was crazy busy like that. I deal with the public on a daily basis and know when it's super busy like that it can sometimes be a challenge to keep a smile on your face and a kind word on your lips.\n\nAll of our meals were excellent. If I'm ever in the neighborhood I'd definitely eat here again.","useful":0,"funny":0,"cool":0}
{"review_id":"h4wquP4YxCYcX_NMvgM9QA","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"ZV3G2LxpLLuZOFbn208Z5A","stars":3,"date":"2017-02-15","text":"I've lived in Las Vegas nearly 40 years. I remember when this sign was way out on the end of the strip with nothing around it.\n\nI roll my eyes now when I drive by and see the crowds taking photos with it. Actually I roll my eyes at most tourist who visit the Las Vegas strip. \n\nThere is so much more beauty to Las Vegas other than the Las Vegas strip. \n\nBut I suppose if it's your first visit to our city then this is probably a must have photo. But please do a little research and get yourself off the strip and see some really amazing sights.","useful":0,"funny":0,"cool":0}
{"review_id":"3YpTbDtxrFy4agErrKRe3Q","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"i8hkzA5eiUXgbPjN8vK3rQ","stars":4,"date":"2015-09-26","text":"Recently had dinner here with my family and really enjoyed the experience. \n\nThe staff was friendly and attentive. The food was great.\n\nAlso I was surprised that gratuity is included in your bill. I found it a little pretentious that they automatically assume they deserve a tip.","useful":0,"funny":0,"cool":1}
{"review_id":"pcszB9oTZE2DNylbbXIZAg","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"yLiaMaJFq03JxXPk4puloQ","stars":3,"date":"2017-04-20","text":"I've stopped in here several times. It's always busy but they seem to move along at a decent speed.\n\nAs with all fast food joints nowadays be sure to check your bag before you go as there's a 50\/50 chance they won't get your order right.\n\nThey've got one of those new machines inside where you can place your order. Thanks but no thanks. I'd rather place my order with an old fashioned human being.","useful":1,"funny":2,"cool":1}
{"review_id":"ZDMj4LnkO26QtM-CDtV94w","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"m-_IOYAreUyy_uyK9U3niQ","stars":5,"date":"2013-02-03","text":"It's been a few years since I've hiked this trail but I remember having a blast on it. \nIt was well defined and easy to follow all the way to the top.\n\nI seem to recall the hike was about 6 miles round trip with about 2000 ft of elevation gain.\n\nHere's a link with good directions to get to the trail head http:\/\/www.meetup.com\/VegasHikers\/events\/8905143\/\n\nThis is not an easy hike and you'll want to make sure you're in decent shape. You'll enjoy this hike more in the cooler months as there is not shade anywhere on the trail. Doing this in the middle of summer could be a killer.","useful":3,"funny":1,"cool":1}
{"review_id":"8yfmu2iAagShVXJUGVTELw","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"6zry3kyGHiplbQ4rdqxbaQ","stars":4,"date":"2013-07-17","text":"This is a challenging hike to one of the most prominent peaks in the Red Rock Canyon area. \n\nYou'll wanna be in half way decent shape if you're gonna go for this peak as it's a real work out. But the views are well worth it.","useful":0,"funny":0,"cool":0}
{"review_id":"uIhK5rQ5FoUqIV2z_9TyWA","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"ZibmYdOPKLlqDM9oR6xzOA","stars":2,"date":"2013-04-01","text":"I live very near this place and have been curious to try it for sometime now as it always seems busy.\n\nWell my curiosity has been satisfied and I'm sure I'll never feel the need to visit this place again.\n\nIt struck me as a typical trendy place that yuppies feel they need to visit as all the other yuppies do.  \n\"Oh the food is sooo good!!\"\n\"Really? You've eaten there?\"\n\"No. But all my yuppy friends have and they say it's good so it must be.\"\n\nI only give it a two because the service and presentation of the food was decent.\n\nWe ordered something called oxtail fries which were horrible. I'm sure an actual oxtail would probably have been tastier.\n\nMy girlfriend and I each ordered a different burger so we could sample each others. Sorry I can't remember what they were called but we didn't care for either one. The best compliment I could pay them is to say they were at least edible.\n\nSo as mentioned the service was decent and the food looked presentable but as far as taste I can't recommend this place. \n\nPerhaps it's just me. Maybe the asian fusion just isn't my type of food. \n\nI'd rather have a Wendys burger over this place.","useful":5,"funny":3,"cool":2}
{"review_id":"bcHKbijnCQfOQfMEqs3h1g","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"7_F6dA9xh2lydTtr1LCtIQ","stars":2,"date":"2013-01-23","text":"I live very close to this place and when I need a bit to eat late at night I've occasionally been forced to visit here.\n\nThis is consistently one of the slowest drive thrus I've ever been to. \nConsistent lack luster service.\n\nBe sure to check your bag before you drive away as there's always a 50\/50 chance they'll get your order wrong.\n\nMy advice is avoid this place if you can. Unfortunately I'll probably eat here again as it's right across the street from me and there's few other choices in the wee hours of the morning.","useful":0,"funny":0,"cool":0}
{"review_id":"HaIBF7a1HjFT-gOIlmSIdQ","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"b3z314J6wktaNVblxumiug","stars":5,"date":"2014-07-18","text":"This is one if my favorite trails in the Redrock canyon area.\n\nBe sure to visit the waterfall when you're out there. The water flows to some degree most if the year although in the summer months it slows to a trickle.","useful":0,"funny":0,"cool":0}
{"review_id":"lFmz61DNRzBPnrwH_cF42g","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"J0KZR0DDnvj73D-xmbh4uA","stars":4,"date":"2017-06-15","text":"I stopped in here recently as I had to buy a torque wrench. The staff were pleasant and helpful. \n\nThey saved me quite a bit of money by letting me know I could rent the tool and didn't have to buy it.","useful":1,"funny":0,"cool":0}
{"review_id":"qOkKKBgIvpg3xzxJitCoCQ","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"Trbt0Ex85yvwT8DHoEFCvg","stars":1,"date":"2017-10-11","text":"Ordered food to go from here.\n\nThey send you an email telling you your food is ready to be picked up.\n\nI arrived to pick up my order. I was told that it was not ready and that it was still in the back.\n\nI asked if I would receive another email when it was ready to be picked up. I was told that I wouldn't be sent another email.\n\nThe woman looked at me and said \"I don't know what to tell you.\"\n\nI told them to just refund me my money. I also emailed them telling them the same thing.\n\nBut they went ahead and charged me anyway..\n\nStay away from this place. They have no customer service. And steal from you.","useful":2,"funny":1,"cool":0}
{"review_id":"zfHtu9CnaOwa2FqM07YWDA","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"94BEy7wGKmrOC7sjSHMisw","stars":4,"date":"2013-05-09","text":"When I'm looking for a nice quiet drink in a clean bar this is always the place I choose. \n\nThis is a place that I'd refer to as a bar for adults as opposed to those places where all those kids hang out.\n\nChances are you're not going to find a bunch of kids acting like they're having there first beer. If someone decides to have a shot you wont have to listen to all there friends yelling \"Shot, Shot, Shot, Shot\"\n\nGood food, clean, good service. A class place!","useful":3,"funny":3,"cool":1}
{"review_id":"LqPXuVhJvpBsm2rKO9Z--Q","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"hMYqz6Nn1ZIlYBZm1NYp8Q","stars":4,"date":"2013-05-09","text":"I often stop here for my coffee on the way into work and to get gas. Service is usually fast and friendly. They have a fairly regular staff here who all know what they're doing.","useful":1,"funny":0,"cool":0}
{"review_id":"5wQVO4Of5LaDP68VgOfuOw","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"xw6G0T2VQZAtta6RcZoAOQ","stars":3,"date":"2013-01-23","text":"I've eaten here several times and it serves its purpose.\n\nSatisfying food, quick service, friendly enough staff and seemed clean to me.\n\nWhen I'm in need of a quick Mexican food fix I'd hit this place again.","useful":0,"funny":0,"cool":0}
{"review_id":"omeEOyfOU4uozM3cSgn0IA","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"jozzH4XCEM9yQFjLAc3_zA","stars":5,"date":"2013-02-03","text":"An old fashion candy store! What's not to like.\n\nI've been in here several times and have made several purchases. Even if you don't buy anything it's fun to look around.\n\nI won't buy the corn or bacon soda again but it was still fun to try such a product.","useful":0,"funny":1,"cool":0}
{"review_id":"jxBjqa11fSscuydRriDgWA","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"XBcy5493AsrFs0KyWvUh0Q","stars":3,"date":"2013-04-24","text":"This place is right across the street from my place so I've been here a few times. It shares a building with a Subway sandwich shop so you can get yourself a fairly healthy sandwich and ruin the meal by topping it off with a few donuts. LOL\n\nThey do seem to be short staffed every time I've been here there's only one person working in the back by himself. The Subway staff usually holler at him for me to get his attention.\n\nOther than that it's Winchell's my favorite doughnuts. You'd have to really annoy me to make me not like Winchell's.\n\nIt's also open 24 hours a day. So when that sweet tooth strikes I don't have far to go.","useful":0,"funny":0,"cool":0}
{"review_id":"9FBJodq4YITKLSGwYHDl1Q","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"YpNCrt2l7TEsZvUWMr72sQ","stars":5,"date":"2013-05-15","text":"I've often used this mountain as a quick workout as it's not far from where I live. \n\nYou can find all the details of the hike at http:\/\/www.birdandhike.com\/Hike\/Other_Areas\/Lone_Mt\/_Lone_Mt.htm\n\nIt's a steep 600 foot climb. Hiking poles would come in handy as there are some really steep spots where it's easy to slip on loose rocks. \n\nThe climb up is not too dangerous. Most slips will only result in scratches and bruises but watch your step at the summit. The top is very narrow a slip here could be disastrous. \n\nMake sure you bring plenty of water. I'd avoid hiking this in the summer as there is absolutely no shade any where.","useful":5,"funny":0,"cool":2}
{"review_id":"BtusuryKgaJ5ljO1JWiS9g","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"T8-8C1C7QwxzZcMGK_8H4A","stars":3,"date":"2013-04-22","text":"A few of us from our company had lunch here today. We had planned on eating at the buffet,  but were informed it was an hour and a half wait,  so we opted for the Hash House.\n\nI had the small order of chicken and waffles. This was the first time I've tried this combination of sweet and salty. I've seen chicken and waffles reviewed on different food shows and it looked interesting. Apparently it's a popular item down south.\n\nI found it good and I'd order it again. \n\nOne of my companions had the meatloaf and he said it was awesome!\n\nI did notice other patrons food orders were very large. So you apparently get your moneys worth here and the prices seemed good as well. Most items on the menu seemed to be around ten dollars.\n\nMy one complained was that it was quite a long wait to get our food.\n\nAlthough I wasn't really wowed by this place I did find the food satisfactory and the prices were excellent. The staff was friendly and the place was clean.\n\nI'd definitely give this place a try again.","useful":0,"funny":0,"cool":0}
{"review_id":"R6npQB7CRzgE9-vLDSF1Tw","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"Oojj-vHvlp5DacCzGe26qA","stars":4,"date":"2013-01-22","text":"My girlfriend and I have lived in Vegas nearly 40 years. We've been through Boulder City many times but never actually stopped anywhere other than to get gas.\n\nToday we decided to play tourist in Boulder City. This was one of the first stores we stopped in. Actually we stopped in Goat Feather Too.\n\nThe woman working the story was very friendly and helpful. When she heard we were from Vegas and that this was our first time actually checking out the town she went out of her way to tell us all about where we should visit.\n\nAlthough this was our first visit we were impressed enough with all of the antique stores that we plan on coming back when we need to do some gift shopping. These stores have something for everyone. This will definitely be one of the stores we revisit.\n\nThanks again for making our visit fun!","useful":3,"funny":0,"cool":1}
{"review_id":"wV1CusPl46bXkE8xX39jgA","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"87bozyZ6vtlEDy33Ek_fZw","stars":1,"date":"2013-01-22","text":"My girlfriend and I have lived in Vegas nearly 40 years. We've been through Boulder City many times but never actually stopped anywhere other than to get gas.\n\nToday we decided to play tourist in Boulder City. Many of the shops we stopped in made us feel very welcome. This was not one of them.\n\nUpon entering the store there was a group of just over half a dozen people in there. They were probably just checking it out like us. Shortly after they left we heard one of the clerks comment to the other about how big the group was and how cheap they were not to purchase anything. \n\nWe left shortly after hearing that comment. I work in retail myself and sure I've been know to complain about cheap customers but I always make sure they're out of earshot and they get my friendliest service. \n\nThis place could use some lessons on customer service.\n\nAll this aside....the place did look great.","useful":1,"funny":0,"cool":1}
{"review_id":"iB6s0FDFKRXq3s9fgQDkVg","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"PhGpWmiHPlgCjQNb6qYZYA","stars":5,"date":"2013-05-15","text":"I hiked to this peak a number of years ago. I recall it being quite a work out. I was in my mid 40s at the time and in fairly decent shape. This isn't a hike you'd want to do on a whim with no previous hiking experience.\n\nIt'll definitely have you gasping for breath and feeling the burn in your legs.\n\nI do recall the climb was fairly straight forward meaning not much chance of getting lost. I recall climbing to the ridgeline then just following it to the summit.","useful":4,"funny":0,"cool":1}
{"review_id":"JsGASokYzaRrp_yfefxSRQ","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"QhMhM3Mhokv6V-H0MRuYTg","stars":2,"date":"2013-05-19","text":"I work in the area so have eaten at this location numerous times.\n\nThe location is right across from the Mandalay Bay.\n\nThe staff at this location changes constantly. But no matter how often the staff changes you can always count on them being inept. \n\nIf you have to eat here I'd suggest walking inside. The drive through is always a long wait.\n\nThe food is typical McDonalds except for their french fries. At most McDonalds I love their fries...not at this place. They're always old and it taste as if they never change the oil in their fryer.  I've never had a good french fry at this place.\n\nIf you're really craving McDonalds I'd suggest you try another one.","useful":1,"funny":0,"cool":1}
{"review_id":"R8GWjIwDjl7s4I-V7kLFAA","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"91JwvxaCYhLWnAOWp_AmeQ","stars":2,"date":"2013-04-30","text":"I've eaten here several times as I work in the area.\n\nAs usual for a food court area in a casino it's always very loud here. The line is usually very long as well.\n\nI've never tried Popeyes prior to this place opening and can say after several visits that if this is typical of all Popeyes Chicken I'm not a big fan of their food.","useful":1,"funny":0,"cool":0}
{"review_id":"bavzXgsoYR4lwVVX3LkvMg","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"7U-yh8dvsvhd87i2crfOAw","stars":5,"date":"2014-06-06","text":"If you've never been here and you're  visiting Vegas find the time to go visit this place.\n\nThis is the kind of place that makes you proud of what the human race can accomplish. \n\nAlong with taking some snapshots take whatever tour they currently have available to learn about how this place was built. It really is amazing!","useful":0,"funny":0,"cool":0}
{"review_id":"8oFUMhJ7fR2-X3We9TiK7g","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"kfo1hXvNtGGThfrZGaWtVw","stars":4,"date":"2013-01-25","text":"I've been here a few times over the years. I'd probably eat here more if I didn't live on the opposite side of town.\n\nI've always enjoyed my experience here and look forward to eating there again.","useful":1,"funny":0,"cool":1}
{"review_id":"2VYQkcF03uZLTO7yzvnxZg","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"4gQco-PeH8CTu9Hs8qpblA","stars":5,"date":"2014-04-26","text":"I've been coming here for decades. Literally since the mid 70s. \n\nThe staff has always been friendly and courteous. The doctors are always informative and willing to answer any questions or concerns I might have.\n\nI now live in Anaheim but was in town for my vacation. I made it a point to stop in and have my eyes examined while I was in Vegas.\n\nI'll be continuing to visit these folks for years to come.","useful":1,"funny":0,"cool":0}
{"review_id":"JQUA0chmehC-2oe26uh_LA","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"XdhJ7PjfMjBmZwvKikWlkA","stars":2,"date":"2013-02-03","text":"My girlfriend and I decided to order out one evening and wanted to try someplace new.\n\nWe decided to try Seattle Dan's. Well the good part first. The price was right. Delivery was fairly quick. And the service was friendly.\n\nThe bad news was the food was the worst I've ever had delivered. \n\nThe best thing I can say about their pizza is that it was edible. I'm sure homeless people would love it.\n\nTheir wings were the absolute worst I've ever had. They looked like they were uncooked and didn't taste much like they were either. I'm not sure you could get a homeless person to eat these. You might be able to persuade a homeless dog.\n\nUnless they improve their menu I\"d never order from them again.","useful":0,"funny":0,"cool":0}
{"review_id":"fHXRVWJv8jgR-HZQfsoFhA","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"sWqQQRiD3YBxNJlPrMSNIw","stars":4,"date":"2013-05-15","text":"Years ago this place was well away from the city. Nowadays the city has build right up to and around it.\n\nWent out there today with my daughter and our dogs and walked around the place. It was very quiet and peaceful. Just like I remembered it from years ago. I'm sure it helped that it was only 8 AM and a weekday.  I bet it gets busier on weekends.\n\nMy one complaint was that the ponds looked like they could really use a cleaning. I saw food wrappers and empty bottles floating in all of them.\n\nThe dogs had a blast running around and I enjoyed a quiet morning walk with my daughter.","useful":3,"funny":0,"cool":2}
{"review_id":"YfcyLNPWXL9ihdnLIsX_Yg","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"q3dJQtwZQrrurNT-1bNKgQ","stars":4,"date":"2017-02-15","text":"We've been wanting to try this restaurant for sometime now and I thought Valentines Day would be the perfect day to give it a try.\n\nUnfortunately I didn't think of reserving it until about 4 days before Valentines. The only time they had left was 9:45 PM. I reserved it anyway.\n\nI was a little concerned they'd be rushing us to finish our meal, so we arrived about 40 minutes early. I figured we could have a couple of drinks at the bar if they weren't able to seat us. Fortunately they were able to seat us right away.\n\nOur waitress, Mettia, was awesome! Attentive and professional and friendly.\n\nThe ambiance was great.\n\nThe food was mediocre and we waited over an hour from when we placed our order for the food to arrive.\n\nThe staff and ambiance are reason enough for a return visit. I just hope they can improve the quality of their food and the speed of delivery.\n\nOverall we really enjoyed ourselves and would recommend it to others.","useful":1,"funny":0,"cool":0}
{"review_id":"iLSq7R0OO6FueTH5O-toOQ","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"E3yER5W6Wsyc5ncGKb9Nzw","stars":4,"date":"2014-06-15","text":"I've visited this place on and off since the 70s. This casino is a throwback to the old casino days when the hotels were smaller and smoke filled.\n\nThey've done some remodeling over the years but if ya wanna know what the hotels in Vegas use to be like pay a visit to this place.","useful":2,"funny":0,"cool":1}
{"review_id":"yFJyLPHoeeHmxnLB9rDpEg","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"xoGPeHR2RPnJW470-aYBUQ","stars":3,"date":"2015-09-26","text":"We had breakfast here every morning during our three-day stay.\n\nThe food was average as was the service.\n\nUsually have a short wait to get seated and to get your check when you finished eating.\n\nI definitely wouldn't go out of my way to eat here.","useful":0,"funny":0,"cool":0}
{"review_id":"GENDu-CmWt_ziH2DO-EVtA","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"Lq_9qTx3ruvdRBzEFIEWPg","stars":4,"date":"2013-07-17","text":"Not much here other then a couple of picnic tables and a restroom. It does provide a nice place to park if you plan to hike around  Cheyenne Mntn. and want to start on the northern end of it.","useful":1,"funny":0,"cool":0}
{"review_id":"yLxftXAm7dOCnXkzDVcUHw","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"RqpL5Y50F9exjyHfpTzp3w","stars":4,"date":"2017-02-16","text":"Stopped in here to pick up lunch on the way home today. \n\nTo be honest I haven't eaten in a Sonic in forever. So parking at one of their little ordering machines I got out of my car and was about to walk in because I didn't know if I could order food to go while parked at one of their ordering machines. Also I'm sure there is a better name then \"ordering machine\"...maybe ordering station, vending space???? I'm sure if you've ever been to one you know what I'm referring to.\n\nAnyway a young lady comes outside to tell me how a Sonic works. I could order from a machine outside to eat at one of their tables, or I could eat in my car while parked at one of their ordering stations, or they actually have a drive through.  I'm sure she must have wondered what was up with the \"old guy\" who didn't know how a fast food joint worked. Anyway she was kind and polite and did her best not to make me feel like a absent minded \"old guy\"\n\nWeighing my options I decided to use their drive through. I ordered a couple hot dogs. One mustard only and a Chicago style dog. A order of tater tots and a number 1 which is just a classic burger, fries and a drink.\n\nAs is typical for a fast food joint it was staffed with a very young group of people. What was not typical for a fast food joint is they actually got my order right.\n\nFood was actually pretty good for a fast food joint. I'm sure when I feel like abusing my body with fast food I'll visit this place again.","useful":1,"funny":1,"cool":1}
{"review_id":"ATS7p5iNOTeMj4WcjrwEgQ","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"XXuFOXOLODvH5LVIOQzIwQ","stars":3,"date":"2017-04-20","text":"Stopped in here today while visiting Boulder City. We enjoy visiting the different antique stores.\n\nMany unique items to be found in here, although the couple items that I was interested in seemed over priced. I didn't have a chance to discuss these items with anyone as the one person working the store was busy trying to buy some merchandise from an older woman in the store.\n\nI know business is business but perhaps this should have been done somewhere else. It almost sounded as if you were trying to talk a poor old woman out of her family heirlooms.","useful":0,"funny":0,"cool":0}
{"review_id":"uq10AWEbS_kgej1FiS_iLw","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"p4JsD_Ya0NRXNdnhbVBs0A","stars":5,"date":"2015-09-26","text":"While staying at the hotel we took in a movie here. Totally enjoyed this theatre. Most comfortable seats I've ever experienced at a movie theatre.","useful":2,"funny":0,"cool":0}
{"review_id":"BU4KiBXGvrudZ_Dbx0lT_g","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"yhgUyctWczUN13MinNgZ3w","stars":3,"date":"2017-05-20","text":"I recently payed this establishment a visit because I was here for a convention. \nWhen you've lived here as long as I have a casino is a casino is a casino.\n\nThat being said I do have a fondness for these older Vegas hotels. I like the lower ceilings. They remind me of the old days of Vegas. Back when the casinos cared about their customers. Also remember Elvis once walked these grounds.\n\nAs is typical nowadays in Vegas everything is way overpriced. \n\nThe employees I encountered were all polite.","useful":1,"funny":0,"cool":0}
{"review_id":"xryg94pDLOO71veGcQINuQ","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"dfRAK2mgdHbL2_YsFqtCdQ","stars":1,"date":"2014-07-14","text":"I used to come here back in the 90s when this was a great bar.\n\nWell it's no longer the 90s and it's no longer a great bar.","useful":1,"funny":1,"cool":0}
{"review_id":"0Q15X1g8ErIug1HAkfx2Yg","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"SHj_WEN8p2U3LsglfdUY7A","stars":5,"date":"2013-02-03","text":"This is an easy trail you can make it as short or as long as you like depending on your fitness level.\n\nGreat views of Lake Mead and the surrounding desert!\n\nGreat views, great hike, historic significance! Take the time to check this place out.","useful":1,"funny":0,"cool":1}
{"review_id":"9v1t9-LIoUf2M6nAsJKzqg","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"1Lbq92b6B9z1FYk5mS2R9Q","stars":4,"date":"2013-02-03","text":"I've visited this place a half a dozen times over the years. Usually it's a quick stop for something to eat late at night after I get off work.\n\nThe food and the service have always been great.","useful":0,"funny":0,"cool":1}
{"review_id":"izzYICg1JYsdg7t9W6FQcw","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"ngs16C2M_uTq2zXamltHVw","stars":3,"date":"2017-05-28","text":"So leaving work the other night I was in the mood for some BBQ. A quick Yelp review showed this place was on my way home.\n\nIt's a small place in a business district. The young tatted girl working the counter was polite and helpful.\n\nAfter perusing their menu I decided to order a full slab of beef ribs, a order of mac and cheese and two orders of coleslaw. With a tip it came to $53\n\nI wanted to get a bottle of soda to go but they don't sell it by the bottle and I didn't want to spill it in my car on the way home. So I passed on the soda.\n\nWe found the entire meal to be okay. The ribs were very pink in the middle. I suppose some like it that way. But they were much more pink than we prefer.\n\nNeither of us liked the mac and cheese. We found the macaronis to be way over cooked. We prefer them to have a little bit of firmness.\n\nThe cole slaw was the best part of the meal, although it was a bit dry. If there was a little slaw juice in with it it would be great!\n\nSo would I stop here again. Perhaps, but I think I'd try something different. \n\nAnd bottles or cans of soda would be great so you wouldn't have to stop somewhere else.","useful":3,"funny":0,"cool":0}
{"review_id":"Puq97bvhD6lVZkQw1yxv_w","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"ym5FOqL6tGbgynzwKMHZuw","stars":2,"date":"2017-05-20","text":"I drive by this place just about everyday on my way to work. I've always been curious about it.\n\nWhile out and about yesterday we decided to stop in and give it a try.\n\nI ordered the shrimp PO Boy sandwich. My girl ordered the BLT.\n\nThe BLT was edible. The Shrimp Po Boy was not. \nI'm not a picky eater, but I was only able to take two bites of the Po Boy. It tasted like old grease. The shrimp were tasteless.\n\nThe waiter stopped by and asked how the food was. I told him horrible. He just smiled and walked away. I think he must have misheard me  LOL\n\nOther options may be better, but you've only got one shot to make a first impression. The impression they left won't have us coming back.","useful":3,"funny":0,"cool":1}
{"review_id":"adNS6X4TnaxuFFxzoezGzg","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"So132GP_uy3XbGs0KNyzyw","stars":5,"date":"2017-02-10","text":"I've eaten here a couple of times. Great food! Friendly staff! Excellent ambiance.\n\nCan't wait to visit here again.","useful":3,"funny":1,"cool":0}
{"review_id":"WqCf_7wUFcXZpdKiD4alZg","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"rtpsCmEEFT57Wr2VuU2FdA","stars":4,"date":"2017-01-31","text":"Just moved to this area and needing a haircut I got on Yelp to see where I'd find my new barber. \n\nI had selected another place but arriving there found they were closed on Mondays. So another quick Yelp search and I found this place.\n\nWalking in I saw a bunch of younger guys getting their typical haircuts. I'm an old guy so was a little concerned I'd walk out with a 20 something haircut.\n\nMy barber, I think Napoleon was his name, was very good. He asked plenty of questions so that he'd get my hair just how I like it.\n\nGreat job here and I'll definitely be back.","useful":2,"funny":0,"cool":0}
{"review_id":"T86zPzadNf8Ryw_aniuooA","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"M5dqqrla2JsBn5G3pV3Dmg","stars":4,"date":"2014-07-31","text":"I've hiked this trail a few times. I wouldn't say it's one of the most scenic hikes in the area but it is beautiful.\n\nWatch out for those switchbacks on the way up they seem to never end.\n\nOnce you reach the top Bonanza Peak is not too far off.","useful":2,"funny":0,"cool":0}
{"review_id":"VIAGXpdyrJAwal1dvBJDEQ","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"M1uWeMO42AI6fapl3utJoA","stars":5,"date":"2013-05-19","text":"Spring Mountain National Recreation Area is a very generic term as there's so much that that title covers.\n\nThere's hiking trails, picnic areas, motels, restaurants, skiing, mountain biking, camping....if you enjoy the outdoors there's literally something for everyone here.\n\nIf you can't find something enjoyable to do up here you've got a problem.","useful":1,"funny":1,"cool":0}
{"review_id":"g4FLjg1o1v1Se5xLxoFYUw","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"ry9sjfc7MO8e7fgS8b0oGQ","stars":4,"date":"2013-07-17","text":"This is a nice area and very easy to drive to. You'll find this area packed on the weekends because it's so easy to get to.\n\nAlthough I'm not a fan of crowds of people and would rather visit nature without the crowds I still give this place 4 stars. You just have to know when to visit when they're are less people. \n\nTry a weekday when it's not so nice out. Windy, rainy days are good. Besides those kind of days make a hike more interesting.","useful":0,"funny":0,"cool":0}
{"review_id":"1RkLsflPdbkN-tLDWDR_yQ","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"IjmqHVUkiY1hCewisy-5MA","stars":4,"date":"2013-02-03","text":"For just a $2.00 entrance fee you can't beat this place. Very interesting and informative. I haven't been out here in years but today my girlfriend and I spent an enjoyable morning checking it out.\n\nMy only piece of constructive criticism would be that some of the outdoor displays in the ghost town need to be redone. They have become weathered and are often times hard to read.","useful":1,"funny":0,"cool":0}
{"review_id":"3iQMYQPf854xQ8saNBKDqw","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"_N0aR1Ncx2Fr_Letz25Smw","stars":4,"date":"2017-04-20","text":"We love the town of Boulder City and often visited it when we need to get away from the crowds of Las Vegas.\n\nIt's been awhile since we've been to Boulder City and we didn't recall seeing this shop so we stopped in.\n\nThe guy working the store was friendly. If you need anything alien related this is definitely the place to go.\n\nIt seemed out of place in Boulder City to me. I mean I don't think Boulder City is exactly a UFO hot bed but still I wish them well.\n\nDefinitely an interesting store to visit.","useful":0,"funny":0,"cool":0}
{"review_id":"-iA_J7WA5Sdo1er8pxFA9Q","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"GG9VcABDC1hDFnjVi6q5Fw","stars":4,"date":"2017-04-20","text":"Very busy here this morning. We opted to go inside because the drive-through was very long.\n\nThere wasn't much of a line inside and the guy behind the counter was very friendly.\n\nThe wait time for my gfs drink wasn't too long.","useful":0,"funny":0,"cool":0}
{"review_id":"8ONHAZh48ePawabf1D4WTg","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"8RaBVWFkysjREG-1itH_pg","stars":4,"date":"2013-07-16","text":"I normally don't like coffee shops on the strip but I do like this one.\n\nThe place looks clean and smells great. Staff is friendly. I'll be revisiting it.","useful":0,"funny":0,"cool":0}
{"review_id":"JyOWXyxpN0PmPAF3OXkfCQ","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"cZBCVzd4lg_jx8IiFz-Iag","stars":4,"date":"2013-02-06","text":"Have grabbed a quick bite to eat hear many times as it's right around the corner from me.\n\nAlways quick and friendly. Sometimes when I have my dog in the car they even give her a treat.","useful":0,"funny":0,"cool":0}
{"review_id":"ClB81WvkDJwDnHN6evg84w","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"WzkbnhI-fxdH_tMzT3evtA","stars":5,"date":"2013-02-06","text":"This is one of the best bars in town. Not many of the yuppie types here. Thank god.\n\nGreat food, friendly staff and customers.\n\nKaraoke nights with James are a blast!","useful":1,"funny":0,"cool":0}
{"review_id":"iRtOFRs5Uhyq6amryV8mHg","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"TDTASGFy_aGp6vy0i23mDA","stars":2,"date":"2017-03-29","text":"Stopped in here recently for lunch. I ordered a chicken sandwich combo to go.\n\nThe two guys working the front counter had the enthusiasm of a couple of rocks. It looked like it was an effort for them to even take a step. I understand it's probably not the best job in the world but there are people like me who recruit our employees from people we run into during our day to day activities. These two have zero chances of being recruited to work somewhere else.\n\nI also had to ask for the fries that went with my combo. I got them, but only after a heavy sigh from one of the two at the counter. You would have thought I'd asked him to come outside and change my tire rather then just asking them for a bag of fries.\n\nThe food was mediocre, probably a three. But the lack of enthusiastic service definitely drops it to a two.","useful":1,"funny":0,"cool":0}
{"review_id":"-CvMJYsQc2rrkdiGYEaRJw","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"nUR_AQd_6Dhpx3sb2T6meg","stars":3,"date":"2017-02-18","text":"Stopped in here this evening for a drink. Bar was packed. We managed to squeeze up to the bar and order a drink. We had to take our drinks to a table as there was nowhere at the bar to sit.\n\nThe bartender noticed us as soon as we came in. This is a plus. Seems a lot of bartenders tend to ignore you for awhile unless you're a regular.\n\nWe also ordered a basket of fries which were quite tasty.\n\nSo why only a 3 star rating? We're new to the area and we're looking for a friendly type of bar. A place where customers actually talk to each other rather than hunch over their poker machines.\n\nThis place is nice enough but it's made from the same mold as many of the bars in Vegas.","useful":0,"funny":0,"cool":0}
{"review_id":"07a2plnul5U37VSEgarugA","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"0QzCeORfF8EY34UODWRV9A","stars":2,"date":"2015-09-26","text":"This review is for my room only. The rest of our three day stay was enjoyable.\n\nI've stayed in many hotel rooms, but this is the first time I've stayed in one with no coffee pot. Not only no coffee but no small fridge and no ironing board.","useful":2,"funny":1,"cool":0}
{"review_id":"AvW9fau7yOsR2RwQyCHg2w","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"vGAJwqvfJLoeHdaM-8eRng","stars":3,"date":"2014-04-25","text":"Ate here tonight with my family. It wouldn't hurt the hostesses to learn how to smile now and then.\n\nThe food was good and our waiter was polite and friendly.\n\nEverything was a bit slow tonight. Wait time for a seat was about 20 minutes. Fortunately the time spent waiting for our food passed quickly as we spent the time catching up with the family we hadn't seen in awhile.","useful":1,"funny":0,"cool":0}
{"review_id":"2Xj5NL2pnGcj2UT0qxY21A","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"60uVlCUiLJvq3xNo_3bhQQ","stars":4,"date":"2017-03-14","text":"Friendly staff. Clean place. \n\nVisited with one of the employees while waiting for our pizza. Didn't realize how long this business had operated in Vegas. Will definitely be back. I enjoy places that gave a bit of history to them.","useful":0,"funny":0,"cool":0}
{"review_id":"jb28Fwfp0VI3lqIkIiEcRw","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"K8MWIwCrS5w-Dbi9UHOlhw","stars":4,"date":"2014-05-26","text":"Been in here many times over the years. I wish they still had the dance hall saloon.\n\nThe Mexican restaurant Willy and Jose's is awesome. \n\nIf you need to buy yourself some western garb this is a great place to do it at.\n\nNice movie theater here.\n\nI've spent a night or two here and have never had any complaints with their rooms.","useful":3,"funny":0,"cool":0}
{"review_id":"B-9SSOmrsWyE4bGvVeYjMA","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"qsJkjQoM3Hdg6Gtqp2S9_w","stars":4,"date":"2013-04-04","text":"Ate here with my girlfriend this evening. She had the Mongolian entree and I had the Pad Cha Cha Cha entree. Both were excellent.\n\nWe've also eaten here once before and had no complaints that time either.\n\nService was prompt and friendly.\n\nWe'll definitely be back again.","useful":0,"funny":0,"cool":0}
{"review_id":"w9Sxzph-5lE-r52YS4pS5A","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"-IcHkc7uWC8dHGlAOK4sJw","stars":5,"date":"2017-04-03","text":"I've been in here a couple of times.\n\nToday I stopped in and wanted to pick up a few common wheat back pennies & a ounce of silver. Their salesman Dominic was great! Even though I wasn't spending a great deal of money he took the time to help me find exactly what I was looking for.\n\nWhen it comes time to pick up those key dates I'll definitely come back here because of the great service.","useful":10,"funny":1,"cool":2}
{"review_id":"Nud2yMAJDKbYDTshJoHfiQ","user_id":"tL2pS5UOmN6aAOi3Z-qFGg","business_id":"Hz-OXis4Hk9l187LPBo_8g","stars":4,"date":"2013-05-26","text":"This location just opened. May 24th 2013 was there first day of business.\n\nI hadn't eaten at a Schlotzsky's for many years, so being as I work in the area I was looking forward  to having somewhere new to have lunch at.\n\nI've eaten there twice now since they opened. On both visits they were fast and very friendly. Being they're brand new  you really wouldn't expect less than stellar service.\n\nThe food was good and a real change of pace to what has been available around here.","useful":1,"funny":1,"cool":1}
